TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
    struct {
      __IOM uint32_t GPIO48INCFG : 1;           /*!< [0..0] GPIO48 input enable.                                               */
      __IOM uint32_t GPIO48OUTCFG : 2;          /*!< [2..1] GPIO48 output configuration.                                       */
      __IOM uint32_t GPIO48INTD : 1;            /*!< [3..3] GPIO48 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO49INCFG : 1;           /*!< [4..4] GPIO49 input enable.                                               */
      __IOM uint32_t GPIO49OUTCFG : 2;          /*!< [6..5] GPIO49 output configuration.                                       */
      __IOM uint32_t GPIO49INTD : 1;            /*!< [7..7] GPIO49 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO50INCFG : 1;           /*!< [8..8] GPIO50 input enable.                                               */
      __IOM uint32_t GPIO50OUTCFG : 2;          /*!< [10..9] GPIO50 output configuration.                                      */
      __IOM uint32_t GPIO50INTD : 1;            /*!< [11..11] GPIO50 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO51INCFG : 1;           /*!< [12..12] GPIO51 input enable.                                             */
      __IOM uint32_t GPIO51OUTCFG : 2;          /*!< [14..13] GPIO51 output configuration.                                     */
      __IOM uint32_t GPIO51INTD : 1;            /*!< [15..15] GPIO51 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO52INCFG : 1;           /*!< [16..16] GPIO52 input enable.                                             */
      __IOM uint32_t GPIO52OUTCFG : 2;          /*!< [18..17] GPIO52 output configuration.                                     */
      __IOM uint32_t GPIO52INTD : 1;            /*!< [19..19] GPIO52 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO53INCFG : 1;           /*!< [20..20] GPIO53 input enable.                                             */
      __IOM uint32_t GPIO53OUTCFG : 2;          /*!< [22..21] GPIO53 output configuration.                                     */
      __IOM uint32_t GPIO53INTD : 1;            /*!< [23..23] GPIO53 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO54INCFG : 1;           /*!< [24..24] GPIO54 input enable.                                             */
      __IOM uint32_t GPIO54OUTCFG : 2;          /*!< [26..25] GPIO54 output configuration.                                     */
      __IOM uint32_t GPIO54INTD : 1;            /*!< [27..27] GPIO54 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO55INCFG : 1;           /*!< [28..28] GPIO55 input enable.                                             */
      __IOM uint32_t GPIO55OUTCFG : 2;          /*!< [30..29] GPIO55 output configuration.                                     */
      __IOM uint32_t GPIO55INTD : 1;            /*!< [31..31] GPIO55 interrupt direction, nCE polarity.                        */
    } CFGG_b;
  } ;

  union {
    __IOM uint32_t CFGH;                        /*!< (@ 0x00000068) GPIO Configuration H (Pads 63-56)                          */

    struct {
      __IOM uint32_t GPIO56INCFG : 1;           /*!< [0..0] GPIO56 input enable.                                               */
      __IOM uint32_t GPIO56OUTCFG : 2;          /*!< [2..1] GPIO56 output configuration.                                       */
      __IOM uint32_t GPIO56INTD : 1;            /*!< [3..3] GPIO56 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO57INCFG : 1;           /*!< [4..4] GPIO57 input enable.                                               */
      __IOM uint32_t GPIO57OUTCFG : 2;          /*!< [6..5] GPIO57 output configuration.                                       */
      __IOM uint32_t GPIO57INTD : 1;            /*!< [7..7] GPIO57 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO58INCFG : 1;           /*!< [8..8] GPIO58 input enable.                                               */
      __IOM uint32_t GPIO58OUTCFG : 2;          /*!< [10..9] GPIO58 output configuration.                                      */
      __IOM uint32_t GPIO58INTD : 1;            /*!< [11..11] GPIO58 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO59INCFG : 1;           /*!< [12..12] GPIO59 input enable.                                             */
      __IOM uint32_t GPIO59OUTCFG : 2;          /*!< [14..13] GPIO59 output configuration.                                     */
      __IOM uint32_t GPIO59INTD : 1;            /*!< [15..15] GPIO59 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO60INCFG : 1;           /*!< [16..16] GPIO60 input enable.                                             */
      __IOM uint32_t GPIO60OUTCFG : 2;          /*!< [18..17] GPIO60 output configuration.                                     */
      __IOM uint32_t GPIO60INTD : 1;            /*!< [19..19] GPIO60 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO61INCFG : 1;           /*!< [20..20] GPIO61 input enable.                                             */
      __IOM uint32_t GPIO61OUTCFG : 2;          /*!< [22..21] GPIO61 output configuration.                                     */
      __IOM uint32_t GPIO61INTD : 1;            /*!< [23..23] GPIO61 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO62INCFG : 1;           /*!< [24..24] GPIO62 input enable.                                             */
      __IOM uint32_t GPIO62OUTCFG : 2;          /*!< [26..25] GPIO62 output configuration.                                     */
      __IOM uint32_t GPIO62INTD : 1;            /*!< [27..27] GPIO62 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO63INCFG : 1;           /*!< [28..28] GPIO63 input enable.                                             */
      __IOM uint32_t GPIO63OUTCFG : 2;          /*!< [30..29] GPIO63 output configuration.                                     */
      __IOM uint32_t GPIO63INTD : 1;            /*!< [31..31] GPIO63 interrupt direction, nCE polarity.                        */
    } CFGH_b;
  } ;

  union {
    __IOM uint32_t CFGI;                        /*!< (@ 0x0000006C) GPIO Configuration I (Pads 71-64)                          */

