TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
    struct {
      __IOM uint32_t WTC        : 10;           /*!< [9..0] GPIO73-64 write data.                                              */
    } WTC_b;
  } ;

  union {
    __IOM uint32_t WTSA;                        /*!< (@ 0x00000098) GPIO Output A Set (31-0)                                   */

    struct {
      __IOM uint32_t WTSA       : 32;           /*!< [31..0] Set the GPIO31-0 write data.                                      */
    } WTSA_b;
  } ;

  union {
    __IOM uint32_t WTSB;                        /*!< (@ 0x0000009C) GPIO Output B Set (63-32)                                  */

    struct {
      __IOM uint32_t WTSB       : 32;           /*!< [31..0] Set the GPIO63-32 write data.                                     */
    } WTSB_b;
  } ;

  union {
    __IOM uint32_t WTSC;                        /*!< (@ 0x000000A0) GPIO Output C Set (73-64)                                  */

    struct {
      __IOM uint32_t WTSC       : 10;           /*!< [9..0] Set the GPIO73-64 write data.                                      */
    } WTSC_b;
  } ;

  union {
    __IOM uint32_t WTCA;                        /*!< (@ 0x000000A4) GPIO Output A Clear (31-0)                                 */

    struct {
      __IOM uint32_t WTCA       : 32;           /*!< [31..0] Clear the GPIO31-0 write data.                                    */
    } WTCA_b;
  } ;

  union {
    __IOM uint32_t WTCB;                        /*!< (@ 0x000000A8) GPIO Output B Clear (63-32)                                */

    struct {
      __IOM uint32_t WTCB       : 32;           /*!< [31..0] Clear the GPIO63-32 write data.                                   */
    } WTCB_b;
  } ;

  union {
    __IOM uint32_t WTCC;                        /*!< (@ 0x000000AC) GPIO Output C Clear (73-64)                                */

    struct {
      __IOM uint32_t WTCB       : 10;           /*!< [9..0] Clear the GPIO73-64 write data.                                    */
    } WTCC_b;
  } ;

  union {
    __IOM uint32_t ENA;                         /*!< (@ 0x000000B0) GPIO Enable A (31-0)                                       */

    struct {
      __IOM uint32_t ENA        : 32;           /*!< [31..0] GPIO31-0 output enables                                           */
    } ENA_b;
  } ;

  union {
    __IOM uint32_t ENB;                         /*!< (@ 0x000000B4) GPIO Enable B (63-32)                                      */

    struct {
      __IOM uint32_t ENB        : 32;           /*!< [31..0] GPIO63-32 output enables                                          */
    } ENB_b;
  } ;

  union {
    __IOM uint32_t ENC;                         /*!< (@ 0x000000B8) GPIO Enable C (73-64)                                      */

    struct {
      __IOM uint32_t ENC        : 10;           /*!< [9..0] GPIO73-64 output enables                                           */
    } ENC_b;
  } ;

  union {
    __IOM uint32_t ENSA;                        /*!< (@ 0x000000BC) GPIO Enable A Set (31-0)                                   */

    struct {
      __IOM uint32_t ENSA       : 32;           /*!< [31..0] Set the GPIO31-0 output enables                                   */
    } ENSA_b;
  } ;

  union {
    __IOM uint32_t ENSB;                        /*!< (@ 0x000000C0) GPIO Enable B Set (63-32)                                  */

    struct {
      __IOM uint32_t ENSB       : 32;           /*!< [31..0] Set the GPIO63-32 output enables                                  */
    } ENSB_b;
  } ;

  union {
    __IOM uint32_t ENSC;                        /*!< (@ 0x000000C4) GPIO Enable C Set (73-64)                                  */

    struct {
      __IOM uint32_t ENSC       : 10;           /*!< [9..0] Set the GPIO73-64 output enables                                   */
    } ENSC_b;
  } ;

  union {
    __IOM uint32_t ENCA;                        /*!< (@ 0x000000C8) GPIO Enable A Clear (31-0)                                 */

    struct {
      __IOM uint32_t ENCA       : 32;           /*!< [31..0] Clear the GPIO31-0 output enables                                 */
    } ENCA_b;
  } ;

  union {
    __IOM uint32_t ENCB;                        /*!< (@ 0x000000CC) GPIO Enable B Clear (63-32)                                */

    struct {
      __IOM uint32_t ENCB       : 32;           /*!< [31..0] Clear the GPIO49-32 output enables                                */
    } ENCB_b;
  } ;

  union {
    __IOM uint32_t ENCC;                        /*!< (@ 0x000000D0) GPIO Enable C Clear (73-64)                                */

    struct {
      __IOM uint32_t ENCC       : 10;           /*!< [9..0] Clear the GPIO73-64 output enables                                 */
    } ENCC_b;
  } ;

  union {
    __IOM uint32_t STMRCAP;                     /*!< (@ 0x000000D4) STIMER Capture Control                                     */

    struct {
      __IOM uint32_t STSEL0     : 7;            /*!< [6..0] STIMER Capture 0 Select.                                           */
      __IOM uint32_t STPOL0     : 1;            /*!< [7..7] STIMER Capture 0 Polarity.                                         */
      __IOM uint32_t STSEL1     : 7;            /*!< [14..8] STIMER Capture 1 Select.                                          */
      __IOM uint32_t STPOL1     : 1;            /*!< [15..15] STIMER Capture 1 Polarity.                                       */
      __IOM uint32_t STSEL2     : 7;            /*!< [22..16] STIMER Capture 2 Select.                                         */
      __IOM uint32_t STPOL2     : 1;            /*!< [23..23] STIMER Capture 2 Polarity.                                       */
      __IOM uint32_t STSEL3     : 7;            /*!< [30..24] STIMER Capture 3 Select.                                         */
      __IOM uint32_t STPOL3     : 1;            /*!< [31..31] STIMER Capture 3 Polarity.                                       */
    } STMRCAP_b;
  } ;

  union {
    __IOM uint32_t IOM0IRQ;                     /*!< (@ 0x000000D8) IOM0 Flow Control IRQ Select                               */

