TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
    struct {
      __IOM uint32_t PAD68_DS1  : 1;            /*!< [0..0] Pad 68 high order drive strength selection. Used in conjunction
                                                     with PAD68STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD68_SR   : 1;            /*!< [4..4] Pad 71 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD69_DS1  : 1;            /*!< [8..8] Pad 69 high order drive strength selection. Used in conjunction
                                                     with PAD69STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD69_SR   : 1;            /*!< [12..12] Pad 71 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD70_DS1  : 1;            /*!< [16..16] Pad 70 high order drive strength selection. Used in
                                                     conjunction with PAD70STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD70_SR   : 1;            /*!< [20..20] Pad 71 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD71_DS1  : 1;            /*!< [24..24] Pad 71 high order drive strength selection. Used in
                                                     conjunction with PAD71STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD71_SR   : 1;            /*!< [28..28] Pad 71 slew rate selection.                                      */
    } ALTPADCFGR_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGS;                  /*!< (@ 0x00000140) Alternate Pad Configuration S (Pads 73-72)                 */

    struct {
      __IOM uint32_t PAD72_DS1  : 1;            /*!< [0..0] Pad 72 high order drive strength selection. Used in conjunction
                                                     with PAD72STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD72_SR   : 1;            /*!< [4..4] Pad 72 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD73_DS1  : 1;            /*!< [8..8] Pad 73 high order drive strength selection. Used in conjunction
                                                     with PAD73STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD73_SR   : 1;            /*!< [12..12] Pad 73 slew rate selection.                                      */
    } ALTPADCFGS_b;
  } ;

  union {
    __IOM uint32_t SCDET;                       /*!< (@ 0x00000144) SCARD Card Detect select                                   */

    struct {
      __IOM uint32_t SCDET      : 7;            /*!< [6..0] SCARD card detect pad select.                                      */
    } SCDET_b;
  } ;

  union {
    __IOM uint32_t CTENCFG;                     /*!< (@ 0x00000148) Counter/Timer Enable Config                                */

    struct {
      __IOM uint32_t EN0        : 1;            /*!< [0..0] CT0 Enable                                                         */
      __IOM uint32_t EN1        : 1;            /*!< [1..1] CT1 Enable                                                         */
      __IOM uint32_t EN2        : 1;            /*!< [2..2] CT2 Enable                                                         */
      __IOM uint32_t EN3        : 1;            /*!< [3..3] CT3 Enable                                                         */
      __IOM uint32_t EN4        : 1;            /*!< [4..4] CT4 Enable                                                         */
      __IOM uint32_t EN5        : 1;            /*!< [5..5] CT5 Enable                                                         */
      __IOM uint32_t EN6        : 1;            /*!< [6..6] CT6 Enable                                                         */
      __IOM uint32_t EN7        : 1;            /*!< [7..7] CT7 Enable                                                         */
      __IOM uint32_t EN8        : 1;            /*!< [8..8] CT8 Enable                                                         */
      __IOM uint32_t EN9        : 1;            /*!< [9..9] CT9 Enable                                                         */
      __IOM uint32_t EN10       : 1;            /*!< [10..10] CT10 Enable                                                      */
      __IOM uint32_t EN11       : 1;            /*!< [11..11] CT11 Enable                                                      */
      __IOM uint32_t EN12       : 1;            /*!< [12..12] CT12 Enable                                                      */
      __IOM uint32_t EN13       : 1;            /*!< [13..13] CT13 Enable                                                      */
      __IOM uint32_t EN14       : 1;            /*!< [14..14] CT14 Enable                                                      */
      __IOM uint32_t EN15       : 1;            /*!< [15..15] CT15 Enable                                                      */
      __IOM uint32_t EN16       : 1;            /*!< [16..16] CT16 Enable                                                      */
      __IOM uint32_t EN17       : 1;            /*!< [17..17] CT17 Enable                                                      */
      __IOM uint32_t EN18       : 1;            /*!< [18..18] CT18 Enable                                                      */
      __IOM uint32_t EN19       : 1;            /*!< [19..19] CT19 Enable                                                      */
      __IOM uint32_t EN20       : 1;            /*!< [20..20] CT20 Enable                                                      */
      __IOM uint32_t EN21       : 1;            /*!< [21..21] CT21 Enable                                                      */
      __IOM uint32_t EN22       : 1;            /*!< [22..22] CT22 Enable                                                      */
      __IOM uint32_t EN23       : 1;            /*!< [23..23] CT23 Enable                                                      */
      __IOM uint32_t EN24       : 1;            /*!< [24..24] CT24 Enable                                                      */
      __IOM uint32_t EN25       : 1;            /*!< [25..25] CT25 Enable                                                      */
      __IOM uint32_t EN26       : 1;            /*!< [26..26] CT26 Enable                                                      */
      __IOM uint32_t EN27       : 1;            /*!< [27..27] CT27 Enable                                                      */
      __IOM uint32_t EN28       : 1;            /*!< [28..28] CT28 Enable                                                      */
      __IOM uint32_t EN29       : 1;            /*!< [29..29] CT29 Enable                                                      */
      __IOM uint32_t EN30       : 1;            /*!< [30..30] CT30 Enable                                                      */
      __IOM uint32_t EN31       : 1;            /*!< [31..31] CT31 Enable                                                      */
    } CTENCFG_b;
  } ;
  __IM  uint32_t  RESERVED1[45];

  union {
    __IOM uint32_t INT0EN;                      /*!< (@ 0x00000200) GPIO Interrupts 31-0: Enable                               */

