TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
    struct {
      __IOM uint32_t GPIO64     : 1;            /*!< [0..0] GPIO64 interrupt.                                                  */
      __IOM uint32_t GPIO65     : 1;            /*!< [1..1] GPIO65 interrupt.                                                  */
      __IOM uint32_t GPIO66     : 1;            /*!< [2..2] GPIO66 interrupt.                                                  */
      __IOM uint32_t GPIO67     : 1;            /*!< [3..3] GPIO67 interrupt.                                                  */
      __IOM uint32_t GPIO68     : 1;            /*!< [4..4] GPIO68 interrupt.                                                  */
      __IOM uint32_t GPIO69     : 1;            /*!< [5..5] GPIO69 interrupt.                                                  */
      __IOM uint32_t GPIO70     : 1;            /*!< [6..6] GPIO70 interrupt.                                                  */
      __IOM uint32_t GPIO71     : 1;            /*!< [7..7] GPIO71 interrupt.                                                  */
      __IOM uint32_t GPIO72     : 1;            /*!< [8..8] GPIO72 interrupt.                                                  */
      __IOM uint32_t GPIO73     : 1;            /*!< [9..9] GPIO73 interrupt.                                                  */
    } INT2EN_b;
  } ;

  union {
    __IOM uint32_t INT2STAT;                    /*!< (@ 0x00000244) GPIO Interrupts 73-64: Status                              */

    struct {
      __IOM uint32_t GPIO64     : 1;            /*!< [0..0] GPIO64 interrupt.                                                  */
      __IOM uint32_t GPIO65     : 1;            /*!< [1..1] GPIO65 interrupt.                                                  */
      __IOM uint32_t GPIO66     : 1;            /*!< [2..2] GPIO66 interrupt.                                                  */
      __IOM uint32_t GPIO67     : 1;            /*!< [3..3] GPIO67 interrupt.                                                  */
      __IOM uint32_t GPIO68     : 1;            /*!< [4..4] GPIO68 interrupt.                                                  */
      __IOM uint32_t GPIO69     : 1;            /*!< [5..5] GPIO69 interrupt.                                                  */
      __IOM uint32_t GPIO70     : 1;            /*!< [6..6] GPIO70 interrupt.                                                  */
      __IOM uint32_t GPIO71     : 1;            /*!< [7..7] GPIO71 interrupt.                                                  */
      __IOM uint32_t GPIO72     : 1;            /*!< [8..8] GPIO72 interrupt.                                                  */
      __IOM uint32_t GPIO73     : 1;            /*!< [9..9] GPIO73 interrupt.                                                  */
    } INT2STAT_b;
  } ;

  union {
    __IOM uint32_t INT2CLR;                     /*!< (@ 0x00000248) GPIO Interrupts 73-64: Clear                               */

    struct {
      __IOM uint32_t GPIO64     : 1;            /*!< [0..0] GPIO64 interrupt.                                                  */
      __IOM uint32_t GPIO65     : 1;            /*!< [1..1] GPIO65 interrupt.                                                  */
      __IOM uint32_t GPIO66     : 1;            /*!< [2..2] GPIO66 interrupt.                                                  */
      __IOM uint32_t GPIO67     : 1;            /*!< [3..3] GPIO67 interrupt.                                                  */
      __IOM uint32_t GPIO68     : 1;            /*!< [4..4] GPIO68 interrupt.                                                  */
      __IOM uint32_t GPIO69     : 1;            /*!< [5..5] GPIO69 interrupt.                                                  */
      __IOM uint32_t GPIO70     : 1;            /*!< [6..6] GPIO70 interrupt.                                                  */
      __IOM uint32_t GPIO71     : 1;            /*!< [7..7] GPIO71 interrupt.                                                  */
      __IOM uint32_t GPIO72     : 1;            /*!< [8..8] GPIO72 interrupt.                                                  */
      __IOM uint32_t GPIO73     : 1;            /*!< [9..9] GPIO73 interrupt.                                                  */
    } INT2CLR_b;
  } ;

  union {
    __IOM uint32_t INT2SET;                     /*!< (@ 0x0000024C) GPIO Interrupts 73-64: Set                                 */

    struct {
      __IOM uint32_t GPIO64     : 1;            /*!< [0..0] GPIO64 interrupt.                                                  */
      __IOM uint32_t GPIO65     : 1;            /*!< [1..1] GPIO65 interrupt.                                                  */
      __IOM uint32_t GPIO66     : 1;            /*!< [2..2] GPIO66 interrupt.                                                  */
      __IOM uint32_t GPIO67     : 1;            /*!< [3..3] GPIO67 interrupt.                                                  */
      __IOM uint32_t GPIO68     : 1;            /*!< [4..4] GPIO68 interrupt.                                                  */
      __IOM uint32_t GPIO69     : 1;            /*!< [5..5] GPIO69 interrupt.                                                  */
      __IOM uint32_t GPIO70     : 1;            /*!< [6..6] GPIO70 interrupt.                                                  */
      __IOM uint32_t GPIO71     : 1;            /*!< [7..7] GPIO71 interrupt.                                                  */
      __IOM uint32_t GPIO72     : 1;            /*!< [8..8] GPIO72 interrupt.                                                  */
      __IOM uint32_t GPIO73     : 1;            /*!< [9..9] GPIO73 interrupt.                                                  */
    } INT2SET_b;
  } ;

  union {
    __IOM uint32_t DBGCTRL;                     /*!< (@ 0x00000250) Debug Control                                              */

    struct {
      __IOM uint32_t GCLK0      : 1;            /*!< [0..0] Gate IOM0 CLK in SPI mode, allowing external input clock           */
      __IOM uint32_t GCLK1      : 1;            /*!< [1..1] Gate IOM1 CLK in SPI mode, allowing external input clock           */
      __IOM uint32_t GCLK2      : 1;            /*!< [2..2] Gate IOM2 CLK in SPI mode, allowing external input clock           */
      __IOM uint32_t GCLK3      : 1;            /*!< [3..3] Gate IOM3 CLK in SPI mode, allowing external input clock           */
      __IOM uint32_t GCLK4      : 1;            /*!< [4..4] Gate IOM4 CLK in SPI mode, allowing external input clock           */
      __IOM uint32_t GCLK5      : 1;            /*!< [5..5] Gate IOM5 CLK in SPI mode, allowing external input clock           */
    } DBGCTRL_b;
  } ;
} GPIO_Type;                                    /*!< Size = 596 (0x254)                                                        */



/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief IO Peripheral Master (IOM0)
  */

typedef struct {                                /*!< (@ 0x50004000) IOM0 Structure                                             */

  union {
    __IOM uint32_t FIFO;                        /*!< (@ 0x00000000) FIFO Access Port                                           */

