TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =========================================================================================================================== */
/* ================                                         CACHECTRL                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  CACHECFG  ======================================================== */
#define CACHECTRL_CACHECFG_ENABLE_MONITOR_Pos (24UL)                /*!< ENABLE_MONITOR (Bit 24)                               */
#define CACHECTRL_CACHECFG_ENABLE_MONITOR_Msk (0x1000000UL)         /*!< ENABLE_MONITOR (Bitfield-Mask: 0x01)                  */
#define CACHECTRL_CACHECFG_DATA_CLKGATE_Pos (20UL)                  /*!< DATA_CLKGATE (Bit 20)                                 */
#define CACHECTRL_CACHECFG_DATA_CLKGATE_Msk (0x100000UL)            /*!< DATA_CLKGATE (Bitfield-Mask: 0x01)                    */
#define CACHECTRL_CACHECFG_CACHE_LS_Pos   (11UL)                    /*!< CACHE_LS (Bit 11)                                     */
#define CACHECTRL_CACHECFG_CACHE_LS_Msk   (0x800UL)                 /*!< CACHE_LS (Bitfield-Mask: 0x01)                        */
#define CACHECTRL_CACHECFG_CACHE_CLKGATE_Pos (10UL)                 /*!< CACHE_CLKGATE (Bit 10)                                */
#define CACHECTRL_CACHECFG_CACHE_CLKGATE_Msk (0x400UL)              /*!< CACHE_CLKGATE (Bitfield-Mask: 0x01)                   */
#define CACHECTRL_CACHECFG_DCACHE_ENABLE_Pos (9UL)                  /*!< DCACHE_ENABLE (Bit 9)                                 */
#define CACHECTRL_CACHECFG_DCACHE_ENABLE_Msk (0x200UL)              /*!< DCACHE_ENABLE (Bitfield-Mask: 0x01)                   */
#define CACHECTRL_CACHECFG_ICACHE_ENABLE_Pos (8UL)                  /*!< ICACHE_ENABLE (Bit 8)                                 */
#define CACHECTRL_CACHECFG_ICACHE_ENABLE_Msk (0x100UL)              /*!< ICACHE_ENABLE (Bitfield-Mask: 0x01)                   */
#define CACHECTRL_CACHECFG_CONFIG_Pos     (4UL)                     /*!< CONFIG (Bit 4)                                        */
#define CACHECTRL_CACHECFG_CONFIG_Msk     (0xf0UL)                  /*!< CONFIG (Bitfield-Mask: 0x0f)                          */
#define CACHECTRL_CACHECFG_ENABLE_NC1_Pos (3UL)                     /*!< ENABLE_NC1 (Bit 3)                                    */
#define CACHECTRL_CACHECFG_ENABLE_NC1_Msk (0x8UL)                   /*!< ENABLE_NC1 (Bitfield-Mask: 0x01)                      */
#define CACHECTRL_CACHECFG_ENABLE_NC0_Pos (2UL)                     /*!< ENABLE_NC0 (Bit 2)                                    */
#define CACHECTRL_CACHECFG_ENABLE_NC0_Msk (0x4UL)                   /*!< ENABLE_NC0 (Bitfield-Mask: 0x01)                      */
#define CACHECTRL_CACHECFG_LRU_Pos        (1UL)                     /*!< LRU (Bit 1)                                           */
#define CACHECTRL_CACHECFG_LRU_Msk        (0x2UL)                   /*!< LRU (Bitfield-Mask: 0x01)                             */
#define CACHECTRL_CACHECFG_ENABLE_Pos     (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define CACHECTRL_CACHECFG_ENABLE_Msk     (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =========================================================  CTRL  ========================================================== */
#define CACHECTRL_CTRL_FLASH3_SLM_ENABLE_Pos (18UL)                 /*!< FLASH3_SLM_ENABLE (Bit 18)                            */
#define CACHECTRL_CTRL_FLASH3_SLM_ENABLE_Msk (0x40000UL)            /*!< FLASH3_SLM_ENABLE (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH3_SLM_DISABLE_Pos (17UL)                /*!< FLASH3_SLM_DISABLE (Bit 17)                           */
#define CACHECTRL_CTRL_FLASH3_SLM_DISABLE_Msk (0x20000UL)           /*!< FLASH3_SLM_DISABLE (Bitfield-Mask: 0x01)              */
#define CACHECTRL_CTRL_FLASH3_SLM_STATUS_Pos (16UL)                 /*!< FLASH3_SLM_STATUS (Bit 16)                            */
#define CACHECTRL_CTRL_FLASH3_SLM_STATUS_Msk (0x10000UL)            /*!< FLASH3_SLM_STATUS (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH2_SLM_ENABLE_Pos (14UL)                 /*!< FLASH2_SLM_ENABLE (Bit 14)                            */
#define CACHECTRL_CTRL_FLASH2_SLM_ENABLE_Msk (0x4000UL)             /*!< FLASH2_SLM_ENABLE (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH2_SLM_DISABLE_Pos (13UL)                /*!< FLASH2_SLM_DISABLE (Bit 13)                           */
#define CACHECTRL_CTRL_FLASH2_SLM_DISABLE_Msk (0x2000UL)            /*!< FLASH2_SLM_DISABLE (Bitfield-Mask: 0x01)              */
#define CACHECTRL_CTRL_FLASH2_SLM_STATUS_Pos (12UL)                 /*!< FLASH2_SLM_STATUS (Bit 12)                            */
#define CACHECTRL_CTRL_FLASH2_SLM_STATUS_Msk (0x1000UL)             /*!< FLASH2_SLM_STATUS (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH1_SLM_ENABLE_Pos (10UL)                 /*!< FLASH1_SLM_ENABLE (Bit 10)                            */
#define CACHECTRL_CTRL_FLASH1_SLM_ENABLE_Msk (0x400UL)              /*!< FLASH1_SLM_ENABLE (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH1_SLM_DISABLE_Pos (9UL)                 /*!< FLASH1_SLM_DISABLE (Bit 9)                            */
#define CACHECTRL_CTRL_FLASH1_SLM_DISABLE_Msk (0x200UL)             /*!< FLASH1_SLM_DISABLE (Bitfield-Mask: 0x01)              */
#define CACHECTRL_CTRL_FLASH1_SLM_STATUS_Pos (8UL)                  /*!< FLASH1_SLM_STATUS (Bit 8)                             */
#define CACHECTRL_CTRL_FLASH1_SLM_STATUS_Msk (0x100UL)              /*!< FLASH1_SLM_STATUS (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH0_SLM_ENABLE_Pos (6UL)                  /*!< FLASH0_SLM_ENABLE (Bit 6)                             */
#define CACHECTRL_CTRL_FLASH0_SLM_ENABLE_Msk (0x40UL)               /*!< FLASH0_SLM_ENABLE (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_FLASH0_SLM_DISABLE_Pos (5UL)                 /*!< FLASH0_SLM_DISABLE (Bit 5)                            */
#define CACHECTRL_CTRL_FLASH0_SLM_DISABLE_Msk (0x20UL)              /*!< FLASH0_SLM_DISABLE (Bitfield-Mask: 0x01)              */
#define CACHECTRL_CTRL_FLASH0_SLM_STATUS_Pos (4UL)                  /*!< FLASH0_SLM_STATUS (Bit 4)                             */
#define CACHECTRL_CTRL_FLASH0_SLM_STATUS_Msk (0x10UL)               /*!< FLASH0_SLM_STATUS (Bitfield-Mask: 0x01)               */
#define CACHECTRL_CTRL_CACHE_READY_Pos    (2UL)                     /*!< CACHE_READY (Bit 2)                                   */
#define CACHECTRL_CTRL_CACHE_READY_Msk    (0x4UL)                   /*!< CACHE_READY (Bitfield-Mask: 0x01)                     */
#define CACHECTRL_CTRL_RESET_STAT_Pos     (1UL)                     /*!< RESET_STAT (Bit 1)                                    */
#define CACHECTRL_CTRL_RESET_STAT_Msk     (0x2UL)                   /*!< RESET_STAT (Bitfield-Mask: 0x01)                      */
#define CACHECTRL_CTRL_INVALIDATE_Pos     (0UL)                     /*!< INVALIDATE (Bit 0)                                    */
#define CACHECTRL_CTRL_INVALIDATE_Msk     (0x1UL)                   /*!< INVALIDATE (Bitfield-Mask: 0x01)                      */
/* =======================================================  NCR0START  ======================================================= */
#define CACHECTRL_NCR0START_ADDR_Pos      (4UL)                     /*!< ADDR (Bit 4)                                          */
#define CACHECTRL_NCR0START_ADDR_Msk      (0x7fffff0UL)             /*!< ADDR (Bitfield-Mask: 0x7fffff)                        */
/* ========================================================  NCR0END  ======================================================== */
#define CACHECTRL_NCR0END_ADDR_Pos        (4UL)                     /*!< ADDR (Bit 4)                                          */
#define CACHECTRL_NCR0END_ADDR_Msk        (0x7fffff0UL)             /*!< ADDR (Bitfield-Mask: 0x7fffff)                        */
/* =======================================================  NCR1START  ======================================================= */
#define CACHECTRL_NCR1START_ADDR_Pos      (4UL)                     /*!< ADDR (Bit 4)                                          */
#define CACHECTRL_NCR1START_ADDR_Msk      (0x7fffff0UL)             /*!< ADDR (Bitfield-Mask: 0x7fffff)                        */
/* ========================================================  NCR1END  ======================================================== */
#define CACHECTRL_NCR1END_ADDR_Pos        (4UL)                     /*!< ADDR (Bit 4)                                          */
#define CACHECTRL_NCR1END_ADDR_Msk        (0x7fffff0UL)             /*!< ADDR (Bitfield-Mask: 0x7fffff)                        */
/* =========================================================  DMON0  ========================================================= */
#define CACHECTRL_DMON0_DACCESS_COUNT_Pos (0UL)                     /*!< DACCESS_COUNT (Bit 0)                                 */
#define CACHECTRL_DMON0_DACCESS_COUNT_Msk (0xffffffffUL)            /*!< DACCESS_COUNT (Bitfield-Mask: 0xffffffff)             */
/* =========================================================  DMON1  ========================================================= */
#define CACHECTRL_DMON1_DLOOKUP_COUNT_Pos (0UL)                     /*!< DLOOKUP_COUNT (Bit 0)                                 */
#define CACHECTRL_DMON1_DLOOKUP_COUNT_Msk (0xffffffffUL)            /*!< DLOOKUP_COUNT (Bitfield-Mask: 0xffffffff)             */
/* =========================================================  DMON2  ========================================================= */
#define CACHECTRL_DMON2_DHIT_COUNT_Pos    (0UL)                     /*!< DHIT_COUNT (Bit 0)                                    */
#define CACHECTRL_DMON2_DHIT_COUNT_Msk    (0xffffffffUL)            /*!< DHIT_COUNT (Bitfield-Mask: 0xffffffff)                */
/* =========================================================  DMON3  ========================================================= */
#define CACHECTRL_DMON3_DLINE_COUNT_Pos   (0UL)                     /*!< DLINE_COUNT (Bit 0)                                   */
#define CACHECTRL_DMON3_DLINE_COUNT_Msk   (0xffffffffUL)            /*!< DLINE_COUNT (Bitfield-Mask: 0xffffffff)               */
/* =========================================================  IMON0  ========================================================= */
#define CACHECTRL_IMON0_IACCESS_COUNT_Pos (0UL)                     /*!< IACCESS_COUNT (Bit 0)                                 */
#define CACHECTRL_IMON0_IACCESS_COUNT_Msk (0xffffffffUL)            /*!< IACCESS_COUNT (Bitfield-Mask: 0xffffffff)             */
/* =========================================================  IMON1  ========================================================= */
#define CACHECTRL_IMON1_ILOOKUP_COUNT_Pos (0UL)                     /*!< ILOOKUP_COUNT (Bit 0)                                 */
#define CACHECTRL_IMON1_ILOOKUP_COUNT_Msk (0xffffffffUL)            /*!< ILOOKUP_COUNT (Bitfield-Mask: 0xffffffff)             */
/* =========================================================  IMON2  ========================================================= */
#define CACHECTRL_IMON2_IHIT_COUNT_Pos    (0UL)                     /*!< IHIT_COUNT (Bit 0)                                    */
#define CACHECTRL_IMON2_IHIT_COUNT_Msk    (0xffffffffUL)            /*!< IHIT_COUNT (Bitfield-Mask: 0xffffffff)                */
/* =========================================================  IMON3  ========================================================= */
#define CACHECTRL_IMON3_ILINE_COUNT_Pos   (0UL)                     /*!< ILINE_COUNT (Bit 0)                                   */
#define CACHECTRL_IMON3_ILINE_COUNT_Msk   (0xffffffffUL)            /*!< ILINE_COUNT (Bitfield-Mask: 0xffffffff)               */
/* =======================================================  FLASH0CFG  ======================================================= */
#define CACHECTRL_FLASH0CFG_LPMMODE0_Pos  (12UL)                    /*!< LPMMODE0 (Bit 12)                                     */
#define CACHECTRL_FLASH0CFG_LPMMODE0_Msk  (0x3000UL)                /*!< LPMMODE0 (Bitfield-Mask: 0x03)                        */
#define CACHECTRL_FLASH0CFG_LPMRDWAIT0_Pos (8UL)                    /*!< LPMRDWAIT0 (Bit 8)                                    */
#define CACHECTRL_FLASH0CFG_LPMRDWAIT0_Msk (0xf00UL)                /*!< LPMRDWAIT0 (Bitfield-Mask: 0x0f)                      */
#define CACHECTRL_FLASH0CFG_SEDELAY0_Pos  (4UL)                     /*!< SEDELAY0 (Bit 4)                                      */
#define CACHECTRL_FLASH0CFG_SEDELAY0_Msk  (0x70UL)                  /*!< SEDELAY0 (Bitfield-Mask: 0x07)                        */
#define CACHECTRL_FLASH0CFG_RDWAIT0_Pos   (0UL)                     /*!< RDWAIT0 (Bit 0)                                       */
#define CACHECTRL_FLASH0CFG_RDWAIT0_Msk   (0xfUL)                   /*!< RDWAIT0 (Bitfield-Mask: 0x0f)                         */
/* =======================================================  FLASH1CFG  ======================================================= */
#define CACHECTRL_FLASH1CFG_LPMMODE1_Pos  (12UL)                    /*!< LPMMODE1 (Bit 12)                                     */
#define CACHECTRL_FLASH1CFG_LPMMODE1_Msk  (0x3000UL)                /*!< LPMMODE1 (Bitfield-Mask: 0x03)                        */
#define CACHECTRL_FLASH1CFG_LPMRDWAIT1_Pos (8UL)                    /*!< LPMRDWAIT1 (Bit 8)                                    */
#define CACHECTRL_FLASH1CFG_LPMRDWAIT1_Msk (0xf00UL)                /*!< LPMRDWAIT1 (Bitfield-Mask: 0x0f)                      */
#define CACHECTRL_FLASH1CFG_SEDELAY1_Pos  (4UL)                     /*!< SEDELAY1 (Bit 4)                                      */
#define CACHECTRL_FLASH1CFG_SEDELAY1_Msk  (0x70UL)                  /*!< SEDELAY1 (Bitfield-Mask: 0x07)                        */
#define CACHECTRL_FLASH1CFG_RDWAIT1_Pos   (0UL)                     /*!< RDWAIT1 (Bit 0)                                       */
#define CACHECTRL_FLASH1CFG_RDWAIT1_Msk   (0xfUL)                   /*!< RDWAIT1 (Bitfield-Mask: 0x0f)                         */
/* =======================================================  FLASH2CFG  ======================================================= */
#define CACHECTRL_FLASH2CFG_LPMMODE2_Pos  (12UL)                    /*!< LPMMODE2 (Bit 12)                                     */
#define CACHECTRL_FLASH2CFG_LPMMODE2_Msk  (0x3000UL)                /*!< LPMMODE2 (Bitfield-Mask: 0x03)                        */
#define CACHECTRL_FLASH2CFG_LPMRDWAIT2_Pos (8UL)                    /*!< LPMRDWAIT2 (Bit 8)                                    */
#define CACHECTRL_FLASH2CFG_LPMRDWAIT2_Msk (0xf00UL)                /*!< LPMRDWAIT2 (Bitfield-Mask: 0x0f)                      */
#define CACHECTRL_FLASH2CFG_SEDELAY2_Pos  (4UL)                     /*!< SEDELAY2 (Bit 4)                                      */
#define CACHECTRL_FLASH2CFG_SEDELAY2_Msk  (0x70UL)                  /*!< SEDELAY2 (Bitfield-Mask: 0x07)                        */
#define CACHECTRL_FLASH2CFG_RDWAIT2_Pos   (0UL)                     /*!< RDWAIT2 (Bit 0)                                       */
#define CACHECTRL_FLASH2CFG_RDWAIT2_Msk   (0xfUL)                   /*!< RDWAIT2 (Bitfield-Mask: 0x0f)                         */
/* =======================================================  FLASH3CFG  ======================================================= */
#define CACHECTRL_FLASH3CFG_LPMMODE3_Pos  (12UL)                    /*!< LPMMODE3 (Bit 12)                                     */
#define CACHECTRL_FLASH3CFG_LPMMODE3_Msk  (0x3000UL)                /*!< LPMMODE3 (Bitfield-Mask: 0x03)                        */
#define CACHECTRL_FLASH3CFG_LPMRDWAIT3_Pos (8UL)                    /*!< LPMRDWAIT3 (Bit 8)                                    */
#define CACHECTRL_FLASH3CFG_LPMRDWAIT3_Msk (0xf00UL)                /*!< LPMRDWAIT3 (Bitfield-Mask: 0x0f)                      */
#define CACHECTRL_FLASH3CFG_SEDELAY3_Pos  (4UL)                     /*!< SEDELAY3 (Bit 4)                                      */
#define CACHECTRL_FLASH3CFG_SEDELAY3_Msk  (0x70UL)                  /*!< SEDELAY3 (Bitfield-Mask: 0x07)                        */
#define CACHECTRL_FLASH3CFG_RDWAIT3_Pos   (0UL)                     /*!< RDWAIT3 (Bit 0)                                       */
#define CACHECTRL_FLASH3CFG_RDWAIT3_Msk   (0xfUL)                   /*!< RDWAIT3 (Bitfield-Mask: 0x0f)                         */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

