TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_PADREGK_PAD42STRNG_Msk       (0x40000UL)               /*!< PAD42STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD42INPEN_Pos       (17UL)                    /*!< PAD42INPEN (Bit 17)                                   */
#define GPIO_PADREGK_PAD42INPEN_Msk       (0x20000UL)               /*!< PAD42INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD42PULL_Pos        (16UL)                    /*!< PAD42PULL (Bit 16)                                    */
#define GPIO_PADREGK_PAD42PULL_Msk        (0x10000UL)               /*!< PAD42PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGK_PAD41PWRDN_Pos       (15UL)                    /*!< PAD41PWRDN (Bit 15)                                   */
#define GPIO_PADREGK_PAD41PWRDN_Msk       (0x8000UL)                /*!< PAD41PWRDN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD41FNCSEL_Pos      (11UL)                    /*!< PAD41FNCSEL (Bit 11)                                  */
#define GPIO_PADREGK_PAD41FNCSEL_Msk      (0x3800UL)                /*!< PAD41FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGK_PAD41STRNG_Pos       (10UL)                    /*!< PAD41STRNG (Bit 10)                                   */
#define GPIO_PADREGK_PAD41STRNG_Msk       (0x400UL)                 /*!< PAD41STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD41INPEN_Pos       (9UL)                     /*!< PAD41INPEN (Bit 9)                                    */
#define GPIO_PADREGK_PAD41INPEN_Msk       (0x200UL)                 /*!< PAD41INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD41PULL_Pos        (8UL)                     /*!< PAD41PULL (Bit 8)                                     */
#define GPIO_PADREGK_PAD41PULL_Msk        (0x100UL)                 /*!< PAD41PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGK_PAD40RSEL_Pos        (6UL)                     /*!< PAD40RSEL (Bit 6)                                     */
#define GPIO_PADREGK_PAD40RSEL_Msk        (0xc0UL)                  /*!< PAD40RSEL (Bitfield-Mask: 0x03)                       */
#define GPIO_PADREGK_PAD40FNCSEL_Pos      (3UL)                     /*!< PAD40FNCSEL (Bit 3)                                   */
#define GPIO_PADREGK_PAD40FNCSEL_Msk      (0x38UL)                  /*!< PAD40FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGK_PAD40STRNG_Pos       (2UL)                     /*!< PAD40STRNG (Bit 2)                                    */
#define GPIO_PADREGK_PAD40STRNG_Msk       (0x4UL)                   /*!< PAD40STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD40INPEN_Pos       (1UL)                     /*!< PAD40INPEN (Bit 1)                                    */
#define GPIO_PADREGK_PAD40INPEN_Msk       (0x2UL)                   /*!< PAD40INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGK_PAD40PULL_Pos        (0UL)                     /*!< PAD40PULL (Bit 0)                                     */
#define GPIO_PADREGK_PAD40PULL_Msk        (0x1UL)                   /*!< PAD40PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGL  ======================================================== */
#define GPIO_PADREGL_PAD47FNCSEL_Pos      (27UL)                    /*!< PAD47FNCSEL (Bit 27)                                  */
#define GPIO_PADREGL_PAD47FNCSEL_Msk      (0x38000000UL)            /*!< PAD47FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGL_PAD47STRNG_Pos       (26UL)                    /*!< PAD47STRNG (Bit 26)                                   */
#define GPIO_PADREGL_PAD47STRNG_Msk       (0x4000000UL)             /*!< PAD47STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD47INPEN_Pos       (25UL)                    /*!< PAD47INPEN (Bit 25)                                   */
#define GPIO_PADREGL_PAD47INPEN_Msk       (0x2000000UL)             /*!< PAD47INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD47PULL_Pos        (24UL)                    /*!< PAD47PULL (Bit 24)                                    */
#define GPIO_PADREGL_PAD47PULL_Msk        (0x1000000UL)             /*!< PAD47PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGL_PAD46FNCSEL_Pos      (19UL)                    /*!< PAD46FNCSEL (Bit 19)                                  */
#define GPIO_PADREGL_PAD46FNCSEL_Msk      (0x380000UL)              /*!< PAD46FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGL_PAD46STRNG_Pos       (18UL)                    /*!< PAD46STRNG (Bit 18)                                   */
#define GPIO_PADREGL_PAD46STRNG_Msk       (0x40000UL)               /*!< PAD46STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD46INPEN_Pos       (17UL)                    /*!< PAD46INPEN (Bit 17)                                   */
#define GPIO_PADREGL_PAD46INPEN_Msk       (0x20000UL)               /*!< PAD46INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD46PULL_Pos        (16UL)                    /*!< PAD46PULL (Bit 16)                                    */
#define GPIO_PADREGL_PAD46PULL_Msk        (0x10000UL)               /*!< PAD46PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGL_PAD45FNCSEL_Pos      (11UL)                    /*!< PAD45FNCSEL (Bit 11)                                  */
#define GPIO_PADREGL_PAD45FNCSEL_Msk      (0x3800UL)                /*!< PAD45FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGL_PAD45STRNG_Pos       (10UL)                    /*!< PAD45STRNG (Bit 10)                                   */
#define GPIO_PADREGL_PAD45STRNG_Msk       (0x400UL)                 /*!< PAD45STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD45INPEN_Pos       (9UL)                     /*!< PAD45INPEN (Bit 9)                                    */
#define GPIO_PADREGL_PAD45INPEN_Msk       (0x200UL)                 /*!< PAD45INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD45PULL_Pos        (8UL)                     /*!< PAD45PULL (Bit 8)                                     */
#define GPIO_PADREGL_PAD45PULL_Msk        (0x100UL)                 /*!< PAD45PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGL_PAD44FNCSEL_Pos      (3UL)                     /*!< PAD44FNCSEL (Bit 3)                                   */
#define GPIO_PADREGL_PAD44FNCSEL_Msk      (0x38UL)                  /*!< PAD44FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGL_PAD44STRNG_Pos       (2UL)                     /*!< PAD44STRNG (Bit 2)                                    */
#define GPIO_PADREGL_PAD44STRNG_Msk       (0x4UL)                   /*!< PAD44STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD44INPEN_Pos       (1UL)                     /*!< PAD44INPEN (Bit 1)                                    */
#define GPIO_PADREGL_PAD44INPEN_Msk       (0x2UL)                   /*!< PAD44INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGL_PAD44PULL_Pos        (0UL)                     /*!< PAD44PULL (Bit 0)                                     */
#define GPIO_PADREGL_PAD44PULL_Msk        (0x1UL)                   /*!< PAD44PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGM  ======================================================== */
#define GPIO_PADREGM_PAD51FNCSEL_Pos      (27UL)                    /*!< PAD51FNCSEL (Bit 27)                                  */
#define GPIO_PADREGM_PAD51FNCSEL_Msk      (0x38000000UL)            /*!< PAD51FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGM_PAD51STRNG_Pos       (26UL)                    /*!< PAD51STRNG (Bit 26)                                   */
#define GPIO_PADREGM_PAD51STRNG_Msk       (0x4000000UL)             /*!< PAD51STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD51INPEN_Pos       (25UL)                    /*!< PAD51INPEN (Bit 25)                                   */
#define GPIO_PADREGM_PAD51INPEN_Msk       (0x2000000UL)             /*!< PAD51INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD51PULL_Pos        (24UL)                    /*!< PAD51PULL (Bit 24)                                    */
#define GPIO_PADREGM_PAD51PULL_Msk        (0x1000000UL)             /*!< PAD51PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGM_PAD50FNCSEL_Pos      (19UL)                    /*!< PAD50FNCSEL (Bit 19)                                  */
#define GPIO_PADREGM_PAD50FNCSEL_Msk      (0x380000UL)              /*!< PAD50FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGM_PAD50STRNG_Pos       (18UL)                    /*!< PAD50STRNG (Bit 18)                                   */
#define GPIO_PADREGM_PAD50STRNG_Msk       (0x40000UL)               /*!< PAD50STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD50INPEN_Pos       (17UL)                    /*!< PAD50INPEN (Bit 17)                                   */
#define GPIO_PADREGM_PAD50INPEN_Msk       (0x20000UL)               /*!< PAD50INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD50PULL_Pos        (16UL)                    /*!< PAD50PULL (Bit 16)                                    */
#define GPIO_PADREGM_PAD50PULL_Msk        (0x10000UL)               /*!< PAD50PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGM_PAD49RSEL_Pos        (14UL)                    /*!< PAD49RSEL (Bit 14)                                    */
#define GPIO_PADREGM_PAD49RSEL_Msk        (0xc000UL)                /*!< PAD49RSEL (Bitfield-Mask: 0x03)                       */
#define GPIO_PADREGM_PAD49FNCSEL_Pos      (11UL)                    /*!< PAD49FNCSEL (Bit 11)                                  */
#define GPIO_PADREGM_PAD49FNCSEL_Msk      (0x3800UL)                /*!< PAD49FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGM_PAD49STRNG_Pos       (10UL)                    /*!< PAD49STRNG (Bit 10)                                   */
#define GPIO_PADREGM_PAD49STRNG_Msk       (0x400UL)                 /*!< PAD49STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD49INPEN_Pos       (9UL)                     /*!< PAD49INPEN (Bit 9)                                    */
#define GPIO_PADREGM_PAD49INPEN_Msk       (0x200UL)                 /*!< PAD49INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD49PULL_Pos        (8UL)                     /*!< PAD49PULL (Bit 8)                                     */
#define GPIO_PADREGM_PAD49PULL_Msk        (0x100UL)                 /*!< PAD49PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGM_PAD48RSEL_Pos        (6UL)                     /*!< PAD48RSEL (Bit 6)                                     */
#define GPIO_PADREGM_PAD48RSEL_Msk        (0xc0UL)                  /*!< PAD48RSEL (Bitfield-Mask: 0x03)                       */
#define GPIO_PADREGM_PAD48FNCSEL_Pos      (3UL)                     /*!< PAD48FNCSEL (Bit 3)                                   */
#define GPIO_PADREGM_PAD48FNCSEL_Msk      (0x38UL)                  /*!< PAD48FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGM_PAD48STRNG_Pos       (2UL)                     /*!< PAD48STRNG (Bit 2)                                    */
#define GPIO_PADREGM_PAD48STRNG_Msk       (0x4UL)                   /*!< PAD48STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD48INPEN_Pos       (1UL)                     /*!< PAD48INPEN (Bit 1)                                    */
#define GPIO_PADREGM_PAD48INPEN_Msk       (0x2UL)                   /*!< PAD48INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGM_PAD48PULL_Pos        (0UL)                     /*!< PAD48PULL (Bit 0)                                     */
#define GPIO_PADREGM_PAD48PULL_Msk        (0x1UL)                   /*!< PAD48PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGN  ======================================================== */
#define GPIO_PADREGN_PAD55FNCSEL_Pos      (27UL)                    /*!< PAD55FNCSEL (Bit 27)                                  */
#define GPIO_PADREGN_PAD55FNCSEL_Msk      (0x38000000UL)            /*!< PAD55FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGN_PAD55STRNG_Pos       (26UL)                    /*!< PAD55STRNG (Bit 26)                                   */
#define GPIO_PADREGN_PAD55STRNG_Msk       (0x4000000UL)             /*!< PAD55STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD55INPEN_Pos       (25UL)                    /*!< PAD55INPEN (Bit 25)                                   */
#define GPIO_PADREGN_PAD55INPEN_Msk       (0x2000000UL)             /*!< PAD55INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD55PULL_Pos        (24UL)                    /*!< PAD55PULL (Bit 24)                                    */
#define GPIO_PADREGN_PAD55PULL_Msk        (0x1000000UL)             /*!< PAD55PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGN_PAD54FNCSEL_Pos      (19UL)                    /*!< PAD54FNCSEL (Bit 19)                                  */
#define GPIO_PADREGN_PAD54FNCSEL_Msk      (0x380000UL)              /*!< PAD54FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGN_PAD54STRNG_Pos       (18UL)                    /*!< PAD54STRNG (Bit 18)                                   */
#define GPIO_PADREGN_PAD54STRNG_Msk       (0x40000UL)               /*!< PAD54STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD54INPEN_Pos       (17UL)                    /*!< PAD54INPEN (Bit 17)                                   */
#define GPIO_PADREGN_PAD54INPEN_Msk       (0x20000UL)               /*!< PAD54INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD54PULL_Pos        (16UL)                    /*!< PAD54PULL (Bit 16)                                    */
#define GPIO_PADREGN_PAD54PULL_Msk        (0x10000UL)               /*!< PAD54PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGN_PAD53FNCSEL_Pos      (11UL)                    /*!< PAD53FNCSEL (Bit 11)                                  */
#define GPIO_PADREGN_PAD53FNCSEL_Msk      (0x3800UL)                /*!< PAD53FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGN_PAD53STRNG_Pos       (10UL)                    /*!< PAD53STRNG (Bit 10)                                   */
#define GPIO_PADREGN_PAD53STRNG_Msk       (0x400UL)                 /*!< PAD53STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD53INPEN_Pos       (9UL)                     /*!< PAD53INPEN (Bit 9)                                    */
#define GPIO_PADREGN_PAD53INPEN_Msk       (0x200UL)                 /*!< PAD53INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD53PULL_Pos        (8UL)                     /*!< PAD53PULL (Bit 8)                                     */
#define GPIO_PADREGN_PAD53PULL_Msk        (0x100UL)                 /*!< PAD53PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGN_PAD52FNCSEL_Pos      (3UL)                     /*!< PAD52FNCSEL (Bit 3)                                   */
#define GPIO_PADREGN_PAD52FNCSEL_Msk      (0x38UL)                  /*!< PAD52FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGN_PAD52STRNG_Pos       (2UL)                     /*!< PAD52STRNG (Bit 2)                                    */
#define GPIO_PADREGN_PAD52STRNG_Msk       (0x4UL)                   /*!< PAD52STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD52INPEN_Pos       (1UL)                     /*!< PAD52INPEN (Bit 1)                                    */
#define GPIO_PADREGN_PAD52INPEN_Msk       (0x2UL)                   /*!< PAD52INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGN_PAD52PULL_Pos        (0UL)                     /*!< PAD52PULL (Bit 0)                                     */
#define GPIO_PADREGN_PAD52PULL_Msk        (0x1UL)                   /*!< PAD52PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGO  ======================================================== */
#define GPIO_PADREGO_PAD59FNCSEL_Pos      (27UL)                    /*!< PAD59FNCSEL (Bit 27)                                  */
#define GPIO_PADREGO_PAD59FNCSEL_Msk      (0x38000000UL)            /*!< PAD59FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGO_PAD59STRNG_Pos       (26UL)                    /*!< PAD59STRNG (Bit 26)                                   */
#define GPIO_PADREGO_PAD59STRNG_Msk       (0x4000000UL)             /*!< PAD59STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD59INPEN_Pos       (25UL)                    /*!< PAD59INPEN (Bit 25)                                   */
#define GPIO_PADREGO_PAD59INPEN_Msk       (0x2000000UL)             /*!< PAD59INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD59PULL_Pos        (24UL)                    /*!< PAD59PULL (Bit 24)                                    */
#define GPIO_PADREGO_PAD59PULL_Msk        (0x1000000UL)             /*!< PAD59PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGO_PAD58FNCSEL_Pos      (19UL)                    /*!< PAD58FNCSEL (Bit 19)                                  */
#define GPIO_PADREGO_PAD58FNCSEL_Msk      (0x380000UL)              /*!< PAD58FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGO_PAD58STRNG_Pos       (18UL)                    /*!< PAD58STRNG (Bit 18)                                   */
#define GPIO_PADREGO_PAD58STRNG_Msk       (0x40000UL)               /*!< PAD58STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD58INPEN_Pos       (17UL)                    /*!< PAD58INPEN (Bit 17)                                   */
#define GPIO_PADREGO_PAD58INPEN_Msk       (0x20000UL)               /*!< PAD58INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD58PULL_Pos        (16UL)                    /*!< PAD58PULL (Bit 16)                                    */
#define GPIO_PADREGO_PAD58PULL_Msk        (0x10000UL)               /*!< PAD58PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGO_PAD57FNCSEL_Pos      (11UL)                    /*!< PAD57FNCSEL (Bit 11)                                  */
#define GPIO_PADREGO_PAD57FNCSEL_Msk      (0x3800UL)                /*!< PAD57FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGO_PAD57STRNG_Pos       (10UL)                    /*!< PAD57STRNG (Bit 10)                                   */
#define GPIO_PADREGO_PAD57STRNG_Msk       (0x400UL)                 /*!< PAD57STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD57INPEN_Pos       (9UL)                     /*!< PAD57INPEN (Bit 9)                                    */
#define GPIO_PADREGO_PAD57INPEN_Msk       (0x200UL)                 /*!< PAD57INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD57PULL_Pos        (8UL)                     /*!< PAD57PULL (Bit 8)                                     */
#define GPIO_PADREGO_PAD57PULL_Msk        (0x100UL)                 /*!< PAD57PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGO_PAD56FNCSEL_Pos      (3UL)                     /*!< PAD56FNCSEL (Bit 3)                                   */
#define GPIO_PADREGO_PAD56FNCSEL_Msk      (0x38UL)                  /*!< PAD56FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGO_PAD56STRNG_Pos       (2UL)                     /*!< PAD56STRNG (Bit 2)                                    */
#define GPIO_PADREGO_PAD56STRNG_Msk       (0x4UL)                   /*!< PAD56STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD56INPEN_Pos       (1UL)                     /*!< PAD56INPEN (Bit 1)                                    */
#define GPIO_PADREGO_PAD56INPEN_Msk       (0x2UL)                   /*!< PAD56INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGO_PAD56PULL_Pos        (0UL)                     /*!< PAD56PULL (Bit 0)                                     */
#define GPIO_PADREGO_PAD56PULL_Msk        (0x1UL)                   /*!< PAD56PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGP  ======================================================== */
#define GPIO_PADREGP_PAD63FNCSEL_Pos      (27UL)                    /*!< PAD63FNCSEL (Bit 27)                                  */
#define GPIO_PADREGP_PAD63FNCSEL_Msk      (0x38000000UL)            /*!< PAD63FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGP_PAD63STRNG_Pos       (26UL)                    /*!< PAD63STRNG (Bit 26)                                   */
#define GPIO_PADREGP_PAD63STRNG_Msk       (0x4000000UL)             /*!< PAD63STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD63INPEN_Pos       (25UL)                    /*!< PAD63INPEN (Bit 25)                                   */
#define GPIO_PADREGP_PAD63INPEN_Msk       (0x2000000UL)             /*!< PAD63INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD63PULL_Pos        (24UL)                    /*!< PAD63PULL (Bit 24)                                    */
#define GPIO_PADREGP_PAD63PULL_Msk        (0x1000000UL)             /*!< PAD63PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGP_PAD62FNCSEL_Pos      (19UL)                    /*!< PAD62FNCSEL (Bit 19)                                  */
#define GPIO_PADREGP_PAD62FNCSEL_Msk      (0x380000UL)              /*!< PAD62FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGP_PAD62STRNG_Pos       (18UL)                    /*!< PAD62STRNG (Bit 18)                                   */
#define GPIO_PADREGP_PAD62STRNG_Msk       (0x40000UL)               /*!< PAD62STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD62INPEN_Pos       (17UL)                    /*!< PAD62INPEN (Bit 17)                                   */
#define GPIO_PADREGP_PAD62INPEN_Msk       (0x20000UL)               /*!< PAD62INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD62PULL_Pos        (16UL)                    /*!< PAD62PULL (Bit 16)                                    */
#define GPIO_PADREGP_PAD62PULL_Msk        (0x10000UL)               /*!< PAD62PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGP_PAD61FNCSEL_Pos      (11UL)                    /*!< PAD61FNCSEL (Bit 11)                                  */
#define GPIO_PADREGP_PAD61FNCSEL_Msk      (0x3800UL)                /*!< PAD61FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGP_PAD61STRNG_Pos       (10UL)                    /*!< PAD61STRNG (Bit 10)                                   */
#define GPIO_PADREGP_PAD61STRNG_Msk       (0x400UL)                 /*!< PAD61STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD61INPEN_Pos       (9UL)                     /*!< PAD61INPEN (Bit 9)                                    */
#define GPIO_PADREGP_PAD61INPEN_Msk       (0x200UL)                 /*!< PAD61INPEN (Bitfield-Mask: 0x01)                      */
