TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_PADREGP_PAD61PULL_Pos        (8UL)                     /*!< PAD61PULL (Bit 8)                                     */
#define GPIO_PADREGP_PAD61PULL_Msk        (0x100UL)                 /*!< PAD61PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGP_PAD60FNCSEL_Pos      (3UL)                     /*!< PAD60FNCSEL (Bit 3)                                   */
#define GPIO_PADREGP_PAD60FNCSEL_Msk      (0x38UL)                  /*!< PAD60FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGP_PAD60STRNG_Pos       (2UL)                     /*!< PAD60STRNG (Bit 2)                                    */
#define GPIO_PADREGP_PAD60STRNG_Msk       (0x4UL)                   /*!< PAD60STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD60INPEN_Pos       (1UL)                     /*!< PAD60INPEN (Bit 1)                                    */
#define GPIO_PADREGP_PAD60INPEN_Msk       (0x2UL)                   /*!< PAD60INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGP_PAD60PULL_Pos        (0UL)                     /*!< PAD60PULL (Bit 0)                                     */
#define GPIO_PADREGP_PAD60PULL_Msk        (0x1UL)                   /*!< PAD60PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGQ  ======================================================== */
#define GPIO_PADREGQ_PAD67FNCSEL_Pos      (27UL)                    /*!< PAD67FNCSEL (Bit 27)                                  */
#define GPIO_PADREGQ_PAD67FNCSEL_Msk      (0x38000000UL)            /*!< PAD67FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGQ_PAD67STRNG_Pos       (26UL)                    /*!< PAD67STRNG (Bit 26)                                   */
#define GPIO_PADREGQ_PAD67STRNG_Msk       (0x4000000UL)             /*!< PAD67STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD67INPEN_Pos       (25UL)                    /*!< PAD67INPEN (Bit 25)                                   */
#define GPIO_PADREGQ_PAD67INPEN_Msk       (0x2000000UL)             /*!< PAD67INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD67PULL_Pos        (24UL)                    /*!< PAD67PULL (Bit 24)                                    */
#define GPIO_PADREGQ_PAD67PULL_Msk        (0x1000000UL)             /*!< PAD67PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGQ_PAD66FNCSEL_Pos      (19UL)                    /*!< PAD66FNCSEL (Bit 19)                                  */
#define GPIO_PADREGQ_PAD66FNCSEL_Msk      (0x380000UL)              /*!< PAD66FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGQ_PAD66STRNG_Pos       (18UL)                    /*!< PAD66STRNG (Bit 18)                                   */
#define GPIO_PADREGQ_PAD66STRNG_Msk       (0x40000UL)               /*!< PAD66STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD66INPEN_Pos       (17UL)                    /*!< PAD66INPEN (Bit 17)                                   */
#define GPIO_PADREGQ_PAD66INPEN_Msk       (0x20000UL)               /*!< PAD66INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD66PULL_Pos        (16UL)                    /*!< PAD66PULL (Bit 16)                                    */
#define GPIO_PADREGQ_PAD66PULL_Msk        (0x10000UL)               /*!< PAD66PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGQ_PAD65FNCSEL_Pos      (11UL)                    /*!< PAD65FNCSEL (Bit 11)                                  */
#define GPIO_PADREGQ_PAD65FNCSEL_Msk      (0x3800UL)                /*!< PAD65FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGQ_PAD65STRNG_Pos       (10UL)                    /*!< PAD65STRNG (Bit 10)                                   */
#define GPIO_PADREGQ_PAD65STRNG_Msk       (0x400UL)                 /*!< PAD65STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD65INPEN_Pos       (9UL)                     /*!< PAD65INPEN (Bit 9)                                    */
#define GPIO_PADREGQ_PAD65INPEN_Msk       (0x200UL)                 /*!< PAD65INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD65PULL_Pos        (8UL)                     /*!< PAD65PULL (Bit 8)                                     */
#define GPIO_PADREGQ_PAD65PULL_Msk        (0x100UL)                 /*!< PAD65PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGQ_PAD64FNCSEL_Pos      (3UL)                     /*!< PAD64FNCSEL (Bit 3)                                   */
#define GPIO_PADREGQ_PAD64FNCSEL_Msk      (0x38UL)                  /*!< PAD64FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGQ_PAD64STRNG_Pos       (2UL)                     /*!< PAD64STRNG (Bit 2)                                    */
#define GPIO_PADREGQ_PAD64STRNG_Msk       (0x4UL)                   /*!< PAD64STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD64INPEN_Pos       (1UL)                     /*!< PAD64INPEN (Bit 1)                                    */
#define GPIO_PADREGQ_PAD64INPEN_Msk       (0x2UL)                   /*!< PAD64INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGQ_PAD64PULL_Pos        (0UL)                     /*!< PAD64PULL (Bit 0)                                     */
#define GPIO_PADREGQ_PAD64PULL_Msk        (0x1UL)                   /*!< PAD64PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGR  ======================================================== */
#define GPIO_PADREGR_PAD71FNCSEL_Pos      (27UL)                    /*!< PAD71FNCSEL (Bit 27)                                  */
#define GPIO_PADREGR_PAD71FNCSEL_Msk      (0x38000000UL)            /*!< PAD71FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGR_PAD71STRNG_Pos       (26UL)                    /*!< PAD71STRNG (Bit 26)                                   */
#define GPIO_PADREGR_PAD71STRNG_Msk       (0x4000000UL)             /*!< PAD71STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD71INPEN_Pos       (25UL)                    /*!< PAD71INPEN (Bit 25)                                   */
#define GPIO_PADREGR_PAD71INPEN_Msk       (0x2000000UL)             /*!< PAD71INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD71PULL_Pos        (24UL)                    /*!< PAD71PULL (Bit 24)                                    */
#define GPIO_PADREGR_PAD71PULL_Msk        (0x1000000UL)             /*!< PAD71PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGR_PAD70FNCSEL_Pos      (19UL)                    /*!< PAD70FNCSEL (Bit 19)                                  */
#define GPIO_PADREGR_PAD70FNCSEL_Msk      (0x380000UL)              /*!< PAD70FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGR_PAD70STRNG_Pos       (18UL)                    /*!< PAD70STRNG (Bit 18)                                   */
#define GPIO_PADREGR_PAD70STRNG_Msk       (0x40000UL)               /*!< PAD70STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD70INPEN_Pos       (17UL)                    /*!< PAD70INPEN (Bit 17)                                   */
#define GPIO_PADREGR_PAD70INPEN_Msk       (0x20000UL)               /*!< PAD70INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD70PULL_Pos        (16UL)                    /*!< PAD70PULL (Bit 16)                                    */
#define GPIO_PADREGR_PAD70PULL_Msk        (0x10000UL)               /*!< PAD70PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGR_PAD69FNCSEL_Pos      (11UL)                    /*!< PAD69FNCSEL (Bit 11)                                  */
#define GPIO_PADREGR_PAD69FNCSEL_Msk      (0x3800UL)                /*!< PAD69FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGR_PAD69STRNG_Pos       (10UL)                    /*!< PAD69STRNG (Bit 10)                                   */
#define GPIO_PADREGR_PAD69STRNG_Msk       (0x400UL)                 /*!< PAD69STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD69INPEN_Pos       (9UL)                     /*!< PAD69INPEN (Bit 9)                                    */
#define GPIO_PADREGR_PAD69INPEN_Msk       (0x200UL)                 /*!< PAD69INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD69PULL_Pos        (8UL)                     /*!< PAD69PULL (Bit 8)                                     */
#define GPIO_PADREGR_PAD69PULL_Msk        (0x100UL)                 /*!< PAD69PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGR_PAD68FNCSEL_Pos      (3UL)                     /*!< PAD68FNCSEL (Bit 3)                                   */
#define GPIO_PADREGR_PAD68FNCSEL_Msk      (0x38UL)                  /*!< PAD68FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGR_PAD68STRNG_Pos       (2UL)                     /*!< PAD68STRNG (Bit 2)                                    */
#define GPIO_PADREGR_PAD68STRNG_Msk       (0x4UL)                   /*!< PAD68STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD68INPEN_Pos       (1UL)                     /*!< PAD68INPEN (Bit 1)                                    */
#define GPIO_PADREGR_PAD68INPEN_Msk       (0x2UL)                   /*!< PAD68INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGR_PAD68PULL_Pos        (0UL)                     /*!< PAD68PULL (Bit 0)                                     */
#define GPIO_PADREGR_PAD68PULL_Msk        (0x1UL)                   /*!< PAD68PULL (Bitfield-Mask: 0x01)                       */
/* ========================================================  PADREGS  ======================================================== */
#define GPIO_PADREGS_PAD73FNCSEL_Pos      (11UL)                    /*!< PAD73FNCSEL (Bit 11)                                  */
#define GPIO_PADREGS_PAD73FNCSEL_Msk      (0x3800UL)                /*!< PAD73FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGS_PAD73STRNG_Pos       (10UL)                    /*!< PAD73STRNG (Bit 10)                                   */
#define GPIO_PADREGS_PAD73STRNG_Msk       (0x400UL)                 /*!< PAD73STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGS_PAD73INPEN_Pos       (9UL)                     /*!< PAD73INPEN (Bit 9)                                    */
#define GPIO_PADREGS_PAD73INPEN_Msk       (0x200UL)                 /*!< PAD73INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGS_PAD73PULL_Pos        (8UL)                     /*!< PAD73PULL (Bit 8)                                     */
#define GPIO_PADREGS_PAD73PULL_Msk        (0x100UL)                 /*!< PAD73PULL (Bitfield-Mask: 0x01)                       */
#define GPIO_PADREGS_PAD72FNCSEL_Pos      (3UL)                     /*!< PAD72FNCSEL (Bit 3)                                   */
#define GPIO_PADREGS_PAD72FNCSEL_Msk      (0x38UL)                  /*!< PAD72FNCSEL (Bitfield-Mask: 0x07)                     */
#define GPIO_PADREGS_PAD72STRNG_Pos       (2UL)                     /*!< PAD72STRNG (Bit 2)                                    */
#define GPIO_PADREGS_PAD72STRNG_Msk       (0x4UL)                   /*!< PAD72STRNG (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGS_PAD72INPEN_Pos       (1UL)                     /*!< PAD72INPEN (Bit 1)                                    */
#define GPIO_PADREGS_PAD72INPEN_Msk       (0x2UL)                   /*!< PAD72INPEN (Bitfield-Mask: 0x01)                      */
#define GPIO_PADREGS_PAD72PULL_Pos        (0UL)                     /*!< PAD72PULL (Bit 0)                                     */
#define GPIO_PADREGS_PAD72PULL_Msk        (0x1UL)                   /*!< PAD72PULL (Bitfield-Mask: 0x01)                       */
/* =========================================================  CFGA  ========================================================== */
#define GPIO_CFGA_GPIO7INTD_Pos           (31UL)                    /*!< GPIO7INTD (Bit 31)                                    */
#define GPIO_CFGA_GPIO7INTD_Msk           (0x80000000UL)            /*!< GPIO7INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO7OUTCFG_Pos         (29UL)                    /*!< GPIO7OUTCFG (Bit 29)                                  */
#define GPIO_CFGA_GPIO7OUTCFG_Msk         (0x60000000UL)            /*!< GPIO7OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO7INCFG_Pos          (28UL)                    /*!< GPIO7INCFG (Bit 28)                                   */
#define GPIO_CFGA_GPIO7INCFG_Msk          (0x10000000UL)            /*!< GPIO7INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO6INTD_Pos           (27UL)                    /*!< GPIO6INTD (Bit 27)                                    */
#define GPIO_CFGA_GPIO6INTD_Msk           (0x8000000UL)             /*!< GPIO6INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO6OUTCFG_Pos         (25UL)                    /*!< GPIO6OUTCFG (Bit 25)                                  */
#define GPIO_CFGA_GPIO6OUTCFG_Msk         (0x6000000UL)             /*!< GPIO6OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO6INCFG_Pos          (24UL)                    /*!< GPIO6INCFG (Bit 24)                                   */
#define GPIO_CFGA_GPIO6INCFG_Msk          (0x1000000UL)             /*!< GPIO6INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO5INTD_Pos           (23UL)                    /*!< GPIO5INTD (Bit 23)                                    */
#define GPIO_CFGA_GPIO5INTD_Msk           (0x800000UL)              /*!< GPIO5INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO5OUTCFG_Pos         (21UL)                    /*!< GPIO5OUTCFG (Bit 21)                                  */
#define GPIO_CFGA_GPIO5OUTCFG_Msk         (0x600000UL)              /*!< GPIO5OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO5INCFG_Pos          (20UL)                    /*!< GPIO5INCFG (Bit 20)                                   */
#define GPIO_CFGA_GPIO5INCFG_Msk          (0x100000UL)              /*!< GPIO5INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO4INTD_Pos           (19UL)                    /*!< GPIO4INTD (Bit 19)                                    */
#define GPIO_CFGA_GPIO4INTD_Msk           (0x80000UL)               /*!< GPIO4INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO4OUTCFG_Pos         (17UL)                    /*!< GPIO4OUTCFG (Bit 17)                                  */
#define GPIO_CFGA_GPIO4OUTCFG_Msk         (0x60000UL)               /*!< GPIO4OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO4INCFG_Pos          (16UL)                    /*!< GPIO4INCFG (Bit 16)                                   */
#define GPIO_CFGA_GPIO4INCFG_Msk          (0x10000UL)               /*!< GPIO4INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO3INTD_Pos           (15UL)                    /*!< GPIO3INTD (Bit 15)                                    */
#define GPIO_CFGA_GPIO3INTD_Msk           (0x8000UL)                /*!< GPIO3INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO3OUTCFG_Pos         (13UL)                    /*!< GPIO3OUTCFG (Bit 13)                                  */
#define GPIO_CFGA_GPIO3OUTCFG_Msk         (0x6000UL)                /*!< GPIO3OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO3INCFG_Pos          (12UL)                    /*!< GPIO3INCFG (Bit 12)                                   */
#define GPIO_CFGA_GPIO3INCFG_Msk          (0x1000UL)                /*!< GPIO3INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO2INTD_Pos           (11UL)                    /*!< GPIO2INTD (Bit 11)                                    */
#define GPIO_CFGA_GPIO2INTD_Msk           (0x800UL)                 /*!< GPIO2INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO2OUTCFG_Pos         (9UL)                     /*!< GPIO2OUTCFG (Bit 9)                                   */
#define GPIO_CFGA_GPIO2OUTCFG_Msk         (0x600UL)                 /*!< GPIO2OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO2INCFG_Pos          (8UL)                     /*!< GPIO2INCFG (Bit 8)                                    */
#define GPIO_CFGA_GPIO2INCFG_Msk          (0x100UL)                 /*!< GPIO2INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO1INTD_Pos           (7UL)                     /*!< GPIO1INTD (Bit 7)                                     */
#define GPIO_CFGA_GPIO1INTD_Msk           (0x80UL)                  /*!< GPIO1INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO1OUTCFG_Pos         (5UL)                     /*!< GPIO1OUTCFG (Bit 5)                                   */
#define GPIO_CFGA_GPIO1OUTCFG_Msk         (0x60UL)                  /*!< GPIO1OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO1INCFG_Pos          (4UL)                     /*!< GPIO1INCFG (Bit 4)                                    */
#define GPIO_CFGA_GPIO1INCFG_Msk          (0x10UL)                  /*!< GPIO1INCFG (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGA_GPIO0INTD_Pos           (3UL)                     /*!< GPIO0INTD (Bit 3)                                     */
#define GPIO_CFGA_GPIO0INTD_Msk           (0x8UL)                   /*!< GPIO0INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGA_GPIO0OUTCFG_Pos         (1UL)                     /*!< GPIO0OUTCFG (Bit 1)                                   */
#define GPIO_CFGA_GPIO0OUTCFG_Msk         (0x6UL)                   /*!< GPIO0OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGA_GPIO0INCFG_Pos          (0UL)                     /*!< GPIO0INCFG (Bit 0)                                    */
#define GPIO_CFGA_GPIO0INCFG_Msk          (0x1UL)                   /*!< GPIO0INCFG (Bitfield-Mask: 0x01)                      */
/* =========================================================  CFGB  ========================================================== */
#define GPIO_CFGB_GPIO15INTD_Pos          (31UL)                    /*!< GPIO15INTD (Bit 31)                                   */
#define GPIO_CFGB_GPIO15INTD_Msk          (0x80000000UL)            /*!< GPIO15INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO15OUTCFG_Pos        (29UL)                    /*!< GPIO15OUTCFG (Bit 29)                                 */
#define GPIO_CFGB_GPIO15OUTCFG_Msk        (0x60000000UL)            /*!< GPIO15OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO15INCFG_Pos         (28UL)                    /*!< GPIO15INCFG (Bit 28)                                  */
#define GPIO_CFGB_GPIO15INCFG_Msk         (0x10000000UL)            /*!< GPIO15INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO14INTD_Pos          (27UL)                    /*!< GPIO14INTD (Bit 27)                                   */
#define GPIO_CFGB_GPIO14INTD_Msk          (0x8000000UL)             /*!< GPIO14INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO14OUTCFG_Pos        (25UL)                    /*!< GPIO14OUTCFG (Bit 25)                                 */
#define GPIO_CFGB_GPIO14OUTCFG_Msk        (0x6000000UL)             /*!< GPIO14OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO14INCFG_Pos         (24UL)                    /*!< GPIO14INCFG (Bit 24)                                  */
#define GPIO_CFGB_GPIO14INCFG_Msk         (0x1000000UL)             /*!< GPIO14INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO13INTD_Pos          (23UL)                    /*!< GPIO13INTD (Bit 23)                                   */
#define GPIO_CFGB_GPIO13INTD_Msk          (0x800000UL)              /*!< GPIO13INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO13OUTCFG_Pos        (21UL)                    /*!< GPIO13OUTCFG (Bit 21)                                 */
#define GPIO_CFGB_GPIO13OUTCFG_Msk        (0x600000UL)              /*!< GPIO13OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO13INCFG_Pos         (20UL)                    /*!< GPIO13INCFG (Bit 20)                                  */
#define GPIO_CFGB_GPIO13INCFG_Msk         (0x100000UL)              /*!< GPIO13INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO12INTD_Pos          (19UL)                    /*!< GPIO12INTD (Bit 19)                                   */
#define GPIO_CFGB_GPIO12INTD_Msk          (0x80000UL)               /*!< GPIO12INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO12OUTCFG_Pos        (17UL)                    /*!< GPIO12OUTCFG (Bit 17)                                 */
#define GPIO_CFGB_GPIO12OUTCFG_Msk        (0x60000UL)               /*!< GPIO12OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO12INCFG_Pos         (16UL)                    /*!< GPIO12INCFG (Bit 16)                                  */
#define GPIO_CFGB_GPIO12INCFG_Msk         (0x10000UL)               /*!< GPIO12INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO11INTD_Pos          (15UL)                    /*!< GPIO11INTD (Bit 15)                                   */
#define GPIO_CFGB_GPIO11INTD_Msk          (0x8000UL)                /*!< GPIO11INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO11OUTCFG_Pos        (13UL)                    /*!< GPIO11OUTCFG (Bit 13)                                 */
#define GPIO_CFGB_GPIO11OUTCFG_Msk        (0x6000UL)                /*!< GPIO11OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO11INCFG_Pos         (12UL)                    /*!< GPIO11INCFG (Bit 12)                                  */
#define GPIO_CFGB_GPIO11INCFG_Msk         (0x1000UL)                /*!< GPIO11INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO10INTD_Pos          (11UL)                    /*!< GPIO10INTD (Bit 11)                                   */
#define GPIO_CFGB_GPIO10INTD_Msk          (0x800UL)                 /*!< GPIO10INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGB_GPIO10OUTCFG_Pos        (9UL)                     /*!< GPIO10OUTCFG (Bit 9)                                  */
#define GPIO_CFGB_GPIO10OUTCFG_Msk        (0x600UL)                 /*!< GPIO10OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGB_GPIO10INCFG_Pos         (8UL)                     /*!< GPIO10INCFG (Bit 8)                                   */
#define GPIO_CFGB_GPIO10INCFG_Msk         (0x100UL)                 /*!< GPIO10INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGB_GPIO9INTD_Pos           (7UL)                     /*!< GPIO9INTD (Bit 7)                                     */
#define GPIO_CFGB_GPIO9INTD_Msk           (0x80UL)                  /*!< GPIO9INTD (Bitfield-Mask: 0x01)                       */
#define GPIO_CFGB_GPIO9OUTCFG_Pos         (5UL)                     /*!< GPIO9OUTCFG (Bit 5)                                   */
#define GPIO_CFGB_GPIO9OUTCFG_Msk         (0x60UL)                  /*!< GPIO9OUTCFG (Bitfield-Mask: 0x03)                     */
#define GPIO_CFGB_GPIO9INCFG_Pos          (4UL)                     /*!< GPIO9INCFG (Bit 4)                                    */
