TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_CFGF_GPIO43INCFG_Msk         (0x1000UL)                /*!< GPIO43INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGF_GPIO42INTD_Pos          (11UL)                    /*!< GPIO42INTD (Bit 11)                                   */
#define GPIO_CFGF_GPIO42INTD_Msk          (0x800UL)                 /*!< GPIO42INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGF_GPIO42OUTCFG_Pos        (9UL)                     /*!< GPIO42OUTCFG (Bit 9)                                  */
#define GPIO_CFGF_GPIO42OUTCFG_Msk        (0x600UL)                 /*!< GPIO42OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGF_GPIO42INCFG_Pos         (8UL)                     /*!< GPIO42INCFG (Bit 8)                                   */
#define GPIO_CFGF_GPIO42INCFG_Msk         (0x100UL)                 /*!< GPIO42INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGF_GPIO41INTD_Pos          (7UL)                     /*!< GPIO41INTD (Bit 7)                                    */
#define GPIO_CFGF_GPIO41INTD_Msk          (0x80UL)                  /*!< GPIO41INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGF_GPIO41OUTCFG_Pos        (5UL)                     /*!< GPIO41OUTCFG (Bit 5)                                  */
#define GPIO_CFGF_GPIO41OUTCFG_Msk        (0x60UL)                  /*!< GPIO41OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGF_GPIO41INCFG_Pos         (4UL)                     /*!< GPIO41INCFG (Bit 4)                                   */
#define GPIO_CFGF_GPIO41INCFG_Msk         (0x10UL)                  /*!< GPIO41INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGF_GPIO40INTD_Pos          (3UL)                     /*!< GPIO40INTD (Bit 3)                                    */
#define GPIO_CFGF_GPIO40INTD_Msk          (0x8UL)                   /*!< GPIO40INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGF_GPIO40OUTCFG_Pos        (1UL)                     /*!< GPIO40OUTCFG (Bit 1)                                  */
#define GPIO_CFGF_GPIO40OUTCFG_Msk        (0x6UL)                   /*!< GPIO40OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGF_GPIO40INCFG_Pos         (0UL)                     /*!< GPIO40INCFG (Bit 0)                                   */
#define GPIO_CFGF_GPIO40INCFG_Msk         (0x1UL)                   /*!< GPIO40INCFG (Bitfield-Mask: 0x01)                     */
/* =========================================================  CFGG  ========================================================== */
#define GPIO_CFGG_GPIO55INTD_Pos          (31UL)                    /*!< GPIO55INTD (Bit 31)                                   */
#define GPIO_CFGG_GPIO55INTD_Msk          (0x80000000UL)            /*!< GPIO55INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO55OUTCFG_Pos        (29UL)                    /*!< GPIO55OUTCFG (Bit 29)                                 */
#define GPIO_CFGG_GPIO55OUTCFG_Msk        (0x60000000UL)            /*!< GPIO55OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO55INCFG_Pos         (28UL)                    /*!< GPIO55INCFG (Bit 28)                                  */
#define GPIO_CFGG_GPIO55INCFG_Msk         (0x10000000UL)            /*!< GPIO55INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO54INTD_Pos          (27UL)                    /*!< GPIO54INTD (Bit 27)                                   */
#define GPIO_CFGG_GPIO54INTD_Msk          (0x8000000UL)             /*!< GPIO54INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO54OUTCFG_Pos        (25UL)                    /*!< GPIO54OUTCFG (Bit 25)                                 */
#define GPIO_CFGG_GPIO54OUTCFG_Msk        (0x6000000UL)             /*!< GPIO54OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO54INCFG_Pos         (24UL)                    /*!< GPIO54INCFG (Bit 24)                                  */
#define GPIO_CFGG_GPIO54INCFG_Msk         (0x1000000UL)             /*!< GPIO54INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO53INTD_Pos          (23UL)                    /*!< GPIO53INTD (Bit 23)                                   */
#define GPIO_CFGG_GPIO53INTD_Msk          (0x800000UL)              /*!< GPIO53INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO53OUTCFG_Pos        (21UL)                    /*!< GPIO53OUTCFG (Bit 21)                                 */
#define GPIO_CFGG_GPIO53OUTCFG_Msk        (0x600000UL)              /*!< GPIO53OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO53INCFG_Pos         (20UL)                    /*!< GPIO53INCFG (Bit 20)                                  */
#define GPIO_CFGG_GPIO53INCFG_Msk         (0x100000UL)              /*!< GPIO53INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO52INTD_Pos          (19UL)                    /*!< GPIO52INTD (Bit 19)                                   */
#define GPIO_CFGG_GPIO52INTD_Msk          (0x80000UL)               /*!< GPIO52INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO52OUTCFG_Pos        (17UL)                    /*!< GPIO52OUTCFG (Bit 17)                                 */
#define GPIO_CFGG_GPIO52OUTCFG_Msk        (0x60000UL)               /*!< GPIO52OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO52INCFG_Pos         (16UL)                    /*!< GPIO52INCFG (Bit 16)                                  */
#define GPIO_CFGG_GPIO52INCFG_Msk         (0x10000UL)               /*!< GPIO52INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO51INTD_Pos          (15UL)                    /*!< GPIO51INTD (Bit 15)                                   */
#define GPIO_CFGG_GPIO51INTD_Msk          (0x8000UL)                /*!< GPIO51INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO51OUTCFG_Pos        (13UL)                    /*!< GPIO51OUTCFG (Bit 13)                                 */
#define GPIO_CFGG_GPIO51OUTCFG_Msk        (0x6000UL)                /*!< GPIO51OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO51INCFG_Pos         (12UL)                    /*!< GPIO51INCFG (Bit 12)                                  */
#define GPIO_CFGG_GPIO51INCFG_Msk         (0x1000UL)                /*!< GPIO51INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO50INTD_Pos          (11UL)                    /*!< GPIO50INTD (Bit 11)                                   */
#define GPIO_CFGG_GPIO50INTD_Msk          (0x800UL)                 /*!< GPIO50INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO50OUTCFG_Pos        (9UL)                     /*!< GPIO50OUTCFG (Bit 9)                                  */
#define GPIO_CFGG_GPIO50OUTCFG_Msk        (0x600UL)                 /*!< GPIO50OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO50INCFG_Pos         (8UL)                     /*!< GPIO50INCFG (Bit 8)                                   */
#define GPIO_CFGG_GPIO50INCFG_Msk         (0x100UL)                 /*!< GPIO50INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO49INTD_Pos          (7UL)                     /*!< GPIO49INTD (Bit 7)                                    */
#define GPIO_CFGG_GPIO49INTD_Msk          (0x80UL)                  /*!< GPIO49INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO49OUTCFG_Pos        (5UL)                     /*!< GPIO49OUTCFG (Bit 5)                                  */
#define GPIO_CFGG_GPIO49OUTCFG_Msk        (0x60UL)                  /*!< GPIO49OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO49INCFG_Pos         (4UL)                     /*!< GPIO49INCFG (Bit 4)                                   */
#define GPIO_CFGG_GPIO49INCFG_Msk         (0x10UL)                  /*!< GPIO49INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGG_GPIO48INTD_Pos          (3UL)                     /*!< GPIO48INTD (Bit 3)                                    */
#define GPIO_CFGG_GPIO48INTD_Msk          (0x8UL)                   /*!< GPIO48INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGG_GPIO48OUTCFG_Pos        (1UL)                     /*!< GPIO48OUTCFG (Bit 1)                                  */
#define GPIO_CFGG_GPIO48OUTCFG_Msk        (0x6UL)                   /*!< GPIO48OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGG_GPIO48INCFG_Pos         (0UL)                     /*!< GPIO48INCFG (Bit 0)                                   */
#define GPIO_CFGG_GPIO48INCFG_Msk         (0x1UL)                   /*!< GPIO48INCFG (Bitfield-Mask: 0x01)                     */
/* =========================================================  CFGH  ========================================================== */
#define GPIO_CFGH_GPIO63INTD_Pos          (31UL)                    /*!< GPIO63INTD (Bit 31)                                   */
#define GPIO_CFGH_GPIO63INTD_Msk          (0x80000000UL)            /*!< GPIO63INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO63OUTCFG_Pos        (29UL)                    /*!< GPIO63OUTCFG (Bit 29)                                 */
#define GPIO_CFGH_GPIO63OUTCFG_Msk        (0x60000000UL)            /*!< GPIO63OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO63INCFG_Pos         (28UL)                    /*!< GPIO63INCFG (Bit 28)                                  */
#define GPIO_CFGH_GPIO63INCFG_Msk         (0x10000000UL)            /*!< GPIO63INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO62INTD_Pos          (27UL)                    /*!< GPIO62INTD (Bit 27)                                   */
#define GPIO_CFGH_GPIO62INTD_Msk          (0x8000000UL)             /*!< GPIO62INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO62OUTCFG_Pos        (25UL)                    /*!< GPIO62OUTCFG (Bit 25)                                 */
#define GPIO_CFGH_GPIO62OUTCFG_Msk        (0x6000000UL)             /*!< GPIO62OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO62INCFG_Pos         (24UL)                    /*!< GPIO62INCFG (Bit 24)                                  */
#define GPIO_CFGH_GPIO62INCFG_Msk         (0x1000000UL)             /*!< GPIO62INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO61INTD_Pos          (23UL)                    /*!< GPIO61INTD (Bit 23)                                   */
#define GPIO_CFGH_GPIO61INTD_Msk          (0x800000UL)              /*!< GPIO61INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO61OUTCFG_Pos        (21UL)                    /*!< GPIO61OUTCFG (Bit 21)                                 */
#define GPIO_CFGH_GPIO61OUTCFG_Msk        (0x600000UL)              /*!< GPIO61OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO61INCFG_Pos         (20UL)                    /*!< GPIO61INCFG (Bit 20)                                  */
#define GPIO_CFGH_GPIO61INCFG_Msk         (0x100000UL)              /*!< GPIO61INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO60INTD_Pos          (19UL)                    /*!< GPIO60INTD (Bit 19)                                   */
#define GPIO_CFGH_GPIO60INTD_Msk          (0x80000UL)               /*!< GPIO60INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO60OUTCFG_Pos        (17UL)                    /*!< GPIO60OUTCFG (Bit 17)                                 */
#define GPIO_CFGH_GPIO60OUTCFG_Msk        (0x60000UL)               /*!< GPIO60OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO60INCFG_Pos         (16UL)                    /*!< GPIO60INCFG (Bit 16)                                  */
#define GPIO_CFGH_GPIO60INCFG_Msk         (0x10000UL)               /*!< GPIO60INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO59INTD_Pos          (15UL)                    /*!< GPIO59INTD (Bit 15)                                   */
#define GPIO_CFGH_GPIO59INTD_Msk          (0x8000UL)                /*!< GPIO59INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO59OUTCFG_Pos        (13UL)                    /*!< GPIO59OUTCFG (Bit 13)                                 */
#define GPIO_CFGH_GPIO59OUTCFG_Msk        (0x6000UL)                /*!< GPIO59OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO59INCFG_Pos         (12UL)                    /*!< GPIO59INCFG (Bit 12)                                  */
#define GPIO_CFGH_GPIO59INCFG_Msk         (0x1000UL)                /*!< GPIO59INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO58INTD_Pos          (11UL)                    /*!< GPIO58INTD (Bit 11)                                   */
#define GPIO_CFGH_GPIO58INTD_Msk          (0x800UL)                 /*!< GPIO58INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO58OUTCFG_Pos        (9UL)                     /*!< GPIO58OUTCFG (Bit 9)                                  */
#define GPIO_CFGH_GPIO58OUTCFG_Msk        (0x600UL)                 /*!< GPIO58OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO58INCFG_Pos         (8UL)                     /*!< GPIO58INCFG (Bit 8)                                   */
#define GPIO_CFGH_GPIO58INCFG_Msk         (0x100UL)                 /*!< GPIO58INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO57INTD_Pos          (7UL)                     /*!< GPIO57INTD (Bit 7)                                    */
#define GPIO_CFGH_GPIO57INTD_Msk          (0x80UL)                  /*!< GPIO57INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO57OUTCFG_Pos        (5UL)                     /*!< GPIO57OUTCFG (Bit 5)                                  */
#define GPIO_CFGH_GPIO57OUTCFG_Msk        (0x60UL)                  /*!< GPIO57OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO57INCFG_Pos         (4UL)                     /*!< GPIO57INCFG (Bit 4)                                   */
#define GPIO_CFGH_GPIO57INCFG_Msk         (0x10UL)                  /*!< GPIO57INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGH_GPIO56INTD_Pos          (3UL)                     /*!< GPIO56INTD (Bit 3)                                    */
#define GPIO_CFGH_GPIO56INTD_Msk          (0x8UL)                   /*!< GPIO56INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGH_GPIO56OUTCFG_Pos        (1UL)                     /*!< GPIO56OUTCFG (Bit 1)                                  */
#define GPIO_CFGH_GPIO56OUTCFG_Msk        (0x6UL)                   /*!< GPIO56OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGH_GPIO56INCFG_Pos         (0UL)                     /*!< GPIO56INCFG (Bit 0)                                   */
#define GPIO_CFGH_GPIO56INCFG_Msk         (0x1UL)                   /*!< GPIO56INCFG (Bitfield-Mask: 0x01)                     */
/* =========================================================  CFGI  ========================================================== */
#define GPIO_CFGI_GPIO71INTD_Pos          (31UL)                    /*!< GPIO71INTD (Bit 31)                                   */
#define GPIO_CFGI_GPIO71INTD_Msk          (0x80000000UL)            /*!< GPIO71INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO71OUTCFG_Pos        (29UL)                    /*!< GPIO71OUTCFG (Bit 29)                                 */
#define GPIO_CFGI_GPIO71OUTCFG_Msk        (0x60000000UL)            /*!< GPIO71OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO71INCFG_Pos         (28UL)                    /*!< GPIO71INCFG (Bit 28)                                  */
#define GPIO_CFGI_GPIO71INCFG_Msk         (0x10000000UL)            /*!< GPIO71INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO70INTD_Pos          (27UL)                    /*!< GPIO70INTD (Bit 27)                                   */
#define GPIO_CFGI_GPIO70INTD_Msk          (0x8000000UL)             /*!< GPIO70INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO70OUTCFG_Pos        (25UL)                    /*!< GPIO70OUTCFG (Bit 25)                                 */
#define GPIO_CFGI_GPIO70OUTCFG_Msk        (0x6000000UL)             /*!< GPIO70OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO70INCFG_Pos         (24UL)                    /*!< GPIO70INCFG (Bit 24)                                  */
#define GPIO_CFGI_GPIO70INCFG_Msk         (0x1000000UL)             /*!< GPIO70INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO69INTD_Pos          (23UL)                    /*!< GPIO69INTD (Bit 23)                                   */
#define GPIO_CFGI_GPIO69INTD_Msk          (0x800000UL)              /*!< GPIO69INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO69OUTCFG_Pos        (21UL)                    /*!< GPIO69OUTCFG (Bit 21)                                 */
#define GPIO_CFGI_GPIO69OUTCFG_Msk        (0x600000UL)              /*!< GPIO69OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO69INCFG_Pos         (20UL)                    /*!< GPIO69INCFG (Bit 20)                                  */
#define GPIO_CFGI_GPIO69INCFG_Msk         (0x100000UL)              /*!< GPIO69INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO68INTD_Pos          (19UL)                    /*!< GPIO68INTD (Bit 19)                                   */
#define GPIO_CFGI_GPIO68INTD_Msk          (0x80000UL)               /*!< GPIO68INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO68OUTCFG_Pos        (17UL)                    /*!< GPIO68OUTCFG (Bit 17)                                 */
#define GPIO_CFGI_GPIO68OUTCFG_Msk        (0x60000UL)               /*!< GPIO68OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO68INCFG_Pos         (16UL)                    /*!< GPIO68INCFG (Bit 16)                                  */
#define GPIO_CFGI_GPIO68INCFG_Msk         (0x10000UL)               /*!< GPIO68INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO67INTD_Pos          (15UL)                    /*!< GPIO67INTD (Bit 15)                                   */
#define GPIO_CFGI_GPIO67INTD_Msk          (0x8000UL)                /*!< GPIO67INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO67OUTCFG_Pos        (13UL)                    /*!< GPIO67OUTCFG (Bit 13)                                 */
#define GPIO_CFGI_GPIO67OUTCFG_Msk        (0x6000UL)                /*!< GPIO67OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO67INCFG_Pos         (12UL)                    /*!< GPIO67INCFG (Bit 12)                                  */
#define GPIO_CFGI_GPIO67INCFG_Msk         (0x1000UL)                /*!< GPIO67INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO66INTD_Pos          (11UL)                    /*!< GPIO66INTD (Bit 11)                                   */
#define GPIO_CFGI_GPIO66INTD_Msk          (0x800UL)                 /*!< GPIO66INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO66OUTCFG_Pos        (9UL)                     /*!< GPIO66OUTCFG (Bit 9)                                  */
#define GPIO_CFGI_GPIO66OUTCFG_Msk        (0x600UL)                 /*!< GPIO66OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO66INCFG_Pos         (8UL)                     /*!< GPIO66INCFG (Bit 8)                                   */
#define GPIO_CFGI_GPIO66INCFG_Msk         (0x100UL)                 /*!< GPIO66INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO65INTD_Pos          (7UL)                     /*!< GPIO65INTD (Bit 7)                                    */
#define GPIO_CFGI_GPIO65INTD_Msk          (0x80UL)                  /*!< GPIO65INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO65OUTCFG_Pos        (5UL)                     /*!< GPIO65OUTCFG (Bit 5)                                  */
#define GPIO_CFGI_GPIO65OUTCFG_Msk        (0x60UL)                  /*!< GPIO65OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO65INCFG_Pos         (4UL)                     /*!< GPIO65INCFG (Bit 4)                                   */
#define GPIO_CFGI_GPIO65INCFG_Msk         (0x10UL)                  /*!< GPIO65INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGI_GPIO64INTD_Pos          (3UL)                     /*!< GPIO64INTD (Bit 3)                                    */
#define GPIO_CFGI_GPIO64INTD_Msk          (0x8UL)                   /*!< GPIO64INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGI_GPIO64OUTCFG_Pos        (1UL)                     /*!< GPIO64OUTCFG (Bit 1)                                  */
#define GPIO_CFGI_GPIO64OUTCFG_Msk        (0x6UL)                   /*!< GPIO64OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGI_GPIO64INCFG_Pos         (0UL)                     /*!< GPIO64INCFG (Bit 0)                                   */
#define GPIO_CFGI_GPIO64INCFG_Msk         (0x1UL)                   /*!< GPIO64INCFG (Bitfield-Mask: 0x01)                     */
/* =========================================================  CFGJ  ========================================================== */
#define GPIO_CFGJ_GPIO73INTD_Pos          (7UL)                     /*!< GPIO73INTD (Bit 7)                                    */
#define GPIO_CFGJ_GPIO73INTD_Msk          (0x80UL)                  /*!< GPIO73INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGJ_GPIO73OUTCFG_Pos        (5UL)                     /*!< GPIO73OUTCFG (Bit 5)                                  */
#define GPIO_CFGJ_GPIO73OUTCFG_Msk        (0x60UL)                  /*!< GPIO73OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGJ_GPIO73INCFG_Pos         (4UL)                     /*!< GPIO73INCFG (Bit 4)                                   */
#define GPIO_CFGJ_GPIO73INCFG_Msk         (0x10UL)                  /*!< GPIO73INCFG (Bitfield-Mask: 0x01)                     */
#define GPIO_CFGJ_GPIO72INTD_Pos          (3UL)                     /*!< GPIO72INTD (Bit 3)                                    */
#define GPIO_CFGJ_GPIO72INTD_Msk          (0x8UL)                   /*!< GPIO72INTD (Bitfield-Mask: 0x01)                      */
#define GPIO_CFGJ_GPIO72OUTCFG_Pos        (1UL)                     /*!< GPIO72OUTCFG (Bit 1)                                  */
#define GPIO_CFGJ_GPIO72OUTCFG_Msk        (0x6UL)                   /*!< GPIO72OUTCFG (Bitfield-Mask: 0x03)                    */
#define GPIO_CFGJ_GPIO72INCFG_Pos         (0UL)                     /*!< GPIO72INCFG (Bit 0)                                   */
#define GPIO_CFGJ_GPIO72INCFG_Msk         (0x1UL)                   /*!< GPIO72INCFG (Bitfield-Mask: 0x01)                     */
/* ========================================================  PADKEY  ========================================================= */
#define GPIO_PADKEY_PADKEY_Pos            (0UL)                     /*!< PADKEY (Bit 0)                                        */
#define GPIO_PADKEY_PADKEY_Msk            (0xffffffffUL)            /*!< PADKEY (Bitfield-Mask: 0xffffffff)                    */
/* ==========================================================  RDA  ========================================================== */
#define GPIO_RDA_RDA_Pos                  (0UL)                     /*!< RDA (Bit 0)                                           */
