TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_ALTPADCFGP_PAD61_DS1_Pos     (8UL)                     /*!< PAD61_DS1 (Bit 8)                                     */
#define GPIO_ALTPADCFGP_PAD61_DS1_Msk     (0x100UL)                 /*!< PAD61_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGP_PAD60_SR_Pos      (4UL)                     /*!< PAD60_SR (Bit 4)                                      */
#define GPIO_ALTPADCFGP_PAD60_SR_Msk      (0x10UL)                  /*!< PAD60_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGP_PAD60_DS1_Pos     (0UL)                     /*!< PAD60_DS1 (Bit 0)                                     */
#define GPIO_ALTPADCFGP_PAD60_DS1_Msk     (0x1UL)                   /*!< PAD60_DS1 (Bitfield-Mask: 0x01)                       */
/* ======================================================  ALTPADCFGQ  ======================================================= */
#define GPIO_ALTPADCFGQ_PAD67_SR_Pos      (28UL)                    /*!< PAD67_SR (Bit 28)                                     */
#define GPIO_ALTPADCFGQ_PAD67_SR_Msk      (0x10000000UL)            /*!< PAD67_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGQ_PAD67_DS1_Pos     (24UL)                    /*!< PAD67_DS1 (Bit 24)                                    */
#define GPIO_ALTPADCFGQ_PAD67_DS1_Msk     (0x1000000UL)             /*!< PAD67_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGQ_PAD66_SR_Pos      (20UL)                    /*!< PAD66_SR (Bit 20)                                     */
#define GPIO_ALTPADCFGQ_PAD66_SR_Msk      (0x100000UL)              /*!< PAD66_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGQ_PAD66_DS1_Pos     (16UL)                    /*!< PAD66_DS1 (Bit 16)                                    */
#define GPIO_ALTPADCFGQ_PAD66_DS1_Msk     (0x10000UL)               /*!< PAD66_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGQ_PAD65_SR_Pos      (12UL)                    /*!< PAD65_SR (Bit 12)                                     */
#define GPIO_ALTPADCFGQ_PAD65_SR_Msk      (0x1000UL)                /*!< PAD65_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGQ_PAD65_DS1_Pos     (8UL)                     /*!< PAD65_DS1 (Bit 8)                                     */
#define GPIO_ALTPADCFGQ_PAD65_DS1_Msk     (0x100UL)                 /*!< PAD65_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGQ_PAD64_SR_Pos      (4UL)                     /*!< PAD64_SR (Bit 4)                                      */
#define GPIO_ALTPADCFGQ_PAD64_SR_Msk      (0x10UL)                  /*!< PAD64_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGQ_PAD64_DS1_Pos     (0UL)                     /*!< PAD64_DS1 (Bit 0)                                     */
#define GPIO_ALTPADCFGQ_PAD64_DS1_Msk     (0x1UL)                   /*!< PAD64_DS1 (Bitfield-Mask: 0x01)                       */
/* ======================================================  ALTPADCFGR  ======================================================= */
#define GPIO_ALTPADCFGR_PAD71_SR_Pos      (28UL)                    /*!< PAD71_SR (Bit 28)                                     */
#define GPIO_ALTPADCFGR_PAD71_SR_Msk      (0x10000000UL)            /*!< PAD71_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGR_PAD71_DS1_Pos     (24UL)                    /*!< PAD71_DS1 (Bit 24)                                    */
#define GPIO_ALTPADCFGR_PAD71_DS1_Msk     (0x1000000UL)             /*!< PAD71_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGR_PAD70_SR_Pos      (20UL)                    /*!< PAD70_SR (Bit 20)                                     */
#define GPIO_ALTPADCFGR_PAD70_SR_Msk      (0x100000UL)              /*!< PAD70_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGR_PAD70_DS1_Pos     (16UL)                    /*!< PAD70_DS1 (Bit 16)                                    */
#define GPIO_ALTPADCFGR_PAD70_DS1_Msk     (0x10000UL)               /*!< PAD70_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGR_PAD69_SR_Pos      (12UL)                    /*!< PAD69_SR (Bit 12)                                     */
#define GPIO_ALTPADCFGR_PAD69_SR_Msk      (0x1000UL)                /*!< PAD69_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGR_PAD69_DS1_Pos     (8UL)                     /*!< PAD69_DS1 (Bit 8)                                     */
#define GPIO_ALTPADCFGR_PAD69_DS1_Msk     (0x100UL)                 /*!< PAD69_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGR_PAD68_SR_Pos      (4UL)                     /*!< PAD68_SR (Bit 4)                                      */
#define GPIO_ALTPADCFGR_PAD68_SR_Msk      (0x10UL)                  /*!< PAD68_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGR_PAD68_DS1_Pos     (0UL)                     /*!< PAD68_DS1 (Bit 0)                                     */
#define GPIO_ALTPADCFGR_PAD68_DS1_Msk     (0x1UL)                   /*!< PAD68_DS1 (Bitfield-Mask: 0x01)                       */
/* ======================================================  ALTPADCFGS  ======================================================= */
#define GPIO_ALTPADCFGS_PAD73_SR_Pos      (12UL)                    /*!< PAD73_SR (Bit 12)                                     */
#define GPIO_ALTPADCFGS_PAD73_SR_Msk      (0x1000UL)                /*!< PAD73_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGS_PAD73_DS1_Pos     (8UL)                     /*!< PAD73_DS1 (Bit 8)                                     */
#define GPIO_ALTPADCFGS_PAD73_DS1_Msk     (0x100UL)                 /*!< PAD73_DS1 (Bitfield-Mask: 0x01)                       */
#define GPIO_ALTPADCFGS_PAD72_SR_Pos      (4UL)                     /*!< PAD72_SR (Bit 4)                                      */
#define GPIO_ALTPADCFGS_PAD72_SR_Msk      (0x10UL)                  /*!< PAD72_SR (Bitfield-Mask: 0x01)                        */
#define GPIO_ALTPADCFGS_PAD72_DS1_Pos     (0UL)                     /*!< PAD72_DS1 (Bit 0)                                     */
#define GPIO_ALTPADCFGS_PAD72_DS1_Msk     (0x1UL)                   /*!< PAD72_DS1 (Bitfield-Mask: 0x01)                       */
/* =========================================================  SCDET  ========================================================= */
#define GPIO_SCDET_SCDET_Pos              (0UL)                     /*!< SCDET (Bit 0)                                         */
#define GPIO_SCDET_SCDET_Msk              (0x7fUL)                  /*!< SCDET (Bitfield-Mask: 0x7f)                           */
/* ========================================================  CTENCFG  ======================================================== */
#define GPIO_CTENCFG_EN31_Pos             (31UL)                    /*!< EN31 (Bit 31)                                         */
#define GPIO_CTENCFG_EN31_Msk             (0x80000000UL)            /*!< EN31 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN30_Pos             (30UL)                    /*!< EN30 (Bit 30)                                         */
#define GPIO_CTENCFG_EN30_Msk             (0x40000000UL)            /*!< EN30 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN29_Pos             (29UL)                    /*!< EN29 (Bit 29)                                         */
#define GPIO_CTENCFG_EN29_Msk             (0x20000000UL)            /*!< EN29 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN28_Pos             (28UL)                    /*!< EN28 (Bit 28)                                         */
#define GPIO_CTENCFG_EN28_Msk             (0x10000000UL)            /*!< EN28 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN27_Pos             (27UL)                    /*!< EN27 (Bit 27)                                         */
#define GPIO_CTENCFG_EN27_Msk             (0x8000000UL)             /*!< EN27 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN26_Pos             (26UL)                    /*!< EN26 (Bit 26)                                         */
#define GPIO_CTENCFG_EN26_Msk             (0x4000000UL)             /*!< EN26 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN25_Pos             (25UL)                    /*!< EN25 (Bit 25)                                         */
#define GPIO_CTENCFG_EN25_Msk             (0x2000000UL)             /*!< EN25 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN24_Pos             (24UL)                    /*!< EN24 (Bit 24)                                         */
#define GPIO_CTENCFG_EN24_Msk             (0x1000000UL)             /*!< EN24 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN23_Pos             (23UL)                    /*!< EN23 (Bit 23)                                         */
#define GPIO_CTENCFG_EN23_Msk             (0x800000UL)              /*!< EN23 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN22_Pos             (22UL)                    /*!< EN22 (Bit 22)                                         */
#define GPIO_CTENCFG_EN22_Msk             (0x400000UL)              /*!< EN22 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN21_Pos             (21UL)                    /*!< EN21 (Bit 21)                                         */
#define GPIO_CTENCFG_EN21_Msk             (0x200000UL)              /*!< EN21 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN20_Pos             (20UL)                    /*!< EN20 (Bit 20)                                         */
#define GPIO_CTENCFG_EN20_Msk             (0x100000UL)              /*!< EN20 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN19_Pos             (19UL)                    /*!< EN19 (Bit 19)                                         */
#define GPIO_CTENCFG_EN19_Msk             (0x80000UL)               /*!< EN19 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN18_Pos             (18UL)                    /*!< EN18 (Bit 18)                                         */
#define GPIO_CTENCFG_EN18_Msk             (0x40000UL)               /*!< EN18 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN17_Pos             (17UL)                    /*!< EN17 (Bit 17)                                         */
#define GPIO_CTENCFG_EN17_Msk             (0x20000UL)               /*!< EN17 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN16_Pos             (16UL)                    /*!< EN16 (Bit 16)                                         */
#define GPIO_CTENCFG_EN16_Msk             (0x10000UL)               /*!< EN16 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN15_Pos             (15UL)                    /*!< EN15 (Bit 15)                                         */
#define GPIO_CTENCFG_EN15_Msk             (0x8000UL)                /*!< EN15 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN14_Pos             (14UL)                    /*!< EN14 (Bit 14)                                         */
#define GPIO_CTENCFG_EN14_Msk             (0x4000UL)                /*!< EN14 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN13_Pos             (13UL)                    /*!< EN13 (Bit 13)                                         */
#define GPIO_CTENCFG_EN13_Msk             (0x2000UL)                /*!< EN13 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN12_Pos             (12UL)                    /*!< EN12 (Bit 12)                                         */
#define GPIO_CTENCFG_EN12_Msk             (0x1000UL)                /*!< EN12 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN11_Pos             (11UL)                    /*!< EN11 (Bit 11)                                         */
#define GPIO_CTENCFG_EN11_Msk             (0x800UL)                 /*!< EN11 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN10_Pos             (10UL)                    /*!< EN10 (Bit 10)                                         */
#define GPIO_CTENCFG_EN10_Msk             (0x400UL)                 /*!< EN10 (Bitfield-Mask: 0x01)                            */
#define GPIO_CTENCFG_EN9_Pos              (9UL)                     /*!< EN9 (Bit 9)                                           */
#define GPIO_CTENCFG_EN9_Msk              (0x200UL)                 /*!< EN9 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN8_Pos              (8UL)                     /*!< EN8 (Bit 8)                                           */
#define GPIO_CTENCFG_EN8_Msk              (0x100UL)                 /*!< EN8 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN7_Pos              (7UL)                     /*!< EN7 (Bit 7)                                           */
#define GPIO_CTENCFG_EN7_Msk              (0x80UL)                  /*!< EN7 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN6_Pos              (6UL)                     /*!< EN6 (Bit 6)                                           */
#define GPIO_CTENCFG_EN6_Msk              (0x40UL)                  /*!< EN6 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN5_Pos              (5UL)                     /*!< EN5 (Bit 5)                                           */
#define GPIO_CTENCFG_EN5_Msk              (0x20UL)                  /*!< EN5 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN4_Pos              (4UL)                     /*!< EN4 (Bit 4)                                           */
#define GPIO_CTENCFG_EN4_Msk              (0x10UL)                  /*!< EN4 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN3_Pos              (3UL)                     /*!< EN3 (Bit 3)                                           */
#define GPIO_CTENCFG_EN3_Msk              (0x8UL)                   /*!< EN3 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN2_Pos              (2UL)                     /*!< EN2 (Bit 2)                                           */
#define GPIO_CTENCFG_EN2_Msk              (0x4UL)                   /*!< EN2 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN1_Pos              (1UL)                     /*!< EN1 (Bit 1)                                           */
#define GPIO_CTENCFG_EN1_Msk              (0x2UL)                   /*!< EN1 (Bitfield-Mask: 0x01)                             */
#define GPIO_CTENCFG_EN0_Pos              (0UL)                     /*!< EN0 (Bit 0)                                           */
#define GPIO_CTENCFG_EN0_Msk              (0x1UL)                   /*!< EN0 (Bitfield-Mask: 0x01)                             */
/* ========================================================  INT0EN  ========================================================= */
#define GPIO_INT0EN_GPIO31_Pos            (31UL)                    /*!< GPIO31 (Bit 31)                                       */
#define GPIO_INT0EN_GPIO31_Msk            (0x80000000UL)            /*!< GPIO31 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO30_Pos            (30UL)                    /*!< GPIO30 (Bit 30)                                       */
#define GPIO_INT0EN_GPIO30_Msk            (0x40000000UL)            /*!< GPIO30 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO29_Pos            (29UL)                    /*!< GPIO29 (Bit 29)                                       */
#define GPIO_INT0EN_GPIO29_Msk            (0x20000000UL)            /*!< GPIO29 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO28_Pos            (28UL)                    /*!< GPIO28 (Bit 28)                                       */
#define GPIO_INT0EN_GPIO28_Msk            (0x10000000UL)            /*!< GPIO28 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO27_Pos            (27UL)                    /*!< GPIO27 (Bit 27)                                       */
#define GPIO_INT0EN_GPIO27_Msk            (0x8000000UL)             /*!< GPIO27 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO26_Pos            (26UL)                    /*!< GPIO26 (Bit 26)                                       */
#define GPIO_INT0EN_GPIO26_Msk            (0x4000000UL)             /*!< GPIO26 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO25_Pos            (25UL)                    /*!< GPIO25 (Bit 25)                                       */
#define GPIO_INT0EN_GPIO25_Msk            (0x2000000UL)             /*!< GPIO25 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO24_Pos            (24UL)                    /*!< GPIO24 (Bit 24)                                       */
#define GPIO_INT0EN_GPIO24_Msk            (0x1000000UL)             /*!< GPIO24 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO23_Pos            (23UL)                    /*!< GPIO23 (Bit 23)                                       */
#define GPIO_INT0EN_GPIO23_Msk            (0x800000UL)              /*!< GPIO23 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO22_Pos            (22UL)                    /*!< GPIO22 (Bit 22)                                       */
#define GPIO_INT0EN_GPIO22_Msk            (0x400000UL)              /*!< GPIO22 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO21_Pos            (21UL)                    /*!< GPIO21 (Bit 21)                                       */
#define GPIO_INT0EN_GPIO21_Msk            (0x200000UL)              /*!< GPIO21 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO20_Pos            (20UL)                    /*!< GPIO20 (Bit 20)                                       */
#define GPIO_INT0EN_GPIO20_Msk            (0x100000UL)              /*!< GPIO20 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO19_Pos            (19UL)                    /*!< GPIO19 (Bit 19)                                       */
#define GPIO_INT0EN_GPIO19_Msk            (0x80000UL)               /*!< GPIO19 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO18_Pos            (18UL)                    /*!< GPIO18 (Bit 18)                                       */
#define GPIO_INT0EN_GPIO18_Msk            (0x40000UL)               /*!< GPIO18 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO17_Pos            (17UL)                    /*!< GPIO17 (Bit 17)                                       */
#define GPIO_INT0EN_GPIO17_Msk            (0x20000UL)               /*!< GPIO17 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO16_Pos            (16UL)                    /*!< GPIO16 (Bit 16)                                       */
#define GPIO_INT0EN_GPIO16_Msk            (0x10000UL)               /*!< GPIO16 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO15_Pos            (15UL)                    /*!< GPIO15 (Bit 15)                                       */
#define GPIO_INT0EN_GPIO15_Msk            (0x8000UL)                /*!< GPIO15 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO14_Pos            (14UL)                    /*!< GPIO14 (Bit 14)                                       */
#define GPIO_INT0EN_GPIO14_Msk            (0x4000UL)                /*!< GPIO14 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO13_Pos            (13UL)                    /*!< GPIO13 (Bit 13)                                       */
#define GPIO_INT0EN_GPIO13_Msk            (0x2000UL)                /*!< GPIO13 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO12_Pos            (12UL)                    /*!< GPIO12 (Bit 12)                                       */
#define GPIO_INT0EN_GPIO12_Msk            (0x1000UL)                /*!< GPIO12 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO11_Pos            (11UL)                    /*!< GPIO11 (Bit 11)                                       */
#define GPIO_INT0EN_GPIO11_Msk            (0x800UL)                 /*!< GPIO11 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO10_Pos            (10UL)                    /*!< GPIO10 (Bit 10)                                       */
#define GPIO_INT0EN_GPIO10_Msk            (0x400UL)                 /*!< GPIO10 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT0EN_GPIO9_Pos             (9UL)                     /*!< GPIO9 (Bit 9)                                         */
#define GPIO_INT0EN_GPIO9_Msk             (0x200UL)                 /*!< GPIO9 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO8_Pos             (8UL)                     /*!< GPIO8 (Bit 8)                                         */
#define GPIO_INT0EN_GPIO8_Msk             (0x100UL)                 /*!< GPIO8 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO7_Pos             (7UL)                     /*!< GPIO7 (Bit 7)                                         */
#define GPIO_INT0EN_GPIO7_Msk             (0x80UL)                  /*!< GPIO7 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO6_Pos             (6UL)                     /*!< GPIO6 (Bit 6)                                         */
#define GPIO_INT0EN_GPIO6_Msk             (0x40UL)                  /*!< GPIO6 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO5_Pos             (5UL)                     /*!< GPIO5 (Bit 5)                                         */
#define GPIO_INT0EN_GPIO5_Msk             (0x20UL)                  /*!< GPIO5 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO4_Pos             (4UL)                     /*!< GPIO4 (Bit 4)                                         */
#define GPIO_INT0EN_GPIO4_Msk             (0x10UL)                  /*!< GPIO4 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO3_Pos             (3UL)                     /*!< GPIO3 (Bit 3)                                         */
#define GPIO_INT0EN_GPIO3_Msk             (0x8UL)                   /*!< GPIO3 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO2_Pos             (2UL)                     /*!< GPIO2 (Bit 2)                                         */
#define GPIO_INT0EN_GPIO2_Msk             (0x4UL)                   /*!< GPIO2 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO1_Pos             (1UL)                     /*!< GPIO1 (Bit 1)                                         */
#define GPIO_INT0EN_GPIO1_Msk             (0x2UL)                   /*!< GPIO1 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0EN_GPIO0_Pos             (0UL)                     /*!< GPIO0 (Bit 0)                                         */
#define GPIO_INT0EN_GPIO0_Msk             (0x1UL)                   /*!< GPIO0 (Bitfield-Mask: 0x01)                           */
/* =======================================================  INT0STAT  ======================================================== */
#define GPIO_INT0STAT_GPIO31_Pos          (31UL)                    /*!< GPIO31 (Bit 31)                                       */
