TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_INT0SET_GPIO4_Msk            (0x10UL)                  /*!< GPIO4 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0SET_GPIO3_Pos            (3UL)                     /*!< GPIO3 (Bit 3)                                         */
#define GPIO_INT0SET_GPIO3_Msk            (0x8UL)                   /*!< GPIO3 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0SET_GPIO2_Pos            (2UL)                     /*!< GPIO2 (Bit 2)                                         */
#define GPIO_INT0SET_GPIO2_Msk            (0x4UL)                   /*!< GPIO2 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0SET_GPIO1_Pos            (1UL)                     /*!< GPIO1 (Bit 1)                                         */
#define GPIO_INT0SET_GPIO1_Msk            (0x2UL)                   /*!< GPIO1 (Bitfield-Mask: 0x01)                           */
#define GPIO_INT0SET_GPIO0_Pos            (0UL)                     /*!< GPIO0 (Bit 0)                                         */
#define GPIO_INT0SET_GPIO0_Msk            (0x1UL)                   /*!< GPIO0 (Bitfield-Mask: 0x01)                           */
/* ========================================================  INT1EN  ========================================================= */
#define GPIO_INT1EN_GPIO63_Pos            (31UL)                    /*!< GPIO63 (Bit 31)                                       */
#define GPIO_INT1EN_GPIO63_Msk            (0x80000000UL)            /*!< GPIO63 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO62_Pos            (30UL)                    /*!< GPIO62 (Bit 30)                                       */
#define GPIO_INT1EN_GPIO62_Msk            (0x40000000UL)            /*!< GPIO62 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO61_Pos            (29UL)                    /*!< GPIO61 (Bit 29)                                       */
#define GPIO_INT1EN_GPIO61_Msk            (0x20000000UL)            /*!< GPIO61 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO60_Pos            (28UL)                    /*!< GPIO60 (Bit 28)                                       */
#define GPIO_INT1EN_GPIO60_Msk            (0x10000000UL)            /*!< GPIO60 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO59_Pos            (27UL)                    /*!< GPIO59 (Bit 27)                                       */
#define GPIO_INT1EN_GPIO59_Msk            (0x8000000UL)             /*!< GPIO59 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO58_Pos            (26UL)                    /*!< GPIO58 (Bit 26)                                       */
#define GPIO_INT1EN_GPIO58_Msk            (0x4000000UL)             /*!< GPIO58 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO57_Pos            (25UL)                    /*!< GPIO57 (Bit 25)                                       */
#define GPIO_INT1EN_GPIO57_Msk            (0x2000000UL)             /*!< GPIO57 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO56_Pos            (24UL)                    /*!< GPIO56 (Bit 24)                                       */
#define GPIO_INT1EN_GPIO56_Msk            (0x1000000UL)             /*!< GPIO56 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO55_Pos            (23UL)                    /*!< GPIO55 (Bit 23)                                       */
#define GPIO_INT1EN_GPIO55_Msk            (0x800000UL)              /*!< GPIO55 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO54_Pos            (22UL)                    /*!< GPIO54 (Bit 22)                                       */
#define GPIO_INT1EN_GPIO54_Msk            (0x400000UL)              /*!< GPIO54 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO53_Pos            (21UL)                    /*!< GPIO53 (Bit 21)                                       */
#define GPIO_INT1EN_GPIO53_Msk            (0x200000UL)              /*!< GPIO53 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO52_Pos            (20UL)                    /*!< GPIO52 (Bit 20)                                       */
#define GPIO_INT1EN_GPIO52_Msk            (0x100000UL)              /*!< GPIO52 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO51_Pos            (19UL)                    /*!< GPIO51 (Bit 19)                                       */
#define GPIO_INT1EN_GPIO51_Msk            (0x80000UL)               /*!< GPIO51 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO50_Pos            (18UL)                    /*!< GPIO50 (Bit 18)                                       */
#define GPIO_INT1EN_GPIO50_Msk            (0x40000UL)               /*!< GPIO50 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO49_Pos            (17UL)                    /*!< GPIO49 (Bit 17)                                       */
#define GPIO_INT1EN_GPIO49_Msk            (0x20000UL)               /*!< GPIO49 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO48_Pos            (16UL)                    /*!< GPIO48 (Bit 16)                                       */
#define GPIO_INT1EN_GPIO48_Msk            (0x10000UL)               /*!< GPIO48 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO47_Pos            (15UL)                    /*!< GPIO47 (Bit 15)                                       */
#define GPIO_INT1EN_GPIO47_Msk            (0x8000UL)                /*!< GPIO47 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO46_Pos            (14UL)                    /*!< GPIO46 (Bit 14)                                       */
#define GPIO_INT1EN_GPIO46_Msk            (0x4000UL)                /*!< GPIO46 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO45_Pos            (13UL)                    /*!< GPIO45 (Bit 13)                                       */
#define GPIO_INT1EN_GPIO45_Msk            (0x2000UL)                /*!< GPIO45 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO44_Pos            (12UL)                    /*!< GPIO44 (Bit 12)                                       */
#define GPIO_INT1EN_GPIO44_Msk            (0x1000UL)                /*!< GPIO44 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO43_Pos            (11UL)                    /*!< GPIO43 (Bit 11)                                       */
#define GPIO_INT1EN_GPIO43_Msk            (0x800UL)                 /*!< GPIO43 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO42_Pos            (10UL)                    /*!< GPIO42 (Bit 10)                                       */
#define GPIO_INT1EN_GPIO42_Msk            (0x400UL)                 /*!< GPIO42 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO41_Pos            (9UL)                     /*!< GPIO41 (Bit 9)                                        */
#define GPIO_INT1EN_GPIO41_Msk            (0x200UL)                 /*!< GPIO41 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO40_Pos            (8UL)                     /*!< GPIO40 (Bit 8)                                        */
#define GPIO_INT1EN_GPIO40_Msk            (0x100UL)                 /*!< GPIO40 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO39_Pos            (7UL)                     /*!< GPIO39 (Bit 7)                                        */
#define GPIO_INT1EN_GPIO39_Msk            (0x80UL)                  /*!< GPIO39 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO38_Pos            (6UL)                     /*!< GPIO38 (Bit 6)                                        */
#define GPIO_INT1EN_GPIO38_Msk            (0x40UL)                  /*!< GPIO38 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO37_Pos            (5UL)                     /*!< GPIO37 (Bit 5)                                        */
#define GPIO_INT1EN_GPIO37_Msk            (0x20UL)                  /*!< GPIO37 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO36_Pos            (4UL)                     /*!< GPIO36 (Bit 4)                                        */
#define GPIO_INT1EN_GPIO36_Msk            (0x10UL)                  /*!< GPIO36 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO35_Pos            (3UL)                     /*!< GPIO35 (Bit 3)                                        */
#define GPIO_INT1EN_GPIO35_Msk            (0x8UL)                   /*!< GPIO35 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO34_Pos            (2UL)                     /*!< GPIO34 (Bit 2)                                        */
#define GPIO_INT1EN_GPIO34_Msk            (0x4UL)                   /*!< GPIO34 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO33_Pos            (1UL)                     /*!< GPIO33 (Bit 1)                                        */
#define GPIO_INT1EN_GPIO33_Msk            (0x2UL)                   /*!< GPIO33 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1EN_GPIO32_Pos            (0UL)                     /*!< GPIO32 (Bit 0)                                        */
#define GPIO_INT1EN_GPIO32_Msk            (0x1UL)                   /*!< GPIO32 (Bitfield-Mask: 0x01)                          */
/* =======================================================  INT1STAT  ======================================================== */
#define GPIO_INT1STAT_GPIO63_Pos          (31UL)                    /*!< GPIO63 (Bit 31)                                       */
#define GPIO_INT1STAT_GPIO63_Msk          (0x80000000UL)            /*!< GPIO63 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO62_Pos          (30UL)                    /*!< GPIO62 (Bit 30)                                       */
#define GPIO_INT1STAT_GPIO62_Msk          (0x40000000UL)            /*!< GPIO62 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO61_Pos          (29UL)                    /*!< GPIO61 (Bit 29)                                       */
#define GPIO_INT1STAT_GPIO61_Msk          (0x20000000UL)            /*!< GPIO61 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO60_Pos          (28UL)                    /*!< GPIO60 (Bit 28)                                       */
#define GPIO_INT1STAT_GPIO60_Msk          (0x10000000UL)            /*!< GPIO60 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO59_Pos          (27UL)                    /*!< GPIO59 (Bit 27)                                       */
#define GPIO_INT1STAT_GPIO59_Msk          (0x8000000UL)             /*!< GPIO59 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO58_Pos          (26UL)                    /*!< GPIO58 (Bit 26)                                       */
#define GPIO_INT1STAT_GPIO58_Msk          (0x4000000UL)             /*!< GPIO58 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO57_Pos          (25UL)                    /*!< GPIO57 (Bit 25)                                       */
#define GPIO_INT1STAT_GPIO57_Msk          (0x2000000UL)             /*!< GPIO57 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO56_Pos          (24UL)                    /*!< GPIO56 (Bit 24)                                       */
#define GPIO_INT1STAT_GPIO56_Msk          (0x1000000UL)             /*!< GPIO56 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO55_Pos          (23UL)                    /*!< GPIO55 (Bit 23)                                       */
#define GPIO_INT1STAT_GPIO55_Msk          (0x800000UL)              /*!< GPIO55 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO54_Pos          (22UL)                    /*!< GPIO54 (Bit 22)                                       */
#define GPIO_INT1STAT_GPIO54_Msk          (0x400000UL)              /*!< GPIO54 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO53_Pos          (21UL)                    /*!< GPIO53 (Bit 21)                                       */
#define GPIO_INT1STAT_GPIO53_Msk          (0x200000UL)              /*!< GPIO53 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO52_Pos          (20UL)                    /*!< GPIO52 (Bit 20)                                       */
#define GPIO_INT1STAT_GPIO52_Msk          (0x100000UL)              /*!< GPIO52 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO51_Pos          (19UL)                    /*!< GPIO51 (Bit 19)                                       */
#define GPIO_INT1STAT_GPIO51_Msk          (0x80000UL)               /*!< GPIO51 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO50_Pos          (18UL)                    /*!< GPIO50 (Bit 18)                                       */
#define GPIO_INT1STAT_GPIO50_Msk          (0x40000UL)               /*!< GPIO50 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO49_Pos          (17UL)                    /*!< GPIO49 (Bit 17)                                       */
#define GPIO_INT1STAT_GPIO49_Msk          (0x20000UL)               /*!< GPIO49 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO48_Pos          (16UL)                    /*!< GPIO48 (Bit 16)                                       */
#define GPIO_INT1STAT_GPIO48_Msk          (0x10000UL)               /*!< GPIO48 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO47_Pos          (15UL)                    /*!< GPIO47 (Bit 15)                                       */
#define GPIO_INT1STAT_GPIO47_Msk          (0x8000UL)                /*!< GPIO47 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO46_Pos          (14UL)                    /*!< GPIO46 (Bit 14)                                       */
#define GPIO_INT1STAT_GPIO46_Msk          (0x4000UL)                /*!< GPIO46 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO45_Pos          (13UL)                    /*!< GPIO45 (Bit 13)                                       */
#define GPIO_INT1STAT_GPIO45_Msk          (0x2000UL)                /*!< GPIO45 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO44_Pos          (12UL)                    /*!< GPIO44 (Bit 12)                                       */
#define GPIO_INT1STAT_GPIO44_Msk          (0x1000UL)                /*!< GPIO44 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO43_Pos          (11UL)                    /*!< GPIO43 (Bit 11)                                       */
#define GPIO_INT1STAT_GPIO43_Msk          (0x800UL)                 /*!< GPIO43 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO42_Pos          (10UL)                    /*!< GPIO42 (Bit 10)                                       */
#define GPIO_INT1STAT_GPIO42_Msk          (0x400UL)                 /*!< GPIO42 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO41_Pos          (9UL)                     /*!< GPIO41 (Bit 9)                                        */
#define GPIO_INT1STAT_GPIO41_Msk          (0x200UL)                 /*!< GPIO41 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO40_Pos          (8UL)                     /*!< GPIO40 (Bit 8)                                        */
#define GPIO_INT1STAT_GPIO40_Msk          (0x100UL)                 /*!< GPIO40 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO39_Pos          (7UL)                     /*!< GPIO39 (Bit 7)                                        */
#define GPIO_INT1STAT_GPIO39_Msk          (0x80UL)                  /*!< GPIO39 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO38_Pos          (6UL)                     /*!< GPIO38 (Bit 6)                                        */
#define GPIO_INT1STAT_GPIO38_Msk          (0x40UL)                  /*!< GPIO38 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO37_Pos          (5UL)                     /*!< GPIO37 (Bit 5)                                        */
#define GPIO_INT1STAT_GPIO37_Msk          (0x20UL)                  /*!< GPIO37 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO36_Pos          (4UL)                     /*!< GPIO36 (Bit 4)                                        */
#define GPIO_INT1STAT_GPIO36_Msk          (0x10UL)                  /*!< GPIO36 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO35_Pos          (3UL)                     /*!< GPIO35 (Bit 3)                                        */
#define GPIO_INT1STAT_GPIO35_Msk          (0x8UL)                   /*!< GPIO35 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO34_Pos          (2UL)                     /*!< GPIO34 (Bit 2)                                        */
#define GPIO_INT1STAT_GPIO34_Msk          (0x4UL)                   /*!< GPIO34 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO33_Pos          (1UL)                     /*!< GPIO33 (Bit 1)                                        */
#define GPIO_INT1STAT_GPIO33_Msk          (0x2UL)                   /*!< GPIO33 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1STAT_GPIO32_Pos          (0UL)                     /*!< GPIO32 (Bit 0)                                        */
#define GPIO_INT1STAT_GPIO32_Msk          (0x1UL)                   /*!< GPIO32 (Bitfield-Mask: 0x01)                          */
/* ========================================================  INT1CLR  ======================================================== */
#define GPIO_INT1CLR_GPIO63_Pos           (31UL)                    /*!< GPIO63 (Bit 31)                                       */
#define GPIO_INT1CLR_GPIO63_Msk           (0x80000000UL)            /*!< GPIO63 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO62_Pos           (30UL)                    /*!< GPIO62 (Bit 30)                                       */
#define GPIO_INT1CLR_GPIO62_Msk           (0x40000000UL)            /*!< GPIO62 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO61_Pos           (29UL)                    /*!< GPIO61 (Bit 29)                                       */
#define GPIO_INT1CLR_GPIO61_Msk           (0x20000000UL)            /*!< GPIO61 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO60_Pos           (28UL)                    /*!< GPIO60 (Bit 28)                                       */
#define GPIO_INT1CLR_GPIO60_Msk           (0x10000000UL)            /*!< GPIO60 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO59_Pos           (27UL)                    /*!< GPIO59 (Bit 27)                                       */
#define GPIO_INT1CLR_GPIO59_Msk           (0x8000000UL)             /*!< GPIO59 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO58_Pos           (26UL)                    /*!< GPIO58 (Bit 26)                                       */
#define GPIO_INT1CLR_GPIO58_Msk           (0x4000000UL)             /*!< GPIO58 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO57_Pos           (25UL)                    /*!< GPIO57 (Bit 25)                                       */
#define GPIO_INT1CLR_GPIO57_Msk           (0x2000000UL)             /*!< GPIO57 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO56_Pos           (24UL)                    /*!< GPIO56 (Bit 24)                                       */
#define GPIO_INT1CLR_GPIO56_Msk           (0x1000000UL)             /*!< GPIO56 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO55_Pos           (23UL)                    /*!< GPIO55 (Bit 23)                                       */
#define GPIO_INT1CLR_GPIO55_Msk           (0x800000UL)              /*!< GPIO55 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO54_Pos           (22UL)                    /*!< GPIO54 (Bit 22)                                       */
#define GPIO_INT1CLR_GPIO54_Msk           (0x400000UL)              /*!< GPIO54 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO53_Pos           (21UL)                    /*!< GPIO53 (Bit 21)                                       */
#define GPIO_INT1CLR_GPIO53_Msk           (0x200000UL)              /*!< GPIO53 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO52_Pos           (20UL)                    /*!< GPIO52 (Bit 20)                                       */
#define GPIO_INT1CLR_GPIO52_Msk           (0x100000UL)              /*!< GPIO52 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO51_Pos           (19UL)                    /*!< GPIO51 (Bit 19)                                       */
#define GPIO_INT1CLR_GPIO51_Msk           (0x80000UL)               /*!< GPIO51 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO50_Pos           (18UL)                    /*!< GPIO50 (Bit 18)                                       */
#define GPIO_INT1CLR_GPIO50_Msk           (0x40000UL)               /*!< GPIO50 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO49_Pos           (17UL)                    /*!< GPIO49 (Bit 17)                                       */
#define GPIO_INT1CLR_GPIO49_Msk           (0x20000UL)               /*!< GPIO49 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO48_Pos           (16UL)                    /*!< GPIO48 (Bit 16)                                       */
#define GPIO_INT1CLR_GPIO48_Msk           (0x10000UL)               /*!< GPIO48 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO47_Pos           (15UL)                    /*!< GPIO47 (Bit 15)                                       */
#define GPIO_INT1CLR_GPIO47_Msk           (0x8000UL)                /*!< GPIO47 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO46_Pos           (14UL)                    /*!< GPIO46 (Bit 14)                                       */
#define GPIO_INT1CLR_GPIO46_Msk           (0x4000UL)                /*!< GPIO46 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO45_Pos           (13UL)                    /*!< GPIO45 (Bit 13)                                       */
#define GPIO_INT1CLR_GPIO45_Msk           (0x2000UL)                /*!< GPIO45 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO44_Pos           (12UL)                    /*!< GPIO44 (Bit 12)                                       */
#define GPIO_INT1CLR_GPIO44_Msk           (0x1000UL)                /*!< GPIO44 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO43_Pos           (11UL)                    /*!< GPIO43 (Bit 11)                                       */
#define GPIO_INT1CLR_GPIO43_Msk           (0x800UL)                 /*!< GPIO43 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO42_Pos           (10UL)                    /*!< GPIO42 (Bit 10)                                       */
#define GPIO_INT1CLR_GPIO42_Msk           (0x400UL)                 /*!< GPIO42 (Bitfield-Mask: 0x01)                          */
