TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define GPIO_INT1CLR_GPIO41_Pos           (9UL)                     /*!< GPIO41 (Bit 9)                                        */
#define GPIO_INT1CLR_GPIO41_Msk           (0x200UL)                 /*!< GPIO41 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO40_Pos           (8UL)                     /*!< GPIO40 (Bit 8)                                        */
#define GPIO_INT1CLR_GPIO40_Msk           (0x100UL)                 /*!< GPIO40 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO39_Pos           (7UL)                     /*!< GPIO39 (Bit 7)                                        */
#define GPIO_INT1CLR_GPIO39_Msk           (0x80UL)                  /*!< GPIO39 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO38_Pos           (6UL)                     /*!< GPIO38 (Bit 6)                                        */
#define GPIO_INT1CLR_GPIO38_Msk           (0x40UL)                  /*!< GPIO38 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO37_Pos           (5UL)                     /*!< GPIO37 (Bit 5)                                        */
#define GPIO_INT1CLR_GPIO37_Msk           (0x20UL)                  /*!< GPIO37 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO36_Pos           (4UL)                     /*!< GPIO36 (Bit 4)                                        */
#define GPIO_INT1CLR_GPIO36_Msk           (0x10UL)                  /*!< GPIO36 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO35_Pos           (3UL)                     /*!< GPIO35 (Bit 3)                                        */
#define GPIO_INT1CLR_GPIO35_Msk           (0x8UL)                   /*!< GPIO35 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO34_Pos           (2UL)                     /*!< GPIO34 (Bit 2)                                        */
#define GPIO_INT1CLR_GPIO34_Msk           (0x4UL)                   /*!< GPIO34 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO33_Pos           (1UL)                     /*!< GPIO33 (Bit 1)                                        */
#define GPIO_INT1CLR_GPIO33_Msk           (0x2UL)                   /*!< GPIO33 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1CLR_GPIO32_Pos           (0UL)                     /*!< GPIO32 (Bit 0)                                        */
#define GPIO_INT1CLR_GPIO32_Msk           (0x1UL)                   /*!< GPIO32 (Bitfield-Mask: 0x01)                          */
/* ========================================================  INT1SET  ======================================================== */
#define GPIO_INT1SET_GPIO63_Pos           (31UL)                    /*!< GPIO63 (Bit 31)                                       */
#define GPIO_INT1SET_GPIO63_Msk           (0x80000000UL)            /*!< GPIO63 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO62_Pos           (30UL)                    /*!< GPIO62 (Bit 30)                                       */
#define GPIO_INT1SET_GPIO62_Msk           (0x40000000UL)            /*!< GPIO62 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO61_Pos           (29UL)                    /*!< GPIO61 (Bit 29)                                       */
#define GPIO_INT1SET_GPIO61_Msk           (0x20000000UL)            /*!< GPIO61 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO60_Pos           (28UL)                    /*!< GPIO60 (Bit 28)                                       */
#define GPIO_INT1SET_GPIO60_Msk           (0x10000000UL)            /*!< GPIO60 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO59_Pos           (27UL)                    /*!< GPIO59 (Bit 27)                                       */
#define GPIO_INT1SET_GPIO59_Msk           (0x8000000UL)             /*!< GPIO59 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO58_Pos           (26UL)                    /*!< GPIO58 (Bit 26)                                       */
#define GPIO_INT1SET_GPIO58_Msk           (0x4000000UL)             /*!< GPIO58 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO57_Pos           (25UL)                    /*!< GPIO57 (Bit 25)                                       */
#define GPIO_INT1SET_GPIO57_Msk           (0x2000000UL)             /*!< GPIO57 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO56_Pos           (24UL)                    /*!< GPIO56 (Bit 24)                                       */
#define GPIO_INT1SET_GPIO56_Msk           (0x1000000UL)             /*!< GPIO56 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO55_Pos           (23UL)                    /*!< GPIO55 (Bit 23)                                       */
#define GPIO_INT1SET_GPIO55_Msk           (0x800000UL)              /*!< GPIO55 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO54_Pos           (22UL)                    /*!< GPIO54 (Bit 22)                                       */
#define GPIO_INT1SET_GPIO54_Msk           (0x400000UL)              /*!< GPIO54 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO53_Pos           (21UL)                    /*!< GPIO53 (Bit 21)                                       */
#define GPIO_INT1SET_GPIO53_Msk           (0x200000UL)              /*!< GPIO53 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO52_Pos           (20UL)                    /*!< GPIO52 (Bit 20)                                       */
#define GPIO_INT1SET_GPIO52_Msk           (0x100000UL)              /*!< GPIO52 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO51_Pos           (19UL)                    /*!< GPIO51 (Bit 19)                                       */
#define GPIO_INT1SET_GPIO51_Msk           (0x80000UL)               /*!< GPIO51 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO50_Pos           (18UL)                    /*!< GPIO50 (Bit 18)                                       */
#define GPIO_INT1SET_GPIO50_Msk           (0x40000UL)               /*!< GPIO50 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO49_Pos           (17UL)                    /*!< GPIO49 (Bit 17)                                       */
#define GPIO_INT1SET_GPIO49_Msk           (0x20000UL)               /*!< GPIO49 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO48_Pos           (16UL)                    /*!< GPIO48 (Bit 16)                                       */
#define GPIO_INT1SET_GPIO48_Msk           (0x10000UL)               /*!< GPIO48 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO47_Pos           (15UL)                    /*!< GPIO47 (Bit 15)                                       */
#define GPIO_INT1SET_GPIO47_Msk           (0x8000UL)                /*!< GPIO47 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO46_Pos           (14UL)                    /*!< GPIO46 (Bit 14)                                       */
#define GPIO_INT1SET_GPIO46_Msk           (0x4000UL)                /*!< GPIO46 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO45_Pos           (13UL)                    /*!< GPIO45 (Bit 13)                                       */
#define GPIO_INT1SET_GPIO45_Msk           (0x2000UL)                /*!< GPIO45 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO44_Pos           (12UL)                    /*!< GPIO44 (Bit 12)                                       */
#define GPIO_INT1SET_GPIO44_Msk           (0x1000UL)                /*!< GPIO44 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO43_Pos           (11UL)                    /*!< GPIO43 (Bit 11)                                       */
#define GPIO_INT1SET_GPIO43_Msk           (0x800UL)                 /*!< GPIO43 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO42_Pos           (10UL)                    /*!< GPIO42 (Bit 10)                                       */
#define GPIO_INT1SET_GPIO42_Msk           (0x400UL)                 /*!< GPIO42 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO41_Pos           (9UL)                     /*!< GPIO41 (Bit 9)                                        */
#define GPIO_INT1SET_GPIO41_Msk           (0x200UL)                 /*!< GPIO41 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO40_Pos           (8UL)                     /*!< GPIO40 (Bit 8)                                        */
#define GPIO_INT1SET_GPIO40_Msk           (0x100UL)                 /*!< GPIO40 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO39_Pos           (7UL)                     /*!< GPIO39 (Bit 7)                                        */
#define GPIO_INT1SET_GPIO39_Msk           (0x80UL)                  /*!< GPIO39 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO38_Pos           (6UL)                     /*!< GPIO38 (Bit 6)                                        */
#define GPIO_INT1SET_GPIO38_Msk           (0x40UL)                  /*!< GPIO38 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO37_Pos           (5UL)                     /*!< GPIO37 (Bit 5)                                        */
#define GPIO_INT1SET_GPIO37_Msk           (0x20UL)                  /*!< GPIO37 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO36_Pos           (4UL)                     /*!< GPIO36 (Bit 4)                                        */
#define GPIO_INT1SET_GPIO36_Msk           (0x10UL)                  /*!< GPIO36 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO35_Pos           (3UL)                     /*!< GPIO35 (Bit 3)                                        */
#define GPIO_INT1SET_GPIO35_Msk           (0x8UL)                   /*!< GPIO35 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO34_Pos           (2UL)                     /*!< GPIO34 (Bit 2)                                        */
#define GPIO_INT1SET_GPIO34_Msk           (0x4UL)                   /*!< GPIO34 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO33_Pos           (1UL)                     /*!< GPIO33 (Bit 1)                                        */
#define GPIO_INT1SET_GPIO33_Msk           (0x2UL)                   /*!< GPIO33 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT1SET_GPIO32_Pos           (0UL)                     /*!< GPIO32 (Bit 0)                                        */
#define GPIO_INT1SET_GPIO32_Msk           (0x1UL)                   /*!< GPIO32 (Bitfield-Mask: 0x01)                          */
/* ========================================================  INT2EN  ========================================================= */
#define GPIO_INT2EN_GPIO73_Pos            (9UL)                     /*!< GPIO73 (Bit 9)                                        */
#define GPIO_INT2EN_GPIO73_Msk            (0x200UL)                 /*!< GPIO73 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO72_Pos            (8UL)                     /*!< GPIO72 (Bit 8)                                        */
#define GPIO_INT2EN_GPIO72_Msk            (0x100UL)                 /*!< GPIO72 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO71_Pos            (7UL)                     /*!< GPIO71 (Bit 7)                                        */
#define GPIO_INT2EN_GPIO71_Msk            (0x80UL)                  /*!< GPIO71 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO70_Pos            (6UL)                     /*!< GPIO70 (Bit 6)                                        */
#define GPIO_INT2EN_GPIO70_Msk            (0x40UL)                  /*!< GPIO70 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO69_Pos            (5UL)                     /*!< GPIO69 (Bit 5)                                        */
#define GPIO_INT2EN_GPIO69_Msk            (0x20UL)                  /*!< GPIO69 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO68_Pos            (4UL)                     /*!< GPIO68 (Bit 4)                                        */
#define GPIO_INT2EN_GPIO68_Msk            (0x10UL)                  /*!< GPIO68 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO67_Pos            (3UL)                     /*!< GPIO67 (Bit 3)                                        */
#define GPIO_INT2EN_GPIO67_Msk            (0x8UL)                   /*!< GPIO67 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO66_Pos            (2UL)                     /*!< GPIO66 (Bit 2)                                        */
#define GPIO_INT2EN_GPIO66_Msk            (0x4UL)                   /*!< GPIO66 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO65_Pos            (1UL)                     /*!< GPIO65 (Bit 1)                                        */
#define GPIO_INT2EN_GPIO65_Msk            (0x2UL)                   /*!< GPIO65 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2EN_GPIO64_Pos            (0UL)                     /*!< GPIO64 (Bit 0)                                        */
#define GPIO_INT2EN_GPIO64_Msk            (0x1UL)                   /*!< GPIO64 (Bitfield-Mask: 0x01)                          */
/* =======================================================  INT2STAT  ======================================================== */
#define GPIO_INT2STAT_GPIO73_Pos          (9UL)                     /*!< GPIO73 (Bit 9)                                        */
#define GPIO_INT2STAT_GPIO73_Msk          (0x200UL)                 /*!< GPIO73 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO72_Pos          (8UL)                     /*!< GPIO72 (Bit 8)                                        */
#define GPIO_INT2STAT_GPIO72_Msk          (0x100UL)                 /*!< GPIO72 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO71_Pos          (7UL)                     /*!< GPIO71 (Bit 7)                                        */
#define GPIO_INT2STAT_GPIO71_Msk          (0x80UL)                  /*!< GPIO71 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO70_Pos          (6UL)                     /*!< GPIO70 (Bit 6)                                        */
#define GPIO_INT2STAT_GPIO70_Msk          (0x40UL)                  /*!< GPIO70 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO69_Pos          (5UL)                     /*!< GPIO69 (Bit 5)                                        */
#define GPIO_INT2STAT_GPIO69_Msk          (0x20UL)                  /*!< GPIO69 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO68_Pos          (4UL)                     /*!< GPIO68 (Bit 4)                                        */
#define GPIO_INT2STAT_GPIO68_Msk          (0x10UL)                  /*!< GPIO68 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO67_Pos          (3UL)                     /*!< GPIO67 (Bit 3)                                        */
#define GPIO_INT2STAT_GPIO67_Msk          (0x8UL)                   /*!< GPIO67 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO66_Pos          (2UL)                     /*!< GPIO66 (Bit 2)                                        */
#define GPIO_INT2STAT_GPIO66_Msk          (0x4UL)                   /*!< GPIO66 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO65_Pos          (1UL)                     /*!< GPIO65 (Bit 1)                                        */
#define GPIO_INT2STAT_GPIO65_Msk          (0x2UL)                   /*!< GPIO65 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2STAT_GPIO64_Pos          (0UL)                     /*!< GPIO64 (Bit 0)                                        */
#define GPIO_INT2STAT_GPIO64_Msk          (0x1UL)                   /*!< GPIO64 (Bitfield-Mask: 0x01)                          */
/* ========================================================  INT2CLR  ======================================================== */
#define GPIO_INT2CLR_GPIO73_Pos           (9UL)                     /*!< GPIO73 (Bit 9)                                        */
#define GPIO_INT2CLR_GPIO73_Msk           (0x200UL)                 /*!< GPIO73 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO72_Pos           (8UL)                     /*!< GPIO72 (Bit 8)                                        */
#define GPIO_INT2CLR_GPIO72_Msk           (0x100UL)                 /*!< GPIO72 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO71_Pos           (7UL)                     /*!< GPIO71 (Bit 7)                                        */
#define GPIO_INT2CLR_GPIO71_Msk           (0x80UL)                  /*!< GPIO71 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO70_Pos           (6UL)                     /*!< GPIO70 (Bit 6)                                        */
#define GPIO_INT2CLR_GPIO70_Msk           (0x40UL)                  /*!< GPIO70 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO69_Pos           (5UL)                     /*!< GPIO69 (Bit 5)                                        */
#define GPIO_INT2CLR_GPIO69_Msk           (0x20UL)                  /*!< GPIO69 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO68_Pos           (4UL)                     /*!< GPIO68 (Bit 4)                                        */
#define GPIO_INT2CLR_GPIO68_Msk           (0x10UL)                  /*!< GPIO68 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO67_Pos           (3UL)                     /*!< GPIO67 (Bit 3)                                        */
#define GPIO_INT2CLR_GPIO67_Msk           (0x8UL)                   /*!< GPIO67 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO66_Pos           (2UL)                     /*!< GPIO66 (Bit 2)                                        */
#define GPIO_INT2CLR_GPIO66_Msk           (0x4UL)                   /*!< GPIO66 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO65_Pos           (1UL)                     /*!< GPIO65 (Bit 1)                                        */
#define GPIO_INT2CLR_GPIO65_Msk           (0x2UL)                   /*!< GPIO65 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2CLR_GPIO64_Pos           (0UL)                     /*!< GPIO64 (Bit 0)                                        */
#define GPIO_INT2CLR_GPIO64_Msk           (0x1UL)                   /*!< GPIO64 (Bitfield-Mask: 0x01)                          */
/* ========================================================  INT2SET  ======================================================== */
#define GPIO_INT2SET_GPIO73_Pos           (9UL)                     /*!< GPIO73 (Bit 9)                                        */
#define GPIO_INT2SET_GPIO73_Msk           (0x200UL)                 /*!< GPIO73 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO72_Pos           (8UL)                     /*!< GPIO72 (Bit 8)                                        */
#define GPIO_INT2SET_GPIO72_Msk           (0x100UL)                 /*!< GPIO72 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO71_Pos           (7UL)                     /*!< GPIO71 (Bit 7)                                        */
#define GPIO_INT2SET_GPIO71_Msk           (0x80UL)                  /*!< GPIO71 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO70_Pos           (6UL)                     /*!< GPIO70 (Bit 6)                                        */
#define GPIO_INT2SET_GPIO70_Msk           (0x40UL)                  /*!< GPIO70 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO69_Pos           (5UL)                     /*!< GPIO69 (Bit 5)                                        */
#define GPIO_INT2SET_GPIO69_Msk           (0x20UL)                  /*!< GPIO69 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO68_Pos           (4UL)                     /*!< GPIO68 (Bit 4)                                        */
#define GPIO_INT2SET_GPIO68_Msk           (0x10UL)                  /*!< GPIO68 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO67_Pos           (3UL)                     /*!< GPIO67 (Bit 3)                                        */
#define GPIO_INT2SET_GPIO67_Msk           (0x8UL)                   /*!< GPIO67 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO66_Pos           (2UL)                     /*!< GPIO66 (Bit 2)                                        */
#define GPIO_INT2SET_GPIO66_Msk           (0x4UL)                   /*!< GPIO66 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO65_Pos           (1UL)                     /*!< GPIO65 (Bit 1)                                        */
#define GPIO_INT2SET_GPIO65_Msk           (0x2UL)                   /*!< GPIO65 (Bitfield-Mask: 0x01)                          */
#define GPIO_INT2SET_GPIO64_Pos           (0UL)                     /*!< GPIO64 (Bit 0)                                        */
#define GPIO_INT2SET_GPIO64_Msk           (0x1UL)                   /*!< GPIO64 (Bitfield-Mask: 0x01)                          */
/* ========================================================  DBGCTRL  ======================================================== */
#define GPIO_DBGCTRL_GCLK5_Pos            (5UL)                     /*!< GCLK5 (Bit 5)                                         */
#define GPIO_DBGCTRL_GCLK5_Msk            (0x20UL)                  /*!< GCLK5 (Bitfield-Mask: 0x01)                           */
#define GPIO_DBGCTRL_GCLK4_Pos            (4UL)                     /*!< GCLK4 (Bit 4)                                         */
#define GPIO_DBGCTRL_GCLK4_Msk            (0x10UL)                  /*!< GCLK4 (Bitfield-Mask: 0x01)                           */
#define GPIO_DBGCTRL_GCLK3_Pos            (3UL)                     /*!< GCLK3 (Bit 3)                                         */
#define GPIO_DBGCTRL_GCLK3_Msk            (0x8UL)                   /*!< GCLK3 (Bitfield-Mask: 0x01)                           */
#define GPIO_DBGCTRL_GCLK2_Pos            (2UL)                     /*!< GCLK2 (Bit 2)                                         */
#define GPIO_DBGCTRL_GCLK2_Msk            (0x4UL)                   /*!< GCLK2 (Bitfield-Mask: 0x01)                           */
#define GPIO_DBGCTRL_GCLK1_Pos            (1UL)                     /*!< GCLK1 (Bit 1)                                         */
#define GPIO_DBGCTRL_GCLK1_Msk            (0x2UL)                   /*!< GCLK1 (Bitfield-Mask: 0x01)                           */
#define GPIO_DBGCTRL_GCLK0_Pos            (0UL)                     /*!< GCLK0 (Bit 0)                                         */
#define GPIO_DBGCTRL_GCLK0_Msk            (0x1UL)                   /*!< GCLK0 (Bitfield-Mask: 0x01)                           */


