TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ========================================================  CHIPPN  ========================================================= */
#define MCUCTRL_CHIPPN_PARTNUM_Pos        (0UL)                     /*!< PARTNUM (Bit 0)                                       */
#define MCUCTRL_CHIPPN_PARTNUM_Msk        (0xffffffffUL)            /*!< PARTNUM (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPID0  ======================================================== */
#define MCUCTRL_CHIPID0_CHIPID0_Pos       (0UL)                     /*!< CHIPID0 (Bit 0)                                       */
#define MCUCTRL_CHIPID0_CHIPID0_Msk       (0xffffffffUL)            /*!< CHIPID0 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPID1  ======================================================== */
#define MCUCTRL_CHIPID1_CHIPID1_Pos       (0UL)                     /*!< CHIPID1 (Bit 0)                                       */
#define MCUCTRL_CHIPID1_CHIPID1_Msk       (0xffffffffUL)            /*!< CHIPID1 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPREV  ======================================================== */
#define MCUCTRL_CHIPREV_SIPART_Pos        (8UL)                     /*!< SIPART (Bit 8)                                        */
#define MCUCTRL_CHIPREV_SIPART_Msk        (0xfff00UL)               /*!< SIPART (Bitfield-Mask: 0xfff)                         */
#define MCUCTRL_CHIPREV_REVMAJ_Pos        (4UL)                     /*!< REVMAJ (Bit 4)                                        */
#define MCUCTRL_CHIPREV_REVMAJ_Msk        (0xf0UL)                  /*!< REVMAJ (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPREV_REVMIN_Pos        (0UL)                     /*!< REVMIN (Bit 0)                                        */
#define MCUCTRL_CHIPREV_REVMIN_Msk        (0xfUL)                   /*!< REVMIN (Bitfield-Mask: 0x0f)                          */
/* =======================================================  VENDORID  ======================================================== */
#define MCUCTRL_VENDORID_VENDORID_Pos     (0UL)                     /*!< VENDORID (Bit 0)                                      */
#define MCUCTRL_VENDORID_VENDORID_Msk     (0xffffffffUL)            /*!< VENDORID (Bitfield-Mask: 0xffffffff)                  */
/* ==========================================================  SKU  ========================================================== */
#define MCUCTRL_SKU_SECBOOT_Pos           (2UL)                     /*!< SECBOOT (Bit 2)                                       */
#define MCUCTRL_SKU_SECBOOT_Msk           (0x4UL)                   /*!< SECBOOT (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_SKU_ALLOWBLE_Pos          (1UL)                     /*!< ALLOWBLE (Bit 1)                                      */
#define MCUCTRL_SKU_ALLOWBLE_Msk          (0x2UL)                   /*!< ALLOWBLE (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SKU_ALLOWBURST_Pos        (0UL)                     /*!< ALLOWBURST (Bit 0)                                    */
#define MCUCTRL_SKU_ALLOWBURST_Msk        (0x1UL)                   /*!< ALLOWBURST (Bitfield-Mask: 0x01)                      */
/* =====================================================  FEATUREENABLE  ===================================================== */
#define MCUCTRL_FEATUREENABLE_BURSTAVAIL_Pos (6UL)                  /*!< BURSTAVAIL (Bit 6)                                    */
#define MCUCTRL_FEATUREENABLE_BURSTAVAIL_Msk (0x40UL)               /*!< BURSTAVAIL (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_FEATUREENABLE_BURSTACK_Pos (5UL)                    /*!< BURSTACK (Bit 5)                                      */
#define MCUCTRL_FEATUREENABLE_BURSTACK_Msk (0x20UL)                 /*!< BURSTACK (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_FEATUREENABLE_BURSTREQ_Pos (4UL)                    /*!< BURSTREQ (Bit 4)                                      */
#define MCUCTRL_FEATUREENABLE_BURSTREQ_Msk (0x10UL)                 /*!< BURSTREQ (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_FEATUREENABLE_BLEAVAIL_Pos (2UL)                    /*!< BLEAVAIL (Bit 2)                                      */
#define MCUCTRL_FEATUREENABLE_BLEAVAIL_Msk (0x4UL)                  /*!< BLEAVAIL (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_FEATUREENABLE_BLEACK_Pos  (1UL)                     /*!< BLEACK (Bit 1)                                        */
#define MCUCTRL_FEATUREENABLE_BLEACK_Msk  (0x2UL)                   /*!< BLEACK (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_FEATUREENABLE_BLEREQ_Pos  (0UL)                     /*!< BLEREQ (Bit 0)                                        */
#define MCUCTRL_FEATUREENABLE_BLEREQ_Msk  (0x1UL)                   /*!< BLEREQ (Bitfield-Mask: 0x01)                          */
/* =======================================================  DEBUGGER  ======================================================== */
#define MCUCTRL_DEBUGGER_LOCKOUT_Pos      (0UL)                     /*!< LOCKOUT (Bit 0)                                       */
#define MCUCTRL_DEBUGGER_LOCKOUT_Msk      (0x1UL)                   /*!< LOCKOUT (Bitfield-Mask: 0x01)                         */
/* =================================================  DMASRAMWRITEPROTECT2  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT2_DMA_WPROT2_Pos (0UL)           /*!< DMA_WPROT2 (Bit 0)                                    */
#define MCUCTRL_DMASRAMWRITEPROTECT2_DMA_WPROT2_Msk (0xffffffffUL)  /*!< DMA_WPROT2 (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  ADCPWRDLY  ======================================================= */
#define MCUCTRL_ADCPWRDLY_ADCPWR1_Pos     (8UL)                     /*!< ADCPWR1 (Bit 8)                                       */
#define MCUCTRL_ADCPWRDLY_ADCPWR1_Msk     (0xff00UL)                /*!< ADCPWR1 (Bitfield-Mask: 0xff)                         */
#define MCUCTRL_ADCPWRDLY_ADCPWR0_Pos     (0UL)                     /*!< ADCPWR0 (Bit 0)                                       */
#define MCUCTRL_ADCPWRDLY_ADCPWR0_Msk     (0xffUL)                  /*!< ADCPWR0 (Bitfield-Mask: 0xff)                         */
/* ========================================================  ADCCAL  ========================================================= */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Pos  (1UL)                     /*!< ADCCALIBRATED (Bit 1)                                 */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Msk  (0x2UL)                   /*!< ADCCALIBRATED (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_ADCCAL_CALONPWRUP_Pos     (0UL)                     /*!< CALONPWRUP (Bit 0)                                    */
#define MCUCTRL_ADCCAL_CALONPWRUP_Msk     (0x1UL)                   /*!< CALONPWRUP (Bitfield-Mask: 0x01)                      */
/* ======================================================  ADCBATTLOAD  ====================================================== */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Pos  (0UL)                     /*!< BATTLOAD (Bit 0)                                      */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Msk  (0x1UL)                   /*!< BATTLOAD (Bitfield-Mask: 0x01)                        */
/* ========================================================  ADCTRIM  ======================================================== */
#define MCUCTRL_ADCTRIM_ADCRFBUFIBTRIM_Pos (11UL)                   /*!< ADCRFBUFIBTRIM (Bit 11)                               */
#define MCUCTRL_ADCTRIM_ADCRFBUFIBTRIM_Msk (0x1800UL)               /*!< ADCRFBUFIBTRIM (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_ADCTRIM_ADCREFBUFTRIM_Pos (6UL)                     /*!< ADCREFBUFTRIM (Bit 6)                                 */
#define MCUCTRL_ADCTRIM_ADCREFBUFTRIM_Msk (0x7c0UL)                 /*!< ADCREFBUFTRIM (Bitfield-Mask: 0x1f)                   */
#define MCUCTRL_ADCTRIM_ADCREFKEEPIBTRIM_Pos (0UL)                  /*!< ADCREFKEEPIBTRIM (Bit 0)                              */
#define MCUCTRL_ADCTRIM_ADCREFKEEPIBTRIM_Msk (0x3UL)                /*!< ADCREFKEEPIBTRIM (Bitfield-Mask: 0x03)                */
/* ======================================================  ADCREFCOMP  ======================================================= */
#define MCUCTRL_ADCREFCOMP_ADCRFCMPEN_Pos (16UL)                    /*!< ADCRFCMPEN (Bit 16)                                   */
#define MCUCTRL_ADCREFCOMP_ADCRFCMPEN_Msk (0x10000UL)               /*!< ADCRFCMPEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_ADCREFCOMP_ADCREFKEEPTRIM_Pos (8UL)                 /*!< ADCREFKEEPTRIM (Bit 8)                                */
#define MCUCTRL_ADCREFCOMP_ADCREFKEEPTRIM_Msk (0x1f00UL)            /*!< ADCREFKEEPTRIM (Bitfield-Mask: 0x1f)                  */
#define MCUCTRL_ADCREFCOMP_ADC_REFCOMP_OUT_Pos (0UL)                /*!< ADC_REFCOMP_OUT (Bit 0)                               */
#define MCUCTRL_ADCREFCOMP_ADC_REFCOMP_OUT_Msk (0x1UL)              /*!< ADC_REFCOMP_OUT (Bitfield-Mask: 0x01)                 */
/* =======================================================  XTALCTRL  ======================================================== */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Pos (8UL)                    /*!< XTALICOMPTRIM (Bit 8)                                 */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Msk (0x300UL)                /*!< XTALICOMPTRIM (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Pos (6UL)                     /*!< XTALIBUFTRIM (Bit 6)                                  */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Msk (0xc0UL)                  /*!< XTALIBUFTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_XTALCTRL_PWDBODXTAL_Pos   (5UL)                     /*!< PWDBODXTAL (Bit 5)                                    */
#define MCUCTRL_XTALCTRL_PWDBODXTAL_Msk   (0x20UL)                  /*!< PWDBODXTAL (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_XTALCTRL_PDNBCMPRXTAL_Pos (4UL)                     /*!< PDNBCMPRXTAL (Bit 4)                                  */
#define MCUCTRL_XTALCTRL_PDNBCMPRXTAL_Msk (0x10UL)                  /*!< PDNBCMPRXTAL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_XTALCTRL_PDNBCOREXTAL_Pos (3UL)                     /*!< PDNBCOREXTAL (Bit 3)                                  */
#define MCUCTRL_XTALCTRL_PDNBCOREXTAL_Msk (0x8UL)                   /*!< PDNBCOREXTAL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_XTALCTRL_BYPCMPRXTAL_Pos  (2UL)                     /*!< BYPCMPRXTAL (Bit 2)                                   */
#define MCUCTRL_XTALCTRL_BYPCMPRXTAL_Msk  (0x4UL)                   /*!< BYPCMPRXTAL (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_XTALCTRL_FDBKDSBLXTAL_Pos (1UL)                     /*!< FDBKDSBLXTAL (Bit 1)                                  */
#define MCUCTRL_XTALCTRL_FDBKDSBLXTAL_Msk (0x2UL)                   /*!< FDBKDSBLXTAL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_XTALCTRL_XTALSWE_Pos      (0UL)                     /*!< XTALSWE (Bit 0)                                       */
#define MCUCTRL_XTALCTRL_XTALSWE_Msk      (0x1UL)                   /*!< XTALSWE (Bitfield-Mask: 0x01)                         */
/* ======================================================  XTALGENCTRL  ====================================================== */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Pos (8UL)                /*!< XTALKSBIASTRIM (Bit 8)                                */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Msk (0x3f00UL)           /*!< XTALKSBIASTRIM (Bitfield-Mask: 0x3f)                  */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Pos (2UL)                  /*!< XTALBIASTRIM (Bit 2)                                  */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Msk (0xfcUL)               /*!< XTALBIASTRIM (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Pos  (0UL)                     /*!< ACWARMUP (Bit 0)                                      */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Msk  (0x3UL)                   /*!< ACWARMUP (Bitfield-Mask: 0x03)                        */
/* =======================================================  MISCCTRL  ======================================================== */
#define MCUCTRL_MISCCTRL_BLE_RESETN_Pos   (5UL)                     /*!< BLE_RESETN (Bit 5)                                    */
#define MCUCTRL_MISCCTRL_BLE_RESETN_Msk   (0x20UL)                  /*!< BLE_RESETN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_MISCCTRL_RESERVED_RW_0_Pos (0UL)                    /*!< RESERVED_RW_0 (Bit 0)                                 */
#define MCUCTRL_MISCCTRL_RESERVED_RW_0_Msk (0x1fUL)                 /*!< RESERVED_RW_0 (Bitfield-Mask: 0x1f)                   */
/* ======================================================  BOOTLOADER  ======================================================= */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Pos (30UL)                  /*!< SECBOOTONRST (Bit 30)                                 */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Msk (0xc0000000UL)          /*!< SECBOOTONRST (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_BOOTLOADER_SECBOOT_Pos    (28UL)                    /*!< SECBOOT (Bit 28)                                      */
#define MCUCTRL_BOOTLOADER_SECBOOT_Msk    (0x30000000UL)            /*!< SECBOOT (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Pos (26UL)                /*!< SECBOOTFEATURE (Bit 26)                               */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Msk (0xc000000UL)         /*!< SECBOOTFEATURE (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Pos   (2UL)                     /*!< PROTLOCK (Bit 2)                                      */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Msk   (0x4UL)                   /*!< PROTLOCK (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_BOOTLOADER_SBLOCK_Pos     (1UL)                     /*!< SBLOCK (Bit 1)                                        */
#define MCUCTRL_BOOTLOADER_SBLOCK_Msk     (0x2UL)                   /*!< SBLOCK (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_BOOTLOADER_BOOTLOADERLOW_Pos (0UL)                  /*!< BOOTLOADERLOW (Bit 0)                                 */
#define MCUCTRL_BOOTLOADER_BOOTLOADERLOW_Msk (0x1UL)                /*!< BOOTLOADERLOW (Bitfield-Mask: 0x01)                   */
/* ======================================================  SHADOWVALID  ====================================================== */
#define MCUCTRL_SHADOWVALID_INFO0_VALID_Pos (2UL)                   /*!< INFO0_VALID (Bit 2)                                   */
#define MCUCTRL_SHADOWVALID_INFO0_VALID_Msk (0x4UL)                 /*!< INFO0_VALID (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_BLDSLEEP_Pos  (1UL)                     /*!< BLDSLEEP (Bit 1)                                      */
#define MCUCTRL_SHADOWVALID_BLDSLEEP_Msk  (0x2UL)                   /*!< BLDSLEEP (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SHADOWVALID_VALID_Pos     (0UL)                     /*!< VALID (Bit 0)                                         */
#define MCUCTRL_SHADOWVALID_VALID_Msk     (0x1UL)                   /*!< VALID (Bitfield-Mask: 0x01)                           */
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< SCRATCH0 (Bit 0)                                      */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< SCRATCH0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< SCRATCH1 (Bit 0)                                      */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< SCRATCH1 (Bitfield-Mask: 0xffffffff)                  */
/* ====================================================  ICODEFAULTADDR  ===================================================== */
#define MCUCTRL_ICODEFAULTADDR_ICODEFAULTADDR_Pos (0UL)             /*!< ICODEFAULTADDR (Bit 0)                                */
#define MCUCTRL_ICODEFAULTADDR_ICODEFAULTADDR_Msk (0xffffffffUL)    /*!< ICODEFAULTADDR (Bitfield-Mask: 0xffffffff)            */
/* ====================================================  DCODEFAULTADDR  ===================================================== */
#define MCUCTRL_DCODEFAULTADDR_DCODEFAULTADDR_Pos (0UL)             /*!< DCODEFAULTADDR (Bit 0)                                */
#define MCUCTRL_DCODEFAULTADDR_DCODEFAULTADDR_Msk (0xffffffffUL)    /*!< DCODEFAULTADDR (Bitfield-Mask: 0xffffffff)            */
/* =====================================================  SYSFAULTADDR  ====================================================== */
#define MCUCTRL_SYSFAULTADDR_SYSFAULTADDR_Pos (0UL)                 /*!< SYSFAULTADDR (Bit 0)                                  */
#define MCUCTRL_SYSFAULTADDR_SYSFAULTADDR_Msk (0xffffffffUL)        /*!< SYSFAULTADDR (Bitfield-Mask: 0xffffffff)              */
/* ======================================================  FAULTSTATUS  ====================================================== */
#define MCUCTRL_FAULTSTATUS_SYSFAULT_Pos  (2UL)                     /*!< SYSFAULT (Bit 2)                                      */
#define MCUCTRL_FAULTSTATUS_SYSFAULT_Msk  (0x4UL)                   /*!< SYSFAULT (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_FAULTSTATUS_DCODEFAULT_Pos (1UL)                    /*!< DCODEFAULT (Bit 1)                                    */
#define MCUCTRL_FAULTSTATUS_DCODEFAULT_Msk (0x2UL)                  /*!< DCODEFAULT (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_FAULTSTATUS_ICODEFAULT_Pos (0UL)                    /*!< ICODEFAULT (Bit 0)                                    */
#define MCUCTRL_FAULTSTATUS_ICODEFAULT_Msk (0x1UL)                  /*!< ICODEFAULT (Bitfield-Mask: 0x01)                      */
/* ====================================================  FAULTCAPTUREEN  ===================================================== */
#define MCUCTRL_FAULTCAPTUREEN_FAULTCAPTUREEN_Pos (0UL)             /*!< FAULTCAPTUREEN (Bit 0)                                */
#define MCUCTRL_FAULTCAPTUREEN_FAULTCAPTUREEN_Msk (0x1UL)           /*!< FAULTCAPTUREEN (Bitfield-Mask: 0x01)                  */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< ONETO8 (Bit 0)                                        */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< ONETO8 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< COOLCODE (Bit 0)                                      */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< COOLCODE (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  PMUENABLE  ======================================================= */
#define MCUCTRL_PMUENABLE_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MCUCTRL_PMUENABLE_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =======================================================  TPIUCTRL  ======================================================== */
#define MCUCTRL_TPIUCTRL_CLKSEL_Pos       (8UL)                     /*!< CLKSEL (Bit 8)                                        */
#define MCUCTRL_TPIUCTRL_CLKSEL_Msk       (0x700UL)                 /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define MCUCTRL_TPIUCTRL_ENABLE_Pos       (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MCUCTRL_TPIUCTRL_ENABLE_Msk       (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (2UL)                     /*!< OTAPOINTER (Bit 2)                                    */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffffcUL)            /*!< OTAPOINTER (Bitfield-Mask: 0x3fffffff)                */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Pos (1UL)                   /*!< OTASBLUPDATE (Bit 1)                                  */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Msk (0x2UL)                 /*!< OTASBLUPDATE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< OTAVALID (Bit 0)                                      */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< OTAVALID (Bitfield-Mask: 0x01)                        */
/* =======================================================  SRAMMODE  ======================================================== */
#define MCUCTRL_SRAMMODE_DPREFETCH_CACHE_Pos (5UL)                  /*!< DPREFETCH_CACHE (Bit 5)                               */
#define MCUCTRL_SRAMMODE_DPREFETCH_CACHE_Msk (0x20UL)               /*!< DPREFETCH_CACHE (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SRAMMODE_DPREFETCH_Pos    (4UL)                     /*!< DPREFETCH (Bit 4)                                     */
#define MCUCTRL_SRAMMODE_DPREFETCH_Msk    (0x10UL)                  /*!< DPREFETCH (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SRAMMODE_IPREFETCH_CACHE_Pos (1UL)                  /*!< IPREFETCH_CACHE (Bit 1)                               */
#define MCUCTRL_SRAMMODE_IPREFETCH_CACHE_Msk (0x2UL)                /*!< IPREFETCH_CACHE (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SRAMMODE_IPREFETCH_Pos    (0UL)                     /*!< IPREFETCH (Bit 0)                                     */
#define MCUCTRL_SRAMMODE_IPREFETCH_Msk    (0x1UL)                   /*!< IPREFETCH (Bitfield-Mask: 0x01)                       */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_RESERVED_RW_24_Pos (24UL)                 /*!< RESERVED_RW_24 (Bit 24)                               */
#define MCUCTRL_SIMOBUCK2_RESERVED_RW_24_Msk (0xff000000UL)         /*!< RESERVED_RW_24 (Bitfield-Mask: 0xff)                  */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKCORELPLOWTONTRIM_Pos (20UL)       /*!< SIMOBUCKCORELPLOWTONTRIM (Bit 20)                     */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKCORELPLOWTONTRIM_Msk (0xf00000UL) /*!< SIMOBUCKCORELPLOWTONTRIM (Bitfield-Mask: 0x0f)        */
