TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
#define MCUCTRL_SIMOBUCK2_SIMOBUCKCORELPHIGHTONTRIM_Pos (16UL)      /*!< SIMOBUCKCORELPHIGHTONTRIM (Bit 16)                    */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKCORELPHIGHTONTRIM_Msk (0xf0000UL) /*!< SIMOBUCKCORELPHIGHTONTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK2_RESERVED_RW_0_Pos (0UL)                   /*!< RESERVED_RW_0 (Bit 0)                                 */
#define MCUCTRL_SIMOBUCK2_RESERVED_RW_0_Msk (0xffffUL)              /*!< RESERVED_RW_0 (Bitfield-Mask: 0xffff)                 */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_RESERVED_RW_31_Pos (31UL)                 /*!< RESERVED_RW_31 (Bit 31)                               */
#define MCUCTRL_SIMOBUCK3_RESERVED_RW_31_Msk (0x80000000UL)         /*!< RESERVED_RW_31 (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPHIGHTONTRIM_Pos (27UL)       /*!< SIMOBUCKMEMLPHIGHTONTRIM (Bit 27)                     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPHIGHTONTRIM_Msk (0x78000000UL) /*!< SIMOBUCKMEMLPHIGHTONTRIM (Bitfield-Mask: 0x0f)      */
#define MCUCTRL_SIMOBUCK3_RESERVED_RW_16_Pos (16UL)                 /*!< RESERVED_RW_16 (Bit 16)                               */
#define MCUCTRL_SIMOBUCK3_RESERVED_RW_16_Msk (0x7ff0000UL)          /*!< RESERVED_RW_16 (Bitfield-Mask: 0x7ff)                 */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPLOWTOFFTRIM_Pos (12UL)       /*!< SIMOBUCKMEMLPLOWTOFFTRIM (Bit 12)                     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPLOWTOFFTRIM_Msk (0xf000UL)   /*!< SIMOBUCKMEMLPLOWTOFFTRIM (Bitfield-Mask: 0x0f)        */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPHIGHTOFFTRIM_Pos (8UL)       /*!< SIMOBUCKMEMLPHIGHTOFFTRIM (Bit 8)                     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKMEMLPHIGHTOFFTRIM_Msk (0xf00UL)   /*!< SIMOBUCKMEMLPHIGHTOFFTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKCORELPLOWTOFFTRIM_Pos (4UL)       /*!< SIMOBUCKCORELPLOWTOFFTRIM (Bit 4)                     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKCORELPLOWTOFFTRIM_Msk (0xf0UL)    /*!< SIMOBUCKCORELPLOWTOFFTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKCORELPHIGHTOFFTRIM_Pos (0UL)      /*!< SIMOBUCKCORELPHIGHTOFFTRIM (Bit 0)                    */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKCORELPHIGHTOFFTRIM_Msk (0xfUL)    /*!< SIMOBUCKCORELPHIGHTOFFTRIM (Bitfield-Mask: 0x0f)      */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2TIMEOUTEN_Pos (24UL)         /*!< SIMOBUCKCOMP2TIMEOUTEN (Bit 24)                       */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2TIMEOUTEN_Msk (0x1000000UL)  /*!< SIMOBUCKCOMP2TIMEOUTEN (Bitfield-Mask: 0x01)          */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCLKDIVSEL_Pos (21UL)              /*!< SIMOBUCKCLKDIVSEL (Bit 21)                            */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCLKDIVSEL_Msk (0x600000UL)        /*!< SIMOBUCKCLKDIVSEL (Bitfield-Mask: 0x03)               */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPLOWTONTRIM_Pos (0UL)         /*!< SIMOBUCKMEMLPLOWTONTRIM (Bit 0)                       */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPLOWTONTRIM_Msk (0xfUL)       /*!< SIMOBUCKMEMLPLOWTONTRIM (Bitfield-Mask: 0x0f)         */
/* =======================================================  BLEBUCK2  ======================================================== */
#define MCUCTRL_BLEBUCK2_BLEBUCKTOND2ATRIM_Pos (12UL)               /*!< BLEBUCKTOND2ATRIM (Bit 12)                            */
#define MCUCTRL_BLEBUCK2_BLEBUCKTOND2ATRIM_Msk (0x3f000UL)          /*!< BLEBUCKTOND2ATRIM (Bitfield-Mask: 0x3f)               */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONHITRIM_Pos (6UL)                 /*!< BLEBUCKTONHITRIM (Bit 6)                              */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONHITRIM_Msk (0xfc0UL)             /*!< BLEBUCKTONHITRIM (Bitfield-Mask: 0x3f)                */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONLOWTRIM_Pos (0UL)                /*!< BLEBUCKTONLOWTRIM (Bit 0)                             */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONLOWTRIM_Msk (0x3fUL)             /*!< BLEBUCKTONLOWTRIM (Bitfield-Mask: 0x3f)               */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< FW0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< FW0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< FW1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< FW1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT2  ====================================================== */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Pos   (0UL)                     /*!< FW2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Msk   (0xffffffffUL)            /*!< FW2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT3  ====================================================== */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Pos   (0UL)                     /*!< FW3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Msk   (0xffffffffUL)            /*!< FW3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< FR0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< FR0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< FR1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< FR1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT2  ====================================================== */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Pos   (0UL)                     /*!< FR2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Msk   (0xffffffffUL)            /*!< FR2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT3  ====================================================== */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Pos   (0UL)                     /*!< FR3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Msk   (0xffffffffUL)            /*!< FR3BITS (Bitfield-Mask: 0xffffffff)                   */
/* =================================================  DMASRAMWRITEPROTECT0  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT0_DMA_WPROT0_Pos (0UL)           /*!< DMA_WPROT0 (Bit 0)                                    */
#define MCUCTRL_DMASRAMWRITEPROTECT0_DMA_WPROT0_Msk (0xffffffffUL)  /*!< DMA_WPROT0 (Bitfield-Mask: 0xffffffff)                */
/* =================================================  DMASRAMWRITEPROTECT1  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT1_DMA_WPROT1_Pos (0UL)           /*!< DMA_WPROT1 (Bit 0)                                    */
#define MCUCTRL_DMASRAMWRITEPROTECT1_DMA_WPROT1_Msk (0xffffffffUL)  /*!< DMA_WPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ==================================================  DMASRAMREADPROTECT0  ================================================== */
#define MCUCTRL_DMASRAMREADPROTECT0_DMA_RPROT0_Pos (0UL)            /*!< DMA_RPROT0 (Bit 0)                                    */
#define MCUCTRL_DMASRAMREADPROTECT0_DMA_RPROT0_Msk (0xffffffffUL)   /*!< DMA_RPROT0 (Bitfield-Mask: 0xffffffff)                */
/* ==================================================  DMASRAMREADPROTECT1  ================================================== */
#define MCUCTRL_DMASRAMREADPROTECT1_DMA_RPROT1_Pos (0UL)            /*!< DMA_RPROT1 (Bit 0)                                    */
#define MCUCTRL_DMASRAMREADPROTECT1_DMA_RPROT1_Msk (0xffffffffUL)   /*!< DMA_RPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ==================================================  DMASRAMREADPROTECT2  ================================================== */
#define MCUCTRL_DMASRAMREADPROTECT2_DMA_RPROT2_Pos (0UL)            /*!< DMA_RPROT2 (Bit 0)                                    */
#define MCUCTRL_DMASRAMREADPROTECT2_DMA_RPROT2_Msk (0xffffffffUL)   /*!< DMA_RPROT2 (Bitfield-Mask: 0xffffffff)                */


/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

