TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =========================================================  CTRL  ========================================================== */
#define MSPI0_CTRL_XFERBYTES_Pos          (16UL)                    /*!< XFERBYTES (Bit 16)                                    */
#define MSPI0_CTRL_XFERBYTES_Msk          (0xffff0000UL)            /*!< XFERBYTES (Bitfield-Mask: 0xffff)                     */
#define MSPI0_CTRL_ENDCX_Pos              (12UL)                    /*!< ENDCX (Bit 12)                                        */
#define MSPI0_CTRL_ENDCX_Msk              (0x1000UL)                /*!< ENDCX (Bitfield-Mask: 0x01)                           */
#define MSPI0_CTRL_PIOSCRAMBLE_Pos        (11UL)                    /*!< PIOSCRAMBLE (Bit 11)                                  */
#define MSPI0_CTRL_PIOSCRAMBLE_Msk        (0x800UL)                 /*!< PIOSCRAMBLE (Bitfield-Mask: 0x01)                     */
#define MSPI0_CTRL_TXRX_Pos               (10UL)                    /*!< TXRX (Bit 10)                                         */
#define MSPI0_CTRL_TXRX_Msk               (0x400UL)                 /*!< TXRX (Bitfield-Mask: 0x01)                            */
#define MSPI0_CTRL_SENDI_Pos              (9UL)                     /*!< SENDI (Bit 9)                                         */
#define MSPI0_CTRL_SENDI_Msk              (0x200UL)                 /*!< SENDI (Bitfield-Mask: 0x01)                           */
#define MSPI0_CTRL_SENDA_Pos              (8UL)                     /*!< SENDA (Bit 8)                                         */
#define MSPI0_CTRL_SENDA_Msk              (0x100UL)                 /*!< SENDA (Bitfield-Mask: 0x01)                           */
#define MSPI0_CTRL_ENTURN_Pos             (7UL)                     /*!< ENTURN (Bit 7)                                        */
#define MSPI0_CTRL_ENTURN_Msk             (0x80UL)                  /*!< ENTURN (Bitfield-Mask: 0x01)                          */
#define MSPI0_CTRL_BIGENDIAN_Pos          (6UL)                     /*!< BIGENDIAN (Bit 6)                                     */
#define MSPI0_CTRL_BIGENDIAN_Msk          (0x40UL)                  /*!< BIGENDIAN (Bitfield-Mask: 0x01)                       */
#define MSPI0_CTRL_CONT_Pos               (5UL)                     /*!< CONT (Bit 5)                                          */
#define MSPI0_CTRL_CONT_Msk               (0x20UL)                  /*!< CONT (Bitfield-Mask: 0x01)                            */
#define MSPI0_CTRL_ENWLAT_Pos             (4UL)                     /*!< ENWLAT (Bit 4)                                        */
#define MSPI0_CTRL_ENWLAT_Msk             (0x10UL)                  /*!< ENWLAT (Bitfield-Mask: 0x01)                          */
#define MSPI0_CTRL_QUADCMD_Pos            (3UL)                     /*!< QUADCMD (Bit 3)                                       */
#define MSPI0_CTRL_QUADCMD_Msk            (0x8UL)                   /*!< QUADCMD (Bitfield-Mask: 0x01)                         */
#define MSPI0_CTRL_BUSY_Pos               (2UL)                     /*!< BUSY (Bit 2)                                          */
#define MSPI0_CTRL_BUSY_Msk               (0x4UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define MSPI0_CTRL_STATUS_Pos             (1UL)                     /*!< STATUS (Bit 1)                                        */
#define MSPI0_CTRL_STATUS_Msk             (0x2UL)                   /*!< STATUS (Bitfield-Mask: 0x01)                          */
#define MSPI0_CTRL_START_Pos              (0UL)                     /*!< START (Bit 0)                                         */
#define MSPI0_CTRL_START_Msk              (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CFG  ========================================================== */
#define MSPI0_CFG_WRITELATENCY_Pos        (20UL)                    /*!< WRITELATENCY (Bit 20)                                 */
#define MSPI0_CFG_WRITELATENCY_Msk        (0x3f00000UL)             /*!< WRITELATENCY (Bitfield-Mask: 0x3f)                    */
#define MSPI0_CFG_CPOL_Pos                (17UL)                    /*!< CPOL (Bit 17)                                         */
#define MSPI0_CFG_CPOL_Msk                (0x20000UL)               /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define MSPI0_CFG_CPHA_Pos                (16UL)                    /*!< CPHA (Bit 16)                                         */
#define MSPI0_CFG_CPHA_Msk                (0x10000UL)               /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define MSPI0_CFG_TURNAROUND_Pos          (8UL)                     /*!< TURNAROUND (Bit 8)                                    */
#define MSPI0_CFG_TURNAROUND_Msk          (0x3f00UL)                /*!< TURNAROUND (Bitfield-Mask: 0x3f)                      */
#define MSPI0_CFG_SEPIO_Pos               (7UL)                     /*!< SEPIO (Bit 7)                                         */
#define MSPI0_CFG_SEPIO_Msk               (0x80UL)                  /*!< SEPIO (Bitfield-Mask: 0x01)                           */
#define MSPI0_CFG_ISIZE_Pos               (6UL)                     /*!< ISIZE (Bit 6)                                         */
#define MSPI0_CFG_ISIZE_Msk               (0x40UL)                  /*!< ISIZE (Bitfield-Mask: 0x01)                           */
#define MSPI0_CFG_ASIZE_Pos               (4UL)                     /*!< ASIZE (Bit 4)                                         */
#define MSPI0_CFG_ASIZE_Msk               (0x30UL)                  /*!< ASIZE (Bitfield-Mask: 0x03)                           */
#define MSPI0_CFG_DEVCFG_Pos              (0UL)                     /*!< DEVCFG (Bit 0)                                        */
#define MSPI0_CFG_DEVCFG_Msk              (0xfUL)                   /*!< DEVCFG (Bitfield-Mask: 0x0f)                          */
/* =========================================================  ADDR  ========================================================== */
#define MSPI0_ADDR_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                          */
#define MSPI0_ADDR_ADDR_Msk               (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  INSTR  ========================================================= */
#define MSPI0_INSTR_INSTR_Pos             (0UL)                     /*!< INSTR (Bit 0)                                         */
#define MSPI0_INSTR_INSTR_Msk             (0xffffUL)                /*!< INSTR (Bitfield-Mask: 0xffff)                         */
/* ========================================================  TXFIFO  ========================================================= */
#define MSPI0_TXFIFO_TXFIFO_Pos           (0UL)                     /*!< TXFIFO (Bit 0)                                        */
#define MSPI0_TXFIFO_TXFIFO_Msk           (0xffffffffUL)            /*!< TXFIFO (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  RXFIFO  ========================================================= */
#define MSPI0_RXFIFO_RXFIFO_Pos           (0UL)                     /*!< RXFIFO (Bit 0)                                        */
#define MSPI0_RXFIFO_RXFIFO_Msk           (0xffffffffUL)            /*!< RXFIFO (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TXENTRIES  ======================================================= */
#define MSPI0_TXENTRIES_TXENTRIES_Pos     (0UL)                     /*!< TXENTRIES (Bit 0)                                     */
#define MSPI0_TXENTRIES_TXENTRIES_Msk     (0x3fUL)                  /*!< TXENTRIES (Bitfield-Mask: 0x3f)                       */
/* =======================================================  RXENTRIES  ======================================================= */
#define MSPI0_RXENTRIES_RXENTRIES_Pos     (0UL)                     /*!< RXENTRIES (Bit 0)                                     */
#define MSPI0_RXENTRIES_RXENTRIES_Msk     (0x3fUL)                  /*!< RXENTRIES (Bitfield-Mask: 0x3f)                       */
/* =======================================================  THRESHOLD  ======================================================= */
#define MSPI0_THRESHOLD_RXTHRESH_Pos      (8UL)                     /*!< RXTHRESH (Bit 8)                                      */
#define MSPI0_THRESHOLD_RXTHRESH_Msk      (0x3f00UL)                /*!< RXTHRESH (Bitfield-Mask: 0x3f)                        */
#define MSPI0_THRESHOLD_TXTHRESH_Pos      (0UL)                     /*!< TXTHRESH (Bit 0)                                      */
#define MSPI0_THRESHOLD_TXTHRESH_Msk      (0x3fUL)                  /*!< TXTHRESH (Bitfield-Mask: 0x3f)                        */
/* ========================================================  MSPICFG  ======================================================== */
#define MSPI0_MSPICFG_PRSTN_Pos           (31UL)                    /*!< PRSTN (Bit 31)                                        */
#define MSPI0_MSPICFG_PRSTN_Msk           (0x80000000UL)            /*!< PRSTN (Bitfield-Mask: 0x01)                           */
#define MSPI0_MSPICFG_IPRSTN_Pos          (30UL)                    /*!< IPRSTN (Bit 30)                                       */
#define MSPI0_MSPICFG_IPRSTN_Msk          (0x40000000UL)            /*!< IPRSTN (Bitfield-Mask: 0x01)                          */
#define MSPI0_MSPICFG_FIFORESET_Pos       (29UL)                    /*!< FIFORESET (Bit 29)                                    */
#define MSPI0_MSPICFG_FIFORESET_Msk       (0x20000000UL)            /*!< FIFORESET (Bitfield-Mask: 0x01)                       */
#define MSPI0_MSPICFG_CLKDIV_Pos          (8UL)                     /*!< CLKDIV (Bit 8)                                        */
#define MSPI0_MSPICFG_CLKDIV_Msk          (0x3f00UL)                /*!< CLKDIV (Bitfield-Mask: 0x3f)                          */
#define MSPI0_MSPICFG_IOMSEL_Pos          (4UL)                     /*!< IOMSEL (Bit 4)                                        */
#define MSPI0_MSPICFG_IOMSEL_Msk          (0xf0UL)                  /*!< IOMSEL (Bitfield-Mask: 0x0f)                          */
#define MSPI0_MSPICFG_TXNEG_Pos           (3UL)                     /*!< TXNEG (Bit 3)                                         */
#define MSPI0_MSPICFG_TXNEG_Msk           (0x8UL)                   /*!< TXNEG (Bitfield-Mask: 0x01)                           */
#define MSPI0_MSPICFG_RXNEG_Pos           (2UL)                     /*!< RXNEG (Bit 2)                                         */
#define MSPI0_MSPICFG_RXNEG_Msk           (0x4UL)                   /*!< RXNEG (Bitfield-Mask: 0x01)                           */
#define MSPI0_MSPICFG_RXCAP_Pos           (1UL)                     /*!< RXCAP (Bit 1)                                         */
#define MSPI0_MSPICFG_RXCAP_Msk           (0x2UL)                   /*!< RXCAP (Bitfield-Mask: 0x01)                           */
#define MSPI0_MSPICFG_APBCLK_Pos          (0UL)                     /*!< APBCLK (Bit 0)                                        */
#define MSPI0_MSPICFG_APBCLK_Msk          (0x1UL)                   /*!< APBCLK (Bitfield-Mask: 0x01)                          */
/* ========================================================  MSPIDDR  ======================================================== */
#define MSPI0_MSPIDDR_TXDQSDELAY_Pos      (16UL)                    /*!< TXDQSDELAY (Bit 16)                                   */
#define MSPI0_MSPIDDR_TXDQSDELAY_Msk      (0x1f0000UL)              /*!< TXDQSDELAY (Bitfield-Mask: 0x1f)                      */
#define MSPI0_MSPIDDR_RXDQSDELAY_Pos      (8UL)                     /*!< RXDQSDELAY (Bit 8)                                    */
#define MSPI0_MSPIDDR_RXDQSDELAY_Msk      (0x1f00UL)                /*!< RXDQSDELAY (Bitfield-Mask: 0x1f)                      */
#define MSPI0_MSPIDDR_ENABLEFINEDELAY_Pos (6UL)                     /*!< ENABLEFINEDELAY (Bit 6)                               */
#define MSPI0_MSPIDDR_ENABLEFINEDELAY_Msk (0x40UL)                  /*!< ENABLEFINEDELAY (Bitfield-Mask: 0x01)                 */
#define MSPI0_MSPIDDR_OVERRIDEDDRCLKOUTDELAY_Pos (5UL)              /*!< OVERRIDEDDRCLKOUTDELAY (Bit 5)                        */
#define MSPI0_MSPIDDR_OVERRIDEDDRCLKOUTDELAY_Msk (0x20UL)           /*!< OVERRIDEDDRCLKOUTDELAY (Bitfield-Mask: 0x01)          */
#define MSPI0_MSPIDDR_OVERRIDERXDQSDELAY_Pos (4UL)                  /*!< OVERRIDERXDQSDELAY (Bit 4)                            */
#define MSPI0_MSPIDDR_OVERRIDERXDQSDELAY_Msk (0x10UL)               /*!< OVERRIDERXDQSDELAY (Bitfield-Mask: 0x01)              */
#define MSPI0_MSPIDDR_DQSSYNCNEG_Pos      (3UL)                     /*!< DQSSYNCNEG (Bit 3)                                    */
#define MSPI0_MSPIDDR_DQSSYNCNEG_Msk      (0x8UL)                   /*!< DQSSYNCNEG (Bitfield-Mask: 0x01)                      */
#define MSPI0_MSPIDDR_ENABLEDQS_Pos       (2UL)                     /*!< ENABLEDQS (Bit 2)                                     */
#define MSPI0_MSPIDDR_ENABLEDQS_Msk       (0x4UL)                   /*!< ENABLEDQS (Bitfield-Mask: 0x01)                       */
#define MSPI0_MSPIDDR_QUADDDR_Pos         (1UL)                     /*!< QUADDDR (Bit 1)                                       */
#define MSPI0_MSPIDDR_QUADDDR_Msk         (0x2UL)                   /*!< QUADDDR (Bitfield-Mask: 0x01)                         */
#define MSPI0_MSPIDDR_EMULATEDDR_Pos      (0UL)                     /*!< EMULATEDDR (Bit 0)                                    */
#define MSPI0_MSPIDDR_EMULATEDDR_Msk      (0x1UL)                   /*!< EMULATEDDR (Bitfield-Mask: 0x01)                      */
/* ========================================================  PADCFG  ========================================================= */
#define MSPI0_PADCFG_REVCS_Pos            (21UL)                    /*!< REVCS (Bit 21)                                        */
#define MSPI0_PADCFG_REVCS_Msk            (0x200000UL)              /*!< REVCS (Bitfield-Mask: 0x01)                           */
#define MSPI0_PADCFG_IN3_Pos              (20UL)                    /*!< IN3 (Bit 20)                                          */
#define MSPI0_PADCFG_IN3_Msk              (0x100000UL)              /*!< IN3 (Bitfield-Mask: 0x01)                             */
#define MSPI0_PADCFG_IN2_Pos              (19UL)                    /*!< IN2 (Bit 19)                                          */
#define MSPI0_PADCFG_IN2_Msk              (0x80000UL)               /*!< IN2 (Bitfield-Mask: 0x01)                             */
#define MSPI0_PADCFG_IN1_Pos              (18UL)                    /*!< IN1 (Bit 18)                                          */
#define MSPI0_PADCFG_IN1_Msk              (0x40000UL)               /*!< IN1 (Bitfield-Mask: 0x01)                             */
#define MSPI0_PADCFG_IN0_Pos              (16UL)                    /*!< IN0 (Bit 16)                                          */
#define MSPI0_PADCFG_IN0_Msk              (0x30000UL)               /*!< IN0 (Bitfield-Mask: 0x03)                             */
#define MSPI0_PADCFG_OUT7_Pos             (4UL)                     /*!< OUT7 (Bit 4)                                          */
#define MSPI0_PADCFG_OUT7_Msk             (0x10UL)                  /*!< OUT7 (Bitfield-Mask: 0x01)                            */
#define MSPI0_PADCFG_OUT6_Pos             (3UL)                     /*!< OUT6 (Bit 3)                                          */
#define MSPI0_PADCFG_OUT6_Msk             (0x8UL)                   /*!< OUT6 (Bitfield-Mask: 0x01)                            */
#define MSPI0_PADCFG_OUT5_Pos             (2UL)                     /*!< OUT5 (Bit 2)                                          */
#define MSPI0_PADCFG_OUT5_Msk             (0x4UL)                   /*!< OUT5 (Bitfield-Mask: 0x01)                            */
#define MSPI0_PADCFG_OUT4_Pos             (1UL)                     /*!< OUT4 (Bit 1)                                          */
#define MSPI0_PADCFG_OUT4_Msk             (0x2UL)                   /*!< OUT4 (Bitfield-Mask: 0x01)                            */
#define MSPI0_PADCFG_OUT3_Pos             (0UL)                     /*!< OUT3 (Bit 0)                                          */
#define MSPI0_PADCFG_OUT3_Msk             (0x1UL)                   /*!< OUT3 (Bitfield-Mask: 0x01)                            */
/* =======================================================  PADOUTEN  ======================================================== */
#define MSPI0_PADOUTEN_OUTEN_Pos          (0UL)                     /*!< OUTEN (Bit 0)                                         */
#define MSPI0_PADOUTEN_OUTEN_Msk          (0x3ffUL)                 /*!< OUTEN (Bitfield-Mask: 0x3ff)                          */
/* =======================================================  PADOVEREN  ======================================================= */
#define MSPI0_PADOVEREN_OVERRIDEEN_Pos    (0UL)                     /*!< OVERRIDEEN (Bit 0)                                    */
#define MSPI0_PADOVEREN_OVERRIDEEN_Msk    (0x3ffUL)                 /*!< OVERRIDEEN (Bitfield-Mask: 0x3ff)                     */
/* ========================================================  PADOVER  ======================================================== */
#define MSPI0_PADOVER_OVERRIDE_Pos        (0UL)                     /*!< OVERRIDE (Bit 0)                                      */
#define MSPI0_PADOVER_OVERRIDE_Msk        (0x3ffUL)                 /*!< OVERRIDE (Bitfield-Mask: 0x3ff)                       */
/* =========================================================  FLASH  ========================================================= */
#define MSPI0_FLASH_XIPENWLAT_Pos         (11UL)                    /*!< XIPENWLAT (Bit 11)                                    */
#define MSPI0_FLASH_XIPENWLAT_Msk         (0x800UL)                 /*!< XIPENWLAT (Bitfield-Mask: 0x01)                       */
#define MSPI0_FLASH_XIPMIXED_Pos          (8UL)                     /*!< XIPMIXED (Bit 8)                                      */
#define MSPI0_FLASH_XIPMIXED_Msk          (0x700UL)                 /*!< XIPMIXED (Bitfield-Mask: 0x07)                        */
#define MSPI0_FLASH_XIPSENDI_Pos          (7UL)                     /*!< XIPSENDI (Bit 7)                                      */
#define MSPI0_FLASH_XIPSENDI_Msk          (0x80UL)                  /*!< XIPSENDI (Bitfield-Mask: 0x01)                        */
#define MSPI0_FLASH_XIPSENDA_Pos          (6UL)                     /*!< XIPSENDA (Bit 6)                                      */
#define MSPI0_FLASH_XIPSENDA_Msk          (0x40UL)                  /*!< XIPSENDA (Bitfield-Mask: 0x01)                        */
#define MSPI0_FLASH_XIPENTURN_Pos         (5UL)                     /*!< XIPENTURN (Bit 5)                                     */
#define MSPI0_FLASH_XIPENTURN_Msk         (0x20UL)                  /*!< XIPENTURN (Bitfield-Mask: 0x01)                       */
#define MSPI0_FLASH_XIPBIGENDIAN_Pos      (4UL)                     /*!< XIPBIGENDIAN (Bit 4)                                  */
#define MSPI0_FLASH_XIPBIGENDIAN_Msk      (0x10UL)                  /*!< XIPBIGENDIAN (Bitfield-Mask: 0x01)                    */
#define MSPI0_FLASH_XIPACK_Pos            (2UL)                     /*!< XIPACK (Bit 2)                                        */
#define MSPI0_FLASH_XIPACK_Msk            (0xcUL)                   /*!< XIPACK (Bitfield-Mask: 0x03)                          */
#define MSPI0_FLASH_XIPENDCX_Pos          (1UL)                     /*!< XIPENDCX (Bit 1)                                      */
#define MSPI0_FLASH_XIPENDCX_Msk          (0x2UL)                   /*!< XIPENDCX (Bitfield-Mask: 0x01)                        */
#define MSPI0_FLASH_XIPEN_Pos             (0UL)                     /*!< XIPEN (Bit 0)                                         */
#define MSPI0_FLASH_XIPEN_Msk             (0x1UL)                   /*!< XIPEN (Bitfield-Mask: 0x01)                           */
/* =======================================================  XIPINSTR  ======================================================== */
#define MSPI0_XIPINSTR_READINSTR_Pos      (16UL)                    /*!< READINSTR (Bit 16)                                    */
#define MSPI0_XIPINSTR_READINSTR_Msk      (0xffff0000UL)            /*!< READINSTR (Bitfield-Mask: 0xffff)                     */
#define MSPI0_XIPINSTR_WRITEINSTR_Pos     (0UL)                     /*!< WRITEINSTR (Bit 0)                                    */
#define MSPI0_XIPINSTR_WRITEINSTR_Msk     (0xffffUL)                /*!< WRITEINSTR (Bitfield-Mask: 0xffff)                    */
/* ======================================================  SCRAMBLING  ======================================================= */
#define MSPI0_SCRAMBLING_SCRENABLE_Pos    (31UL)                    /*!< SCRENABLE (Bit 31)                                    */
#define MSPI0_SCRAMBLING_SCRENABLE_Msk    (0x80000000UL)            /*!< SCRENABLE (Bitfield-Mask: 0x01)                       */
#define MSPI0_SCRAMBLING_SCREND_Pos       (16UL)                    /*!< SCREND (Bit 16)                                       */
#define MSPI0_SCRAMBLING_SCREND_Msk       (0x3ff0000UL)             /*!< SCREND (Bitfield-Mask: 0x3ff)                         */
#define MSPI0_SCRAMBLING_SCRSTART_Pos     (0UL)                     /*!< SCRSTART (Bit 0)                                      */
#define MSPI0_SCRAMBLING_SCRSTART_Msk     (0x3ffUL)                 /*!< SCRSTART (Bitfield-Mask: 0x3ff)                       */
/* =========================================================  INTEN  ========================================================= */
#define MSPI0_INTEN_SCRERR_Pos            (12UL)                    /*!< SCRERR (Bit 12)                                       */
#define MSPI0_INTEN_SCRERR_Msk            (0x1000UL)                /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_INTEN_CQERR_Pos             (11UL)                    /*!< CQERR (Bit 11)                                        */
#define MSPI0_INTEN_CQERR_Msk             (0x800UL)                 /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_CQPAUSED_Pos          (10UL)                    /*!< CQPAUSED (Bit 10)                                     */
#define MSPI0_INTEN_CQPAUSED_Msk          (0x400UL)                 /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_INTEN_CQUPD_Pos             (9UL)                     /*!< CQUPD (Bit 9)                                         */
#define MSPI0_INTEN_CQUPD_Msk             (0x200UL)                 /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_CQCMP_Pos             (8UL)                     /*!< CQCMP (Bit 8)                                         */
#define MSPI0_INTEN_CQCMP_Msk             (0x100UL)                 /*!< CQCMP (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_DERR_Pos              (7UL)                     /*!< DERR (Bit 7)                                          */
#define MSPI0_INTEN_DERR_Msk              (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTEN_DCMP_Pos              (6UL)                     /*!< DCMP (Bit 6)                                          */
#define MSPI0_INTEN_DCMP_Msk              (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTEN_RXF_Pos               (5UL)                     /*!< RXF (Bit 5)                                           */
