TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =========================================================  PCFG  ========================================================== */
#define PDM_PCFG_LRSWAP_Pos               (31UL)                    /*!< LRSWAP (Bit 31)                                       */
#define PDM_PCFG_LRSWAP_Msk               (0x80000000UL)            /*!< LRSWAP (Bitfield-Mask: 0x01)                          */
#define PDM_PCFG_PGARIGHT_Pos             (26UL)                    /*!< PGARIGHT (Bit 26)                                     */
#define PDM_PCFG_PGARIGHT_Msk             (0x7c000000UL)            /*!< PGARIGHT (Bitfield-Mask: 0x1f)                        */
#define PDM_PCFG_PGALEFT_Pos              (21UL)                    /*!< PGALEFT (Bit 21)                                      */
#define PDM_PCFG_PGALEFT_Msk              (0x3e00000UL)             /*!< PGALEFT (Bitfield-Mask: 0x1f)                         */
#define PDM_PCFG_MCLKDIV_Pos              (17UL)                    /*!< MCLKDIV (Bit 17)                                      */
#define PDM_PCFG_MCLKDIV_Msk              (0x60000UL)               /*!< MCLKDIV (Bitfield-Mask: 0x03)                         */
#define PDM_PCFG_SINCRATE_Pos             (10UL)                    /*!< SINCRATE (Bit 10)                                     */
#define PDM_PCFG_SINCRATE_Msk             (0x1fc00UL)               /*!< SINCRATE (Bitfield-Mask: 0x7f)                        */
#define PDM_PCFG_ADCHPD_Pos               (9UL)                     /*!< ADCHPD (Bit 9)                                        */
#define PDM_PCFG_ADCHPD_Msk               (0x200UL)                 /*!< ADCHPD (Bitfield-Mask: 0x01)                          */
#define PDM_PCFG_HPCUTOFF_Pos             (5UL)                     /*!< HPCUTOFF (Bit 5)                                      */
#define PDM_PCFG_HPCUTOFF_Msk             (0x1e0UL)                 /*!< HPCUTOFF (Bitfield-Mask: 0x0f)                        */
#define PDM_PCFG_CYCLES_Pos               (2UL)                     /*!< CYCLES (Bit 2)                                        */
#define PDM_PCFG_CYCLES_Msk               (0x1cUL)                  /*!< CYCLES (Bitfield-Mask: 0x07)                          */
#define PDM_PCFG_SOFTMUTE_Pos             (1UL)                     /*!< SOFTMUTE (Bit 1)                                      */
#define PDM_PCFG_SOFTMUTE_Msk             (0x2UL)                   /*!< SOFTMUTE (Bitfield-Mask: 0x01)                        */
#define PDM_PCFG_PDMCOREEN_Pos            (0UL)                     /*!< PDMCOREEN (Bit 0)                                     */
#define PDM_PCFG_PDMCOREEN_Msk            (0x1UL)                   /*!< PDMCOREEN (Bitfield-Mask: 0x01)                       */
/* =========================================================  VCFG  ========================================================== */
#define PDM_VCFG_IOCLKEN_Pos              (31UL)                    /*!< IOCLKEN (Bit 31)                                      */
#define PDM_VCFG_IOCLKEN_Msk              (0x80000000UL)            /*!< IOCLKEN (Bitfield-Mask: 0x01)                         */
#define PDM_VCFG_RSTB_Pos                 (30UL)                    /*!< RSTB (Bit 30)                                         */
#define PDM_VCFG_RSTB_Msk                 (0x40000000UL)            /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define PDM_VCFG_PDMCLKSEL_Pos            (27UL)                    /*!< PDMCLKSEL (Bit 27)                                    */
#define PDM_VCFG_PDMCLKSEL_Msk            (0x38000000UL)            /*!< PDMCLKSEL (Bitfield-Mask: 0x07)                       */
#define PDM_VCFG_PDMCLKEN_Pos             (26UL)                    /*!< PDMCLKEN (Bit 26)                                     */
#define PDM_VCFG_PDMCLKEN_Msk             (0x4000000UL)             /*!< PDMCLKEN (Bitfield-Mask: 0x01)                        */
#define PDM_VCFG_I2SEN_Pos                (20UL)                    /*!< I2SEN (Bit 20)                                        */
#define PDM_VCFG_I2SEN_Msk                (0x100000UL)              /*!< I2SEN (Bitfield-Mask: 0x01)                           */
#define PDM_VCFG_BCLKINV_Pos              (19UL)                    /*!< BCLKINV (Bit 19)                                      */
#define PDM_VCFG_BCLKINV_Msk              (0x80000UL)               /*!< BCLKINV (Bitfield-Mask: 0x01)                         */
#define PDM_VCFG_DMICKDEL_Pos             (17UL)                    /*!< DMICKDEL (Bit 17)                                     */
#define PDM_VCFG_DMICKDEL_Msk             (0x20000UL)               /*!< DMICKDEL (Bitfield-Mask: 0x01)                        */
#define PDM_VCFG_SELAP_Pos                (16UL)                    /*!< SELAP (Bit 16)                                        */
#define PDM_VCFG_SELAP_Msk                (0x10000UL)               /*!< SELAP (Bitfield-Mask: 0x01)                           */
#define PDM_VCFG_PCMPACK_Pos              (8UL)                     /*!< PCMPACK (Bit 8)                                       */
#define PDM_VCFG_PCMPACK_Msk              (0x100UL)                 /*!< PCMPACK (Bitfield-Mask: 0x01)                         */
#define PDM_VCFG_CHSET_Pos                (3UL)                     /*!< CHSET (Bit 3)                                         */
#define PDM_VCFG_CHSET_Msk                (0x18UL)                  /*!< CHSET (Bitfield-Mask: 0x03)                           */
/* =======================================================  VOICESTAT  ======================================================= */
#define PDM_VOICESTAT_FIFOCNT_Pos         (0UL)                     /*!< FIFOCNT (Bit 0)                                       */
#define PDM_VOICESTAT_FIFOCNT_Msk         (0x3fUL)                  /*!< FIFOCNT (Bitfield-Mask: 0x3f)                         */
/* =======================================================  FIFOREAD  ======================================================== */
#define PDM_FIFOREAD_FIFOREAD_Pos         (0UL)                     /*!< FIFOREAD (Bit 0)                                      */
#define PDM_FIFOREAD_FIFOREAD_Msk         (0xffffffffUL)            /*!< FIFOREAD (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  FIFOFLUSH  ======================================================= */
#define PDM_FIFOFLUSH_FIFOFLUSH_Pos       (0UL)                     /*!< FIFOFLUSH (Bit 0)                                     */
#define PDM_FIFOFLUSH_FIFOFLUSH_Msk       (0x1UL)                   /*!< FIFOFLUSH (Bitfield-Mask: 0x01)                       */
/* ========================================================  FIFOTHR  ======================================================== */
#define PDM_FIFOTHR_FIFOTHR_Pos           (0UL)                     /*!< FIFOTHR (Bit 0)                                       */
#define PDM_FIFOTHR_FIFOTHR_Msk           (0x1fUL)                  /*!< FIFOTHR (Bitfield-Mask: 0x1f)                         */
/* =========================================================  INTEN  ========================================================= */
#define PDM_INTEN_DERR_Pos                (4UL)                     /*!< DERR (Bit 4)                                          */
#define PDM_INTEN_DERR_Msk                (0x10UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define PDM_INTEN_DCMP_Pos                (3UL)                     /*!< DCMP (Bit 3)                                          */
#define PDM_INTEN_DCMP_Msk                (0x8UL)                   /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define PDM_INTEN_UNDFL_Pos               (2UL)                     /*!< UNDFL (Bit 2)                                         */
#define PDM_INTEN_UNDFL_Msk               (0x4UL)                   /*!< UNDFL (Bitfield-Mask: 0x01)                           */
#define PDM_INTEN_OVF_Pos                 (1UL)                     /*!< OVF (Bit 1)                                           */
#define PDM_INTEN_OVF_Msk                 (0x2UL)                   /*!< OVF (Bitfield-Mask: 0x01)                             */
#define PDM_INTEN_THR_Pos                 (0UL)                     /*!< THR (Bit 0)                                           */
#define PDM_INTEN_THR_Msk                 (0x1UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSTAT  ======================================================== */
#define PDM_INTSTAT_DERR_Pos              (4UL)                     /*!< DERR (Bit 4)                                          */
#define PDM_INTSTAT_DERR_Msk              (0x10UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define PDM_INTSTAT_DCMP_Pos              (3UL)                     /*!< DCMP (Bit 3)                                          */
#define PDM_INTSTAT_DCMP_Msk              (0x8UL)                   /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define PDM_INTSTAT_UNDFL_Pos             (2UL)                     /*!< UNDFL (Bit 2)                                         */
#define PDM_INTSTAT_UNDFL_Msk             (0x4UL)                   /*!< UNDFL (Bitfield-Mask: 0x01)                           */
#define PDM_INTSTAT_OVF_Pos               (1UL)                     /*!< OVF (Bit 1)                                           */
#define PDM_INTSTAT_OVF_Msk               (0x2UL)                   /*!< OVF (Bitfield-Mask: 0x01)                             */
#define PDM_INTSTAT_THR_Pos               (0UL)                     /*!< THR (Bit 0)                                           */
#define PDM_INTSTAT_THR_Msk               (0x1UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTCLR  ========================================================= */
#define PDM_INTCLR_DERR_Pos               (4UL)                     /*!< DERR (Bit 4)                                          */
#define PDM_INTCLR_DERR_Msk               (0x10UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define PDM_INTCLR_DCMP_Pos               (3UL)                     /*!< DCMP (Bit 3)                                          */
#define PDM_INTCLR_DCMP_Msk               (0x8UL)                   /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define PDM_INTCLR_UNDFL_Pos              (2UL)                     /*!< UNDFL (Bit 2)                                         */
#define PDM_INTCLR_UNDFL_Msk              (0x4UL)                   /*!< UNDFL (Bitfield-Mask: 0x01)                           */
#define PDM_INTCLR_OVF_Pos                (1UL)                     /*!< OVF (Bit 1)                                           */
#define PDM_INTCLR_OVF_Msk                (0x2UL)                   /*!< OVF (Bitfield-Mask: 0x01)                             */
#define PDM_INTCLR_THR_Pos                (0UL)                     /*!< THR (Bit 0)                                           */
#define PDM_INTCLR_THR_Msk                (0x1UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSET  ========================================================= */
#define PDM_INTSET_DERR_Pos               (4UL)                     /*!< DERR (Bit 4)                                          */
#define PDM_INTSET_DERR_Msk               (0x10UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define PDM_INTSET_DCMP_Pos               (3UL)                     /*!< DCMP (Bit 3)                                          */
#define PDM_INTSET_DCMP_Msk               (0x8UL)                   /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define PDM_INTSET_UNDFL_Pos              (2UL)                     /*!< UNDFL (Bit 2)                                         */
#define PDM_INTSET_UNDFL_Msk              (0x4UL)                   /*!< UNDFL (Bitfield-Mask: 0x01)                           */
#define PDM_INTSET_OVF_Pos                (1UL)                     /*!< OVF (Bit 1)                                           */
#define PDM_INTSET_OVF_Msk                (0x2UL)                   /*!< OVF (Bitfield-Mask: 0x01)                             */
#define PDM_INTSET_THR_Pos                (0UL)                     /*!< THR (Bit 0)                                           */
#define PDM_INTSET_THR_Msk                (0x1UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
/* =======================================================  DMATRIGEN  ======================================================= */
#define PDM_DMATRIGEN_DTHR90_Pos          (1UL)                     /*!< DTHR90 (Bit 1)                                        */
#define PDM_DMATRIGEN_DTHR90_Msk          (0x2UL)                   /*!< DTHR90 (Bitfield-Mask: 0x01)                          */
#define PDM_DMATRIGEN_DTHR_Pos            (0UL)                     /*!< DTHR (Bit 0)                                          */
#define PDM_DMATRIGEN_DTHR_Msk            (0x1UL)                   /*!< DTHR (Bitfield-Mask: 0x01)                            */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define PDM_DMATRIGSTAT_DTHR90STAT_Pos    (1UL)                     /*!< DTHR90STAT (Bit 1)                                    */
#define PDM_DMATRIGSTAT_DTHR90STAT_Msk    (0x2UL)                   /*!< DTHR90STAT (Bitfield-Mask: 0x01)                      */
#define PDM_DMATRIGSTAT_DTHRSTAT_Pos      (0UL)                     /*!< DTHRSTAT (Bit 0)                                      */
#define PDM_DMATRIGSTAT_DTHRSTAT_Msk      (0x1UL)                   /*!< DTHRSTAT (Bitfield-Mask: 0x01)                        */
/* ========================================================  DMACFG  ========================================================= */
#define PDM_DMACFG_DPWROFF_Pos            (10UL)                    /*!< DPWROFF (Bit 10)                                      */
#define PDM_DMACFG_DPWROFF_Msk            (0x400UL)                 /*!< DPWROFF (Bitfield-Mask: 0x01)                         */
#define PDM_DMACFG_DAUTOHIP_Pos           (9UL)                     /*!< DAUTOHIP (Bit 9)                                      */
#define PDM_DMACFG_DAUTOHIP_Msk           (0x200UL)                 /*!< DAUTOHIP (Bitfield-Mask: 0x01)                        */
#define PDM_DMACFG_DMAPRI_Pos             (8UL)                     /*!< DMAPRI (Bit 8)                                        */
#define PDM_DMACFG_DMAPRI_Msk             (0x100UL)                 /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define PDM_DMACFG_DMADIR_Pos             (2UL)                     /*!< DMADIR (Bit 2)                                        */
#define PDM_DMACFG_DMADIR_Msk             (0x4UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define PDM_DMACFG_DMAEN_Pos              (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define PDM_DMACFG_DMAEN_Msk              (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define PDM_DMATOTCOUNT_TOTCOUNT_Pos      (0UL)                     /*!< TOTCOUNT (Bit 0)                                      */
#define PDM_DMATOTCOUNT_TOTCOUNT_Msk      (0xfffffUL)               /*!< TOTCOUNT (Bitfield-Mask: 0xfffff)                     */
/* ======================================================  DMATARGADDR  ====================================================== */
#define PDM_DMATARGADDR_UTARGADDR_Pos     (21UL)                    /*!< UTARGADDR (Bit 21)                                    */
#define PDM_DMATARGADDR_UTARGADDR_Msk     (0xffe00000UL)            /*!< UTARGADDR (Bitfield-Mask: 0x7ff)                      */
#define PDM_DMATARGADDR_LTARGADDR_Pos     (0UL)                     /*!< LTARGADDR (Bit 0)                                     */
#define PDM_DMATARGADDR_LTARGADDR_Msk     (0x1fffffUL)              /*!< LTARGADDR (Bitfield-Mask: 0x1fffff)                   */
/* ========================================================  DMASTAT  ======================================================== */
#define PDM_DMASTAT_DMAERR_Pos            (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define PDM_DMASTAT_DMAERR_Msk            (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define PDM_DMASTAT_DMACPL_Pos            (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define PDM_DMASTAT_DMACPL_Msk            (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define PDM_DMASTAT_DMATIP_Pos            (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define PDM_DMASTAT_DMATIP_Msk            (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */

