TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =======================================================  SUPPLYSRC  ======================================================= */
#define PWRCTRL_SUPPLYSRC_BLEBUCKEN_Pos   (0UL)                     /*!< BLEBUCKEN (Bit 0)                                     */
#define PWRCTRL_SUPPLYSRC_BLEBUCKEN_Msk   (0x1UL)                   /*!< BLEBUCKEN (Bitfield-Mask: 0x01)                       */
/* =====================================================  SUPPLYSTATUS  ====================================================== */
#define PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Pos (1UL)                    /*!< BLEBUCKON (Bit 1)                                     */
#define PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Msk (0x2UL)                  /*!< BLEBUCKON (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Pos (0UL)                   /*!< SIMOBUCKON (Bit 0)                                    */
#define PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Msk (0x1UL)                 /*!< SIMOBUCKON (Bitfield-Mask: 0x01)                      */
/* =======================================================  DEVPWREN  ======================================================== */
#define PWRCTRL_DEVPWREN_PWRBLEL_Pos      (15UL)                    /*!< PWRBLEL (Bit 15)                                      */
#define PWRCTRL_DEVPWREN_PWRBLEL_Msk      (0x8000UL)                /*!< PWRBLEL (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRPDM_Pos       (14UL)                    /*!< PWRPDM (Bit 14)                                       */
#define PWRCTRL_DEVPWREN_PWRPDM_Msk       (0x4000UL)                /*!< PWRPDM (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_DEVPWREN_PWRMSPI2_Pos     (13UL)                    /*!< PWRMSPI2 (Bit 13)                                     */
#define PWRCTRL_DEVPWREN_PWRMSPI2_Msk     (0x2000UL)                /*!< PWRMSPI2 (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRMSPI1_Pos     (12UL)                    /*!< PWRMSPI1 (Bit 12)                                     */
#define PWRCTRL_DEVPWREN_PWRMSPI1_Msk     (0x1000UL)                /*!< PWRMSPI1 (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRMSPI0_Pos     (11UL)                    /*!< PWRMSPI0 (Bit 11)                                     */
#define PWRCTRL_DEVPWREN_PWRMSPI0_Msk     (0x800UL)                 /*!< PWRMSPI0 (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRSCARD_Pos     (10UL)                    /*!< PWRSCARD (Bit 10)                                     */
#define PWRCTRL_DEVPWREN_PWRSCARD_Msk     (0x400UL)                 /*!< PWRSCARD (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRADC_Pos       (9UL)                     /*!< PWRADC (Bit 9)                                        */
#define PWRCTRL_DEVPWREN_PWRADC_Msk       (0x200UL)                 /*!< PWRADC (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_DEVPWREN_PWRUART1_Pos     (8UL)                     /*!< PWRUART1 (Bit 8)                                      */
#define PWRCTRL_DEVPWREN_PWRUART1_Msk     (0x100UL)                 /*!< PWRUART1 (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRUART0_Pos     (7UL)                     /*!< PWRUART0 (Bit 7)                                      */
#define PWRCTRL_DEVPWREN_PWRUART0_Msk     (0x80UL)                  /*!< PWRUART0 (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRIOM5_Pos      (6UL)                     /*!< PWRIOM5 (Bit 6)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM5_Msk      (0x40UL)                  /*!< PWRIOM5 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOM4_Pos      (5UL)                     /*!< PWRIOM4 (Bit 5)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM4_Msk      (0x20UL)                  /*!< PWRIOM4 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOM3_Pos      (4UL)                     /*!< PWRIOM3 (Bit 4)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM3_Msk      (0x10UL)                  /*!< PWRIOM3 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOM2_Pos      (3UL)                     /*!< PWRIOM2 (Bit 3)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM2_Msk      (0x8UL)                   /*!< PWRIOM2 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOM1_Pos      (2UL)                     /*!< PWRIOM1 (Bit 2)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM1_Msk      (0x4UL)                   /*!< PWRIOM1 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOM0_Pos      (1UL)                     /*!< PWRIOM0 (Bit 1)                                       */
#define PWRCTRL_DEVPWREN_PWRIOM0_Msk      (0x2UL)                   /*!< PWRIOM0 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREN_PWRIOS_Pos       (0UL)                     /*!< PWRIOS (Bit 0)                                        */
#define PWRCTRL_DEVPWREN_PWRIOS_Msk       (0x1UL)                   /*!< PWRIOS (Bitfield-Mask: 0x01)                          */
/* =====================================================  MEMPWDINSLEEP  ===================================================== */
#define PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_Pos (31UL)                /*!< CACHEPWDSLP (Bit 31)                                  */
#define PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_Msk (0x80000000UL)        /*!< CACHEPWDSLP (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_Pos (14UL)               /*!< FLASH1PWDSLP (Bit 14)                                 */
#define PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_Msk (0x4000UL)           /*!< FLASH1PWDSLP (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_Pos (13UL)               /*!< FLASH0PWDSLP (Bit 13)                                 */
#define PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_Msk (0x2000UL)           /*!< FLASH0PWDSLP (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Pos (3UL)                  /*!< SRAMPWDSLP (Bit 3)                                    */
#define PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Msk (0x1ff8UL)             /*!< SRAMPWDSLP (Bitfield-Mask: 0x3ff)                     */
#define PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Pos (0UL)                  /*!< DTCMPWDSLP (Bit 0)                                    */
#define PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Msk (0x7UL)                /*!< DTCMPWDSLP (Bitfield-Mask: 0x07)                      */
/* =======================================================  MEMPWREN  ======================================================== */
#define PWRCTRL_MEMPWREN_CACHEB2_Pos      (31UL)                    /*!< CACHEB2 (Bit 31)                                      */
#define PWRCTRL_MEMPWREN_CACHEB2_Msk      (0x80000000UL)            /*!< CACHEB2 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_MEMPWREN_CACHEB0_Pos      (30UL)                    /*!< CACHEB0 (Bit 30)                                      */
#define PWRCTRL_MEMPWREN_CACHEB0_Msk      (0x40000000UL)            /*!< CACHEB0 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_MEMPWREN_FLASH1_Pos       (14UL)                    /*!< FLASH1 (Bit 14)                                       */
#define PWRCTRL_MEMPWREN_FLASH1_Msk       (0x4000UL)                /*!< FLASH1 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWREN_FLASH0_Pos       (13UL)                    /*!< FLASH0 (Bit 13)                                       */
#define PWRCTRL_MEMPWREN_FLASH0_Msk       (0x2000UL)                /*!< FLASH0 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWREN_SRAM_Pos         (3UL)                     /*!< SRAM (Bit 3)                                          */
#define PWRCTRL_MEMPWREN_SRAM_Msk         (0x1ff8UL)                /*!< SRAM (Bitfield-Mask: 0x3ff)                           */
#define PWRCTRL_MEMPWREN_DTCM_Pos         (0UL)                     /*!< DTCM (Bit 0)                                          */
#define PWRCTRL_MEMPWREN_DTCM_Msk         (0x7UL)                   /*!< DTCM (Bitfield-Mask: 0x07)                            */
/* =====================================================  MEMPWRSTATUS  ====================================================== */
#define PWRCTRL_MEMPWRSTATUS_CACHEB2_Pos  (16UL)                    /*!< CACHEB2 (Bit 16)                                      */
#define PWRCTRL_MEMPWRSTATUS_CACHEB2_Msk  (0x10000UL)               /*!< CACHEB2 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_MEMPWRSTATUS_CACHEB0_Pos  (15UL)                    /*!< CACHEB0 (Bit 15)                                      */
#define PWRCTRL_MEMPWRSTATUS_CACHEB0_Msk  (0x8000UL)                /*!< CACHEB0 (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_MEMPWRSTATUS_FLASH1_Pos   (14UL)                    /*!< FLASH1 (Bit 14)                                       */
#define PWRCTRL_MEMPWRSTATUS_FLASH1_Msk   (0x4000UL)                /*!< FLASH1 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWRSTATUS_FLASH0_Pos   (13UL)                    /*!< FLASH0 (Bit 13)                                       */
#define PWRCTRL_MEMPWRSTATUS_FLASH0_Msk   (0x2000UL)                /*!< FLASH0 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWRSTATUS_SRAM9_Pos    (12UL)                    /*!< SRAM9 (Bit 12)                                        */
#define PWRCTRL_MEMPWRSTATUS_SRAM9_Msk    (0x1000UL)                /*!< SRAM9 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM8_Pos    (11UL)                    /*!< SRAM8 (Bit 11)                                        */
#define PWRCTRL_MEMPWRSTATUS_SRAM8_Msk    (0x800UL)                 /*!< SRAM8 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM7_Pos    (10UL)                    /*!< SRAM7 (Bit 10)                                        */
#define PWRCTRL_MEMPWRSTATUS_SRAM7_Msk    (0x400UL)                 /*!< SRAM7 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM6_Pos    (9UL)                     /*!< SRAM6 (Bit 9)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM6_Msk    (0x200UL)                 /*!< SRAM6 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM5_Pos    (8UL)                     /*!< SRAM5 (Bit 8)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM5_Msk    (0x100UL)                 /*!< SRAM5 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM4_Pos    (7UL)                     /*!< SRAM4 (Bit 7)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM4_Msk    (0x80UL)                  /*!< SRAM4 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM3_Pos    (6UL)                     /*!< SRAM3 (Bit 6)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM3_Msk    (0x40UL)                  /*!< SRAM3 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM2_Pos    (5UL)                     /*!< SRAM2 (Bit 5)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM2_Msk    (0x20UL)                  /*!< SRAM2 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM1_Pos    (4UL)                     /*!< SRAM1 (Bit 4)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM1_Msk    (0x10UL)                  /*!< SRAM1 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_SRAM0_Pos    (3UL)                     /*!< SRAM0 (Bit 3)                                         */
#define PWRCTRL_MEMPWRSTATUS_SRAM0_Msk    (0x8UL)                   /*!< SRAM0 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_DTCM1_Pos    (2UL)                     /*!< DTCM1 (Bit 2)                                         */
#define PWRCTRL_MEMPWRSTATUS_DTCM1_Msk    (0x4UL)                   /*!< DTCM1 (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_MEMPWRSTATUS_DTCM01_Pos   (1UL)                     /*!< DTCM01 (Bit 1)                                        */
#define PWRCTRL_MEMPWRSTATUS_DTCM01_Msk   (0x2UL)                   /*!< DTCM01 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWRSTATUS_DTCM00_Pos   (0UL)                     /*!< DTCM00 (Bit 0)                                        */
#define PWRCTRL_MEMPWRSTATUS_DTCM00_Msk   (0x1UL)                   /*!< DTCM00 (Bitfield-Mask: 0x01)                          */
/* =====================================================  DEVPWRSTATUS  ====================================================== */
#define PWRCTRL_DEVPWRSTATUS_BLEH_Pos     (9UL)                     /*!< BLEH (Bit 9)                                          */
#define PWRCTRL_DEVPWRSTATUS_BLEH_Msk     (0x200UL)                 /*!< BLEH (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_BLEL_Pos     (8UL)                     /*!< BLEL (Bit 8)                                          */
#define PWRCTRL_DEVPWRSTATUS_BLEL_Msk     (0x100UL)                 /*!< BLEL (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_PWRPDM_Pos   (7UL)                     /*!< PWRPDM (Bit 7)                                        */
#define PWRCTRL_DEVPWRSTATUS_PWRPDM_Msk   (0x80UL)                  /*!< PWRPDM (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_DEVPWRSTATUS_PWRMSPI_Pos  (6UL)                     /*!< PWRMSPI (Bit 6)                                       */
#define PWRCTRL_DEVPWRSTATUS_PWRMSPI_Msk  (0x40UL)                  /*!< PWRMSPI (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWRSTATUS_PWRADC_Pos   (5UL)                     /*!< PWRADC (Bit 5)                                        */
#define PWRCTRL_DEVPWRSTATUS_PWRADC_Msk   (0x20UL)                  /*!< PWRADC (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_DEVPWRSTATUS_HCPC_Pos     (4UL)                     /*!< HCPC (Bit 4)                                          */
#define PWRCTRL_DEVPWRSTATUS_HCPC_Msk     (0x10UL)                  /*!< HCPC (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_HCPB_Pos     (3UL)                     /*!< HCPB (Bit 3)                                          */
#define PWRCTRL_DEVPWRSTATUS_HCPB_Msk     (0x8UL)                   /*!< HCPB (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_HCPA_Pos     (2UL)                     /*!< HCPA (Bit 2)                                          */
#define PWRCTRL_DEVPWRSTATUS_HCPA_Msk     (0x4UL)                   /*!< HCPA (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_MCUH_Pos     (1UL)                     /*!< MCUH (Bit 1)                                          */
#define PWRCTRL_DEVPWRSTATUS_MCUH_Msk     (0x2UL)                   /*!< MCUH (Bitfield-Mask: 0x01)                            */
#define PWRCTRL_DEVPWRSTATUS_MCUL_Pos     (0UL)                     /*!< MCUL (Bit 0)                                          */
#define PWRCTRL_DEVPWRSTATUS_MCUL_Msk     (0x1UL)                   /*!< MCUL (Bitfield-Mask: 0x01)                            */
/* =======================================================  SRAMCTRL  ======================================================== */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Pos (8UL)                   /*!< SRAMLIGHTSLEEP (Bit 8)                                */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Msk (0xfff00UL)             /*!< SRAMLIGHTSLEEP (Bitfield-Mask: 0xfff)                 */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Pos (2UL)                /*!< SRAMMASTERCLKGATE (Bit 2)                             */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Msk (0x4UL)              /*!< SRAMMASTERCLKGATE (Bitfield-Mask: 0x01)               */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Pos  (1UL)                     /*!< SRAMCLKGATE (Bit 1)                                   */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Msk  (0x2UL)                   /*!< SRAMCLKGATE (Bitfield-Mask: 0x01)                     */
/* =======================================================  ADCSTATUS  ======================================================= */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Pos   (5UL)                     /*!< REFBUFPWD (Bit 5)                                     */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Msk   (0x20UL)                  /*!< REFBUFPWD (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Pos  (4UL)                     /*!< REFKEEPPWD (Bit 4)                                    */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Msk  (0x10UL)                  /*!< REFKEEPPWD (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_ADCSTATUS_VBATPWD_Pos     (3UL)                     /*!< VBATPWD (Bit 3)                                       */
#define PWRCTRL_ADCSTATUS_VBATPWD_Msk     (0x8UL)                   /*!< VBATPWD (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Pos    (2UL)                     /*!< VPTATPWD (Bit 2)                                      */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Msk    (0x4UL)                   /*!< VPTATPWD (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_ADCSTATUS_BGTPWD_Pos      (1UL)                     /*!< BGTPWD (Bit 1)                                        */
#define PWRCTRL_ADCSTATUS_BGTPWD_Msk      (0x2UL)                   /*!< BGTPWD (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_ADCSTATUS_ADCPWD_Pos      (0UL)                     /*!< ADCPWD (Bit 0)                                        */
#define PWRCTRL_ADCSTATUS_ADCPWD_Msk      (0x1UL)                   /*!< ADCPWD (Bitfield-Mask: 0x01)                          */
/* =========================================================  MISC  ========================================================== */
#define PWRCTRL_MISC_MEMVRLPBLE_Pos       (6UL)                     /*!< MEMVRLPBLE (Bit 6)                                    */
#define PWRCTRL_MISC_MEMVRLPBLE_Msk       (0x40UL)                  /*!< MEMVRLPBLE (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_MISC_FORCEMEMVRLPTIMERS_Pos (3UL)                   /*!< FORCEMEMVRLPTIMERS (Bit 3)                            */
#define PWRCTRL_MISC_FORCEMEMVRLPTIMERS_Msk (0x8UL)                 /*!< FORCEMEMVRLPTIMERS (Bitfield-Mask: 0x01)              */
/* =====================================================  DEVPWREVENTEN  ===================================================== */
#define PWRCTRL_DEVPWREVENTEN_BURSTEVEN_Pos (31UL)                  /*!< BURSTEVEN (Bit 31)                                    */
#define PWRCTRL_DEVPWREVENTEN_BURSTEVEN_Msk (0x80000000UL)          /*!< BURSTEVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_BURSTFEATUREEVEN_Pos (30UL)           /*!< BURSTFEATUREEVEN (Bit 30)                             */
#define PWRCTRL_DEVPWREVENTEN_BURSTFEATUREEVEN_Msk (0x40000000UL)   /*!< BURSTFEATUREEVEN (Bitfield-Mask: 0x01)                */
#define PWRCTRL_DEVPWREVENTEN_BLEFEATUREEVEN_Pos (29UL)             /*!< BLEFEATUREEVEN (Bit 29)                               */
#define PWRCTRL_DEVPWREVENTEN_BLEFEATUREEVEN_Msk (0x20000000UL)     /*!< BLEFEATUREEVEN (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_DEVPWREVENTEN_BLELEVEN_Pos (8UL)                    /*!< BLELEVEN (Bit 8)                                      */
#define PWRCTRL_DEVPWREVENTEN_BLELEVEN_Msk (0x100UL)                /*!< BLELEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Pos (7UL)                     /*!< PDMEVEN (Bit 7)                                       */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Msk (0x80UL)                  /*!< PDMEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Pos (6UL)                    /*!< MSPIEVEN (Bit 6)                                      */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Msk (0x40UL)                 /*!< MSPIEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Pos (5UL)                     /*!< ADCEVEN (Bit 5)                                       */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Msk (0x20UL)                  /*!< ADCEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Pos (4UL)                    /*!< HCPCEVEN (Bit 4)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Msk (0x10UL)                 /*!< HCPCEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Pos (3UL)                    /*!< HCPBEVEN (Bit 3)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Msk (0x8UL)                  /*!< HCPBEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Pos (2UL)                    /*!< HCPAEVEN (Bit 2)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Msk (0x4UL)                  /*!< HCPAEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Pos (1UL)                    /*!< MCUHEVEN (Bit 1)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Msk (0x2UL)                  /*!< MCUHEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Pos (0UL)                    /*!< MCULEVEN (Bit 0)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Msk (0x1UL)                  /*!< MCULEVEN (Bitfield-Mask: 0x01)                        */
/* =====================================================  MEMPWREVENTEN  ===================================================== */
#define PWRCTRL_MEMPWREVENTEN_CACHEB2EN_Pos (31UL)                  /*!< CACHEB2EN (Bit 31)                                    */
#define PWRCTRL_MEMPWREVENTEN_CACHEB2EN_Msk (0x80000000UL)          /*!< CACHEB2EN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_MEMPWREVENTEN_CACHEB0EN_Pos (30UL)                  /*!< CACHEB0EN (Bit 30)                                    */
#define PWRCTRL_MEMPWREVENTEN_CACHEB0EN_Msk (0x40000000UL)          /*!< CACHEB0EN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_MEMPWREVENTEN_FLASH1EN_Pos (14UL)                   /*!< FLASH1EN (Bit 14)                                     */
#define PWRCTRL_MEMPWREVENTEN_FLASH1EN_Msk (0x4000UL)               /*!< FLASH1EN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_MEMPWREVENTEN_FLASH0EN_Pos (13UL)                   /*!< FLASH0EN (Bit 13)                                     */
#define PWRCTRL_MEMPWREVENTEN_FLASH0EN_Msk (0x2000UL)               /*!< FLASH0EN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_MEMPWREVENTEN_SRAMEN_Pos  (3UL)                     /*!< SRAMEN (Bit 3)                                        */
#define PWRCTRL_MEMPWREVENTEN_SRAMEN_Msk  (0x1ff8UL)                /*!< SRAMEN (Bitfield-Mask: 0x3ff)                         */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Pos  (0UL)                     /*!< DTCMEN (Bit 0)                                        */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Msk  (0x7UL)                   /*!< DTCMEN (Bitfield-Mask: 0x07)                          */


