TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ==========================================================  SR  =========================================================== */
#define SCARD_SR_FHF_Pos                  (6UL)                     /*!< FHF (Bit 6)                                           */
#define SCARD_SR_FHF_Msk                  (0x40UL)                  /*!< FHF (Bitfield-Mask: 0x01)                             */
#define SCARD_SR_FT2REND_Pos              (5UL)                     /*!< FT2REND (Bit 5)                                       */
#define SCARD_SR_FT2REND_Msk              (0x20UL)                  /*!< FT2REND (Bitfield-Mask: 0x01)                         */
#define SCARD_SR_PE_Pos                   (4UL)                     /*!< PE (Bit 4)                                            */
#define SCARD_SR_PE_Msk                   (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define SCARD_SR_OVR_Pos                  (3UL)                     /*!< OVR (Bit 3)                                           */
#define SCARD_SR_OVR_Msk                  (0x8UL)                   /*!< OVR (Bitfield-Mask: 0x01)                             */
#define SCARD_SR_FER_Pos                  (2UL)                     /*!< FER (Bit 2)                                           */
#define SCARD_SR_FER_Msk                  (0x4UL)                   /*!< FER (Bitfield-Mask: 0x01)                             */
#define SCARD_SR_TBERBF_Pos               (1UL)                     /*!< TBERBF (Bit 1)                                        */
#define SCARD_SR_TBERBF_Msk               (0x2UL)                   /*!< TBERBF (Bitfield-Mask: 0x01)                          */
#define SCARD_SR_FNE_Pos                  (0UL)                     /*!< FNE (Bit 0)                                           */
#define SCARD_SR_FNE_Msk                  (0x1UL)                   /*!< FNE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  IER  ========================================================== */
#define SCARD_IER_FHFEN_Pos               (6UL)                     /*!< FHFEN (Bit 6)                                         */
#define SCARD_IER_FHFEN_Msk               (0x40UL)                  /*!< FHFEN (Bitfield-Mask: 0x01)                           */
#define SCARD_IER_FT2RENDEN_Pos           (5UL)                     /*!< FT2RENDEN (Bit 5)                                     */
#define SCARD_IER_FT2RENDEN_Msk           (0x20UL)                  /*!< FT2RENDEN (Bitfield-Mask: 0x01)                       */
#define SCARD_IER_PEEN_Pos                (4UL)                     /*!< PEEN (Bit 4)                                          */
#define SCARD_IER_PEEN_Msk                (0x10UL)                  /*!< PEEN (Bitfield-Mask: 0x01)                            */
#define SCARD_IER_OVREN_Pos               (3UL)                     /*!< OVREN (Bit 3)                                         */
#define SCARD_IER_OVREN_Msk               (0x8UL)                   /*!< OVREN (Bitfield-Mask: 0x01)                           */
#define SCARD_IER_FEREN_Pos               (2UL)                     /*!< FEREN (Bit 2)                                         */
#define SCARD_IER_FEREN_Msk               (0x4UL)                   /*!< FEREN (Bitfield-Mask: 0x01)                           */
#define SCARD_IER_TBERBFEN_Pos            (1UL)                     /*!< TBERBFEN (Bit 1)                                      */
#define SCARD_IER_TBERBFEN_Msk            (0x2UL)                   /*!< TBERBFEN (Bitfield-Mask: 0x01)                        */
#define SCARD_IER_FNEEN_Pos               (0UL)                     /*!< FNEEN (Bit 0)                                         */
#define SCARD_IER_FNEEN_Msk               (0x1UL)                   /*!< FNEEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  TCR  ========================================================== */
#define SCARD_TCR_DMAMD_Pos               (7UL)                     /*!< DMAMD (Bit 7)                                         */
#define SCARD_TCR_DMAMD_Msk               (0x80UL)                  /*!< DMAMD (Bitfield-Mask: 0x01)                           */
#define SCARD_TCR_FIP_Pos                 (6UL)                     /*!< FIP (Bit 6)                                           */
#define SCARD_TCR_FIP_Msk                 (0x40UL)                  /*!< FIP (Bitfield-Mask: 0x01)                             */
#define SCARD_TCR_AUTOCONV_Pos            (5UL)                     /*!< AUTOCONV (Bit 5)                                      */
#define SCARD_TCR_AUTOCONV_Msk            (0x20UL)                  /*!< AUTOCONV (Bitfield-Mask: 0x01)                        */
#define SCARD_TCR_PROT_Pos                (4UL)                     /*!< PROT (Bit 4)                                          */
#define SCARD_TCR_PROT_Msk                (0x10UL)                  /*!< PROT (Bitfield-Mask: 0x01)                            */
#define SCARD_TCR_TR_Pos                  (3UL)                     /*!< TR (Bit 3)                                            */
#define SCARD_TCR_TR_Msk                  (0x8UL)                   /*!< TR (Bitfield-Mask: 0x01)                              */
#define SCARD_TCR_LCT_Pos                 (2UL)                     /*!< LCT (Bit 2)                                           */
#define SCARD_TCR_LCT_Msk                 (0x4UL)                   /*!< LCT (Bitfield-Mask: 0x01)                             */
#define SCARD_TCR_SS_Pos                  (1UL)                     /*!< SS (Bit 1)                                            */
#define SCARD_TCR_SS_Msk                  (0x2UL)                   /*!< SS (Bitfield-Mask: 0x01)                              */
#define SCARD_TCR_CONV_Pos                (0UL)                     /*!< CONV (Bit 0)                                          */
#define SCARD_TCR_CONV_Msk                (0x1UL)                   /*!< CONV (Bitfield-Mask: 0x01)                            */
/* ==========================================================  UCR  ========================================================== */
#define SCARD_UCR_RETXEN_Pos              (3UL)                     /*!< RETXEN (Bit 3)                                        */
#define SCARD_UCR_RETXEN_Msk              (0x8UL)                   /*!< RETXEN (Bitfield-Mask: 0x01)                          */
#define SCARD_UCR_RSTIN_Pos               (2UL)                     /*!< RSTIN (Bit 2)                                         */
#define SCARD_UCR_RSTIN_Msk               (0x4UL)                   /*!< RSTIN (Bitfield-Mask: 0x01)                           */
#define SCARD_UCR_RIU_Pos                 (1UL)                     /*!< RIU (Bit 1)                                           */
#define SCARD_UCR_RIU_Msk                 (0x2UL)                   /*!< RIU (Bitfield-Mask: 0x01)                             */
#define SCARD_UCR_CST_Pos                 (0UL)                     /*!< CST (Bit 0)                                           */
#define SCARD_UCR_CST_Msk                 (0x1UL)                   /*!< CST (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define SCARD_DR_DR_Pos                   (0UL)                     /*!< DR (Bit 0)                                            */
#define SCARD_DR_DR_Msk                   (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                              */
/* =========================================================  BPRL  ========================================================== */
#define SCARD_BPRL_BPRL_Pos               (0UL)                     /*!< BPRL (Bit 0)                                          */
#define SCARD_BPRL_BPRL_Msk               (0xffUL)                  /*!< BPRL (Bitfield-Mask: 0xff)                            */
/* =========================================================  BPRH  ========================================================== */
#define SCARD_BPRH_BPRH_Pos               (0UL)                     /*!< BPRH (Bit 0)                                          */
#define SCARD_BPRH_BPRH_Msk               (0xfUL)                   /*!< BPRH (Bitfield-Mask: 0x0f)                            */
/* =========================================================  UCR1  ========================================================== */
#define SCARD_UCR1_ENLASTB_Pos            (5UL)                     /*!< ENLASTB (Bit 5)                                       */
#define SCARD_UCR1_ENLASTB_Msk            (0x20UL)                  /*!< ENLASTB (Bitfield-Mask: 0x01)                         */
#define SCARD_UCR1_CLKIOV_Pos             (4UL)                     /*!< CLKIOV (Bit 4)                                        */
#define SCARD_UCR1_CLKIOV_Msk             (0x10UL)                  /*!< CLKIOV (Bitfield-Mask: 0x01)                          */
#define SCARD_UCR1_T1PAREN_Pos            (3UL)                     /*!< T1PAREN (Bit 3)                                       */
#define SCARD_UCR1_T1PAREN_Msk            (0x8UL)                   /*!< T1PAREN (Bitfield-Mask: 0x01)                         */
#define SCARD_UCR1_STSP_Pos               (2UL)                     /*!< STSP (Bit 2)                                          */
#define SCARD_UCR1_STSP_Msk               (0x4UL)                   /*!< STSP (Bitfield-Mask: 0x01)                            */
#define SCARD_UCR1_PR_Pos                 (0UL)                     /*!< PR (Bit 0)                                            */
#define SCARD_UCR1_PR_Msk                 (0x1UL)                   /*!< PR (Bitfield-Mask: 0x01)                              */
/* ==========================================================  SR1  ========================================================== */
#define SCARD_SR1_IDLE_Pos                (3UL)                     /*!< IDLE (Bit 3)                                          */
#define SCARD_SR1_IDLE_Msk                (0x8UL)                   /*!< IDLE (Bitfield-Mask: 0x01)                            */
#define SCARD_SR1_SYNCEND_Pos             (2UL)                     /*!< SYNCEND (Bit 2)                                       */
#define SCARD_SR1_SYNCEND_Msk             (0x4UL)                   /*!< SYNCEND (Bitfield-Mask: 0x01)                         */
#define SCARD_SR1_PRL_Pos                 (1UL)                     /*!< PRL (Bit 1)                                           */
#define SCARD_SR1_PRL_Msk                 (0x2UL)                   /*!< PRL (Bitfield-Mask: 0x01)                             */
#define SCARD_SR1_ECNTOVER_Pos            (0UL)                     /*!< ECNTOVER (Bit 0)                                      */
#define SCARD_SR1_ECNTOVER_Msk            (0x1UL)                   /*!< ECNTOVER (Bitfield-Mask: 0x01)                        */
/* =========================================================  IER1  ========================================================== */
#define SCARD_IER1_SYNCENDEN_Pos          (2UL)                     /*!< SYNCENDEN (Bit 2)                                     */
#define SCARD_IER1_SYNCENDEN_Msk          (0x4UL)                   /*!< SYNCENDEN (Bitfield-Mask: 0x01)                       */
#define SCARD_IER1_PRLEN_Pos              (1UL)                     /*!< PRLEN (Bit 1)                                         */
#define SCARD_IER1_PRLEN_Msk              (0x2UL)                   /*!< PRLEN (Bitfield-Mask: 0x01)                           */
#define SCARD_IER1_ECNTOVEREN_Pos         (0UL)                     /*!< ECNTOVEREN (Bit 0)                                    */
#define SCARD_IER1_ECNTOVEREN_Msk         (0x1UL)                   /*!< ECNTOVEREN (Bitfield-Mask: 0x01)                      */
/* =========================================================  ECNTL  ========================================================= */
#define SCARD_ECNTL_ECNTL_Pos             (0UL)                     /*!< ECNTL (Bit 0)                                         */
#define SCARD_ECNTL_ECNTL_Msk             (0xffUL)                  /*!< ECNTL (Bitfield-Mask: 0xff)                           */
/* =========================================================  ECNTH  ========================================================= */
#define SCARD_ECNTH_ECNTH_Pos             (0UL)                     /*!< ECNTH (Bit 0)                                         */
#define SCARD_ECNTH_ECNTH_Msk             (0xffUL)                  /*!< ECNTH (Bitfield-Mask: 0xff)                           */
/* ==========================================================  GTR  ========================================================== */
#define SCARD_GTR_GTR_Pos                 (0UL)                     /*!< GTR (Bit 0)                                           */
#define SCARD_GTR_GTR_Msk                 (0xffUL)                  /*!< GTR (Bitfield-Mask: 0xff)                             */
/* ========================================================  RETXCNT  ======================================================== */
#define SCARD_RETXCNT_RETXCNT_Pos         (0UL)                     /*!< RETXCNT (Bit 0)                                       */
#define SCARD_RETXCNT_RETXCNT_Msk         (0xfUL)                   /*!< RETXCNT (Bitfield-Mask: 0x0f)                         */
/* ======================================================  RETXCNTRMI  ======================================================= */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Pos   (0UL)                     /*!< RETXCNTRMI (Bit 0)                                    */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Msk   (0xfUL)                   /*!< RETXCNTRMI (Bitfield-Mask: 0x0f)                      */
/* ========================================================  CLKCTRL  ======================================================== */
#define SCARD_CLKCTRL_APBCLKEN_Pos        (1UL)                     /*!< APBCLKEN (Bit 1)                                      */
#define SCARD_CLKCTRL_APBCLKEN_Msk        (0x2UL)                   /*!< APBCLKEN (Bitfield-Mask: 0x01)                        */
#define SCARD_CLKCTRL_CLKEN_Pos           (0UL)                     /*!< CLKEN (Bit 0)                                         */
#define SCARD_CLKCTRL_CLKEN_Msk           (0x1UL)                   /*!< CLKEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define SECURITY_CTRL_CRCERROR_Pos        (31UL)                    /*!< CRCERROR (Bit 31)                                     */
#define SECURITY_CTRL_CRCERROR_Msk        (0x80000000UL)            /*!< CRCERROR (Bitfield-Mask: 0x01)                        */
#define SECURITY_CTRL_FUNCTION_Pos        (4UL)                     /*!< FUNCTION (Bit 4)                                      */
#define SECURITY_CTRL_FUNCTION_Msk        (0xf0UL)                  /*!< FUNCTION (Bitfield-Mask: 0x0f)                        */
#define SECURITY_CTRL_ENABLE_Pos          (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define SECURITY_CTRL_ENABLE_Msk          (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  SRCADDR  ======================================================== */
#define SECURITY_SRCADDR_ADDR_Pos         (0UL)                     /*!< ADDR (Bit 0)                                          */
#define SECURITY_SRCADDR_ADDR_Msk         (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  LEN  ========================================================== */
#define SECURITY_LEN_LEN_Pos              (2UL)                     /*!< LEN (Bit 2)                                           */
#define SECURITY_LEN_LEN_Msk              (0xfffffcUL)              /*!< LEN (Bitfield-Mask: 0x3fffff)                         */
/* ========================================================  RESULT  ========================================================= */
#define SECURITY_RESULT_CRC_Pos           (0UL)                     /*!< CRC (Bit 0)                                           */
#define SECURITY_RESULT_CRC_Msk           (0xffffffffUL)            /*!< CRC (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  LOCKCTRL  ======================================================== */
#define SECURITY_LOCKCTRL_SELECT_Pos      (0UL)                     /*!< SELECT (Bit 0)                                        */
#define SECURITY_LOCKCTRL_SELECT_Msk      (0xffUL)                  /*!< SELECT (Bitfield-Mask: 0xff)                          */
/* =======================================================  LOCKSTAT  ======================================================== */
#define SECURITY_LOCKSTAT_STATUS_Pos      (0UL)                     /*!< STATUS (Bit 0)                                        */
#define SECURITY_LOCKSTAT_STATUS_Msk      (0xffffffffUL)            /*!< STATUS (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  KEY0  ========================================================== */
#define SECURITY_KEY0_KEY0_Pos            (0UL)                     /*!< KEY0 (Bit 0)                                          */
#define SECURITY_KEY0_KEY0_Msk            (0xffffffffUL)            /*!< KEY0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY1  ========================================================== */
#define SECURITY_KEY1_KEY1_Pos            (0UL)                     /*!< KEY1 (Bit 0)                                          */
#define SECURITY_KEY1_KEY1_Msk            (0xffffffffUL)            /*!< KEY1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY2  ========================================================== */
#define SECURITY_KEY2_KEY2_Pos            (0UL)                     /*!< KEY2 (Bit 0)                                          */
#define SECURITY_KEY2_KEY2_Msk            (0xffffffffUL)            /*!< KEY2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY3  ========================================================== */
#define SECURITY_KEY3_KEY3_Pos            (0UL)                     /*!< KEY3 (Bit 0)                                          */
#define SECURITY_KEY3_KEY3_Msk            (0xffffffffUL)            /*!< KEY3 (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */

