TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =======================================================  CMPRAUXA5  ======================================================= */
/* =======================================================  CMPRAUXB5  ======================================================= */
/* =========================================================  AUX5  ========================================================== */
/* ============================================  CTIMER AUX5 TMRB5EN23 [30..30]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRB5EN23                                                     */
  CTIMER_AUX5_TMRB5EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions.                                         */
  CTIMER_AUX5_TMRB5EN23_EN             = 0,     /*!< EN : Enable enhanced functions.                                           */
} CTIMER_AUX5_TMRB5EN23_Enum;

/* ============================================  CTIMER AUX5 TMRB5POL23 [29..29]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX5_TMRB5POL23                                                    */
  CTIMER_AUX5_TMRB5POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity                                       */
  CTIMER_AUX5_TMRB5POL23_INV           = 1,     /*!< INV : Upper output inverted polarity.                                     */
} CTIMER_AUX5_TMRB5POL23_Enum;

/* ============================================  CTIMER AUX5 TMRB5TINV [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRB5TINV                                                     */
  CTIMER_AUX5_TMRB5TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger                                           */
  CTIMER_AUX5_TMRB5TINV_EN             = 1,     /*!< EN : Enable invert on trigger                                             */
} CTIMER_AUX5_TMRB5TINV_Enum;

/* ===========================================  CTIMER AUX5 TMRB5NOSYNC [27..27]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX5_TMRB5NOSYNC                                                   */
  CTIMER_AUX5_TMRB5NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock                                     */
  CTIMER_AUX5_TMRB5NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock                               */
} CTIMER_AUX5_TMRB5NOSYNC_Enum;

/* ============================================  CTIMER AUX5 TMRB5TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRB5TRIG                                                     */
  CTIMER_AUX5_TMRB5TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled.                                         */
  CTIMER_AUX5_TMRB5TRIG_A5OUT          = 1,     /*!< A5OUT : Trigger source is CTIMERA5 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_A6OUT          = 4,     /*!< A6OUT : Trigger source is CTIMERA6 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_B6OUT          = 5,     /*!< B6OUT : Trigger source is CTIMERB6 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_A1OUT          = 6,     /*!< A1OUT : Trigger source is CTIMERA1 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_B1OUT          = 7,     /*!< B1OUT : Trigger source is CTIMERB1 OUT.                                   */
  CTIMER_AUX5_TMRB5TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2.                                 */
  CTIMER_AUX5_TMRB5TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2.                                 */
  CTIMER_AUX5_TMRB5TRIG_A0OUT2         = 10,    /*!< A0OUT2 : Trigger source is CTIMERA0 OUT2.                                 */
  CTIMER_AUX5_TMRB5TRIG_B0OUT2         = 11,    /*!< B0OUT2 : Trigger source is CTIMERB0 OUT2.                                 */
  CTIMER_AUX5_TMRB5TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge.                  */
  CTIMER_AUX5_TMRB5TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge.                  */
  CTIMER_AUX5_TMRB5TRIG_B4OUT2DUAL     = 14,    /*!< B4OUT2DUAL : Trigger source is CTIMERB4 OUT2, dual edge.                  */
  CTIMER_AUX5_TMRB5TRIG_A4OUT2DUAL     = 15,    /*!< A4OUT2DUAL : Trigger source is CTIMERA4 OUT2, dual edge.                  */
} CTIMER_AUX5_TMRB5TRIG_Enum;

/* ============================================  CTIMER AUX5 TMRA5EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRA5EN23                                                     */
  CTIMER_AUX5_TMRA5EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions.                                         */
  CTIMER_AUX5_TMRA5EN23_EN             = 0,     /*!< EN : Enable enhanced functions.                                           */
} CTIMER_AUX5_TMRA5EN23_Enum;

/* ============================================  CTIMER AUX5 TMRA5POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX5_TMRA5POL23                                                    */
  CTIMER_AUX5_TMRA5POL23_NORMAL        = 0,     /*!< NORMAL : Upper output normal polarity                                     */
  CTIMER_AUX5_TMRA5POL23_INV           = 1,     /*!< INV : Upper output inverted polarity.                                     */
} CTIMER_AUX5_TMRA5POL23_Enum;

