TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO PADREGL PAD46PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGL_PAD46PULL                                                    */
  GPIO_PADREGL_PAD46PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGL_PAD46PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGL_PAD46PULL_Enum;

/* ===========================================  GPIO PADREGL PAD45FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGL_PAD45FNCSEL                                                  */
  GPIO_PADREGL_PAD45FNCSEL_UA1CTS      = 0,     /*!< UA1CTS : Configure as the UART1 CTS input signal                          */
  GPIO_PADREGL_PAD45FNCSEL_NCE45       = 1,     /*!< NCE45 : IOM/MSPI nCE group 45                                             */
  GPIO_PADREGL_PAD45FNCSEL_CT22        = 2,     /*!< CT22 : CTIMER connection 22                                               */
  GPIO_PADREGL_PAD45FNCSEL_GPIO45      = 3,     /*!< GPIO45 : Configure as GPIO45                                              */
  GPIO_PADREGL_PAD45FNCSEL_I2SDAT      = 4,     /*!< I2SDAT : I2S serial data output                                           */
  GPIO_PADREGL_PAD45FNCSEL_PDMDATA     = 5,     /*!< PDMDATA : PDM serial data input                                           */
  GPIO_PADREGL_PAD45FNCSEL_UART0RX     = 6,     /*!< UART0RX : Configure as the SPI channel 5 nCE signal from IOMSTR5          */
  GPIO_PADREGL_PAD45FNCSEL_SWO         = 7,     /*!< SWO : Configure as the serial wire debug SWO signal                       */
} GPIO_PADREGL_PAD45FNCSEL_Enum;

/* ===========================================  GPIO PADREGL PAD45STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGL_PAD45STRNG                                                   */
  GPIO_PADREGL_PAD45STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGL_PAD45STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGL_PAD45STRNG_Enum;

/* ============================================  GPIO PADREGL PAD45INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGL_PAD45INPEN                                                   */
  GPIO_PADREGL_PAD45INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGL_PAD45INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGL_PAD45INPEN_Enum;

/* =============================================  GPIO PADREGL PAD45PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGL_PAD45PULL                                                    */
  GPIO_PADREGL_PAD45PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGL_PAD45PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGL_PAD45PULL_Enum;

/* ============================================  GPIO PADREGL PAD44FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGL_PAD44FNCSEL                                                  */
  GPIO_PADREGL_PAD44FNCSEL_UA1RTS      = 0,     /*!< UA1RTS : Configure as the UART1 RTS output signal                         */
  GPIO_PADREGL_PAD44FNCSEL_NCE44       = 1,     /*!< NCE44 : IOM/MSPI nCE group 44                                             */
  GPIO_PADREGL_PAD44FNCSEL_CT20        = 2,     /*!< CT20 : CTIMER connection 20                                               */
  GPIO_PADREGL_PAD44FNCSEL_GPIO44      = 3,     /*!< GPIO44 : Configure as GPIO44                                              */
  GPIO_PADREGL_PAD44FNCSEL_M4MOSI      = 5,     /*!< M4MOSI : Configure as the IOMSTR4 SPI MOSI signal                         */
  GPIO_PADREGL_PAD44FNCSEL_M5nCE6      = 6,     /*!< M5nCE6 : Configure as the SPI channel 6 nCE signal from IOMSTR5           */
} GPIO_PADREGL_PAD44FNCSEL_Enum;

/* ============================================  GPIO PADREGL PAD44STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGL_PAD44STRNG                                                   */
  GPIO_PADREGL_PAD44STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGL_PAD44STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGL_PAD44STRNG_Enum;

/* ============================================  GPIO PADREGL PAD44INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGL_PAD44INPEN                                                   */
  GPIO_PADREGL_PAD44INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGL_PAD44INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGL_PAD44INPEN_Enum;

/* =============================================  GPIO PADREGL PAD44PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGL_PAD44PULL                                                    */
  GPIO_PADREGL_PAD44PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGL_PAD44PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGL_PAD44PULL_Enum;

/* ========================================================  PADREGM  ======================================================== */
/* ===========================================  GPIO PADREGM PAD51FNCSEL [27..29]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGM_PAD51FNCSEL                                                  */
  GPIO_PADREGM_PAD51FNCSEL_MSPI1_0     = 0,     /*!< MSPI1_0 : Configure as the MSPI1 0 signal                                 */
  GPIO_PADREGM_PAD51FNCSEL_NCE51       = 1,     /*!< NCE51 : IOM/MSPI nCE group 51                                             */
  GPIO_PADREGM_PAD51FNCSEL_CT1         = 2,     /*!< CT1 : CTIMER connection 1                                                 */
  GPIO_PADREGM_PAD51FNCSEL_GPIO51      = 3,     /*!< GPIO51 : Configure as GPIO51                                              */
} GPIO_PADREGM_PAD51FNCSEL_Enum;

/* ===========================================  GPIO PADREGM PAD51STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGM_PAD51STRNG                                                   */
  GPIO_PADREGM_PAD51STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGM_PAD51STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGM_PAD51STRNG_Enum;

/* ===========================================  GPIO PADREGM PAD51INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGM_PAD51INPEN                                                   */
  GPIO_PADREGM_PAD51INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGM_PAD51INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGM_PAD51INPEN_Enum;

/* ============================================  GPIO PADREGM PAD51PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGM_PAD51PULL                                                    */
  GPIO_PADREGM_PAD51PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGM_PAD51PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGM_PAD51PULL_Enum;

/* ===========================================  GPIO PADREGM PAD50FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGM_PAD50FNCSEL                                                  */
  GPIO_PADREGM_PAD50FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGM_PAD50FNCSEL_NCE50       = 1,     /*!< NCE50 : IOM/MSPI nCE group 50                                             */
  GPIO_PADREGM_PAD50FNCSEL_CT0         = 2,     /*!< CT0 : CTIMER connection 0                                                 */
  GPIO_PADREGM_PAD50FNCSEL_GPIO50      = 3,     /*!< GPIO50 : Configure as GPIO50                                              */
  GPIO_PADREGM_PAD50FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGM_PAD50FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGM_PAD50FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGM_PAD50FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGM_PAD50FNCSEL_Enum;

