TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO PADREGN PAD52FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD52FNCSEL                                                  */
  GPIO_PADREGN_PAD52FNCSEL_MSPI1_1     = 0,     /*!< MSPI1_1 : Configure as the MSPI1 1 signal                                 */
  GPIO_PADREGN_PAD52FNCSEL_NCE52       = 1,     /*!< NCE52 : IOM/MSPI nCE group 52                                             */
  GPIO_PADREGN_PAD52FNCSEL_CT2         = 2,     /*!< CT2 : CTIMER connection 2                                                 */
  GPIO_PADREGN_PAD52FNCSEL_GPIO52      = 3,     /*!< GPIO52 : Configure as GPIO52                                              */
} GPIO_PADREGN_PAD52FNCSEL_Enum;

/* ============================================  GPIO PADREGN PAD52STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGN_PAD52STRNG                                                   */
  GPIO_PADREGN_PAD52STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGN_PAD52STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGN_PAD52STRNG_Enum;

/* ============================================  GPIO PADREGN PAD52INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGN_PAD52INPEN                                                   */
  GPIO_PADREGN_PAD52INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGN_PAD52INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGN_PAD52INPEN_Enum;

/* =============================================  GPIO PADREGN PAD52PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGN_PAD52PULL                                                    */
  GPIO_PADREGN_PAD52PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGN_PAD52PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGN_PAD52PULL_Enum;

/* ========================================================  PADREGO  ======================================================== */
/* ===========================================  GPIO PADREGO PAD59FNCSEL [27..29]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGO_PAD59FNCSEL                                                  */
  GPIO_PADREGO_PAD59FNCSEL_MSPI1_8     = 0,     /*!< MSPI1_8 : Configure as the MSPI1 8 signal                                 */
  GPIO_PADREGO_PAD59FNCSEL_NCE59       = 1,     /*!< NCE59 : IOM/MSPI nCE group 59                                             */
  GPIO_PADREGO_PAD59FNCSEL_CT9         = 2,     /*!< CT9 : CTIMER connection 9                                                 */
  GPIO_PADREGO_PAD59FNCSEL_GPIO59      = 3,     /*!< GPIO59 : Configure as GPIO59                                              */
} GPIO_PADREGO_PAD59FNCSEL_Enum;

/* ===========================================  GPIO PADREGO PAD59STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD59STRNG                                                   */
  GPIO_PADREGO_PAD59STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGO_PAD59STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGO_PAD59STRNG_Enum;

/* ===========================================  GPIO PADREGO PAD59INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD59INPEN                                                   */
  GPIO_PADREGO_PAD59INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGO_PAD59INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGO_PAD59INPEN_Enum;

/* ============================================  GPIO PADREGO PAD59PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD59PULL                                                    */
  GPIO_PADREGO_PAD59PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGO_PAD59PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGO_PAD59PULL_Enum;

/* ===========================================  GPIO PADREGO PAD58FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGO_PAD58FNCSEL                                                  */
  GPIO_PADREGO_PAD58FNCSEL_MSPI1_7     = 0,     /*!< MSPI1_7 : Configure as the MSPI1 7 signal                                 */
  GPIO_PADREGO_PAD58FNCSEL_NCE58       = 1,     /*!< NCE58 : IOM/MSPI nCE group 58                                             */
  GPIO_PADREGO_PAD58FNCSEL_CT8         = 2,     /*!< CT8 : CTIMER connection 8                                                 */
  GPIO_PADREGO_PAD58FNCSEL_GPIO58      = 3,     /*!< GPIO58 : Configure as GPIO58                                              */
} GPIO_PADREGO_PAD58FNCSEL_Enum;

/* ===========================================  GPIO PADREGO PAD58STRNG [18..18]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD58STRNG                                                   */
  GPIO_PADREGO_PAD58STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGO_PAD58STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGO_PAD58STRNG_Enum;

/* ===========================================  GPIO PADREGO PAD58INPEN [17..17]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD58INPEN                                                   */
  GPIO_PADREGO_PAD58INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGO_PAD58INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGO_PAD58INPEN_Enum;

/* ============================================  GPIO PADREGO PAD58PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD58PULL                                                    */
  GPIO_PADREGO_PAD58PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGO_PAD58PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGO_PAD58PULL_Enum;

/* ===========================================  GPIO PADREGO PAD57FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGO_PAD57FNCSEL                                                  */
  GPIO_PADREGO_PAD57FNCSEL_MSPI1_6     = 0,     /*!< MSPI1_6 : Configure as the MSPI1 6 signal                                 */
  GPIO_PADREGO_PAD57FNCSEL_NCE57       = 1,     /*!< NCE57 : IOM/MSPI nCE group 57                                             */
  GPIO_PADREGO_PAD57FNCSEL_CT7         = 2,     /*!< CT7 : CTIMER connection 7                                                 */
  GPIO_PADREGO_PAD57FNCSEL_GPIO57      = 3,     /*!< GPIO57 : Configure as GPIO57                                              */
} GPIO_PADREGO_PAD57FNCSEL_Enum;

/* ===========================================  GPIO PADREGO PAD57STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD57STRNG                                                   */
  GPIO_PADREGO_PAD57STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGO_PAD57STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGO_PAD57STRNG_Enum;

/* ============================================  GPIO PADREGO PAD57INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGO_PAD57INPEN                                                   */
  GPIO_PADREGO_PAD57INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGO_PAD57INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGO_PAD57INPEN_Enum;

