TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ===========================================  GPIO PADREGP PAD61FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGP_PAD61FNCSEL                                                  */
  GPIO_PADREGP_PAD61FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGP_PAD61FNCSEL_NCE61       = 1,     /*!< NCE61 : IOM/MSPI nCE group 61                                             */
  GPIO_PADREGP_PAD61FNCSEL_CT11        = 2,     /*!< CT11 : CTIMER connection 11                                               */
  GPIO_PADREGP_PAD61FNCSEL_GPIO61      = 3,     /*!< GPIO61 : Configure as GPIO61                                              */
  GPIO_PADREGP_PAD61FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGP_PAD61FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGP_PAD61FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGP_PAD61FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGP_PAD61FNCSEL_Enum;

/* ===========================================  GPIO PADREGP PAD61STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD61STRNG                                                   */
  GPIO_PADREGP_PAD61STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGP_PAD61STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGP_PAD61STRNG_Enum;

/* ============================================  GPIO PADREGP PAD61INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGP_PAD61INPEN                                                   */
  GPIO_PADREGP_PAD61INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGP_PAD61INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGP_PAD61INPEN_Enum;

/* =============================================  GPIO PADREGP PAD61PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGP_PAD61PULL                                                    */
  GPIO_PADREGP_PAD61PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGP_PAD61PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGP_PAD61PULL_Enum;

/* ============================================  GPIO PADREGP PAD60FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD60FNCSEL                                                  */
  GPIO_PADREGP_PAD60FNCSEL_MSPI1_9     = 0,     /*!< MSPI1_9 : Configure as the MSPI1 9 signal                                 */
  GPIO_PADREGP_PAD60FNCSEL_NCE60       = 1,     /*!< NCE60 : IOM/MSPI nCE group 60                                             */
  GPIO_PADREGP_PAD60FNCSEL_CT10        = 2,     /*!< CT10 : CTIMER connection 10                                               */
  GPIO_PADREGP_PAD60FNCSEL_GPIO60      = 3,     /*!< GPIO60 : Configure as GPIO60                                              */
} GPIO_PADREGP_PAD60FNCSEL_Enum;

/* ============================================  GPIO PADREGP PAD60STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGP_PAD60STRNG                                                   */
  GPIO_PADREGP_PAD60STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGP_PAD60STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGP_PAD60STRNG_Enum;

/* ============================================  GPIO PADREGP PAD60INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGP_PAD60INPEN                                                   */
  GPIO_PADREGP_PAD60INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGP_PAD60INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGP_PAD60INPEN_Enum;

/* =============================================  GPIO PADREGP PAD60PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGP_PAD60PULL                                                    */
  GPIO_PADREGP_PAD60PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGP_PAD60PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGP_PAD60PULL_Enum;

/* ========================================================  PADREGQ  ======================================================== */
/* ===========================================  GPIO PADREGQ PAD67FNCSEL [27..29]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD67FNCSEL                                                  */
  GPIO_PADREGQ_PAD67FNCSEL_MSPI2_3     = 0,     /*!< MSPI2_3 : Configure as the MSPI2 3 signal                                 */
  GPIO_PADREGQ_PAD67FNCSEL_NCE67       = 1,     /*!< NCE67 : IOM/MSPI nCE group 67                                             */
  GPIO_PADREGQ_PAD67FNCSEL_CT17        = 2,     /*!< CT17 : CTIMER connection 17                                               */
  GPIO_PADREGQ_PAD67FNCSEL_GPIO67      = 3,     /*!< GPIO67 : Configure as GPIO67                                              */
} GPIO_PADREGQ_PAD67FNCSEL_Enum;

