TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ===========================================  GPIO PADREGQ PAD67STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD67STRNG                                                   */
  GPIO_PADREGQ_PAD67STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGQ_PAD67STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGQ_PAD67STRNG_Enum;

/* ===========================================  GPIO PADREGQ PAD67INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD67INPEN                                                   */
  GPIO_PADREGQ_PAD67INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGQ_PAD67INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGQ_PAD67INPEN_Enum;

/* ============================================  GPIO PADREGQ PAD67PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD67PULL                                                    */
  GPIO_PADREGQ_PAD67PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGQ_PAD67PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGQ_PAD67PULL_Enum;

/* ===========================================  GPIO PADREGQ PAD66FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD66FNCSEL                                                  */
  GPIO_PADREGQ_PAD66FNCSEL_MSPI2_2     = 0,     /*!< MSPI2_2 : Configure as the MSPI2 2 signal                                 */
  GPIO_PADREGQ_PAD66FNCSEL_NCE66       = 1,     /*!< NCE66 : IOM/MSPI nCE group 66                                             */
  GPIO_PADREGQ_PAD66FNCSEL_CT16        = 2,     /*!< CT16 : CTIMER connection 16                                               */
  GPIO_PADREGQ_PAD66FNCSEL_GPIO66      = 3,     /*!< GPIO66 : Configure as GPIO66                                              */
} GPIO_PADREGQ_PAD66FNCSEL_Enum;

/* ===========================================  GPIO PADREGQ PAD66STRNG [18..18]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD66STRNG                                                   */
  GPIO_PADREGQ_PAD66STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGQ_PAD66STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGQ_PAD66STRNG_Enum;

/* ===========================================  GPIO PADREGQ PAD66INPEN [17..17]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD66INPEN                                                   */
  GPIO_PADREGQ_PAD66INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGQ_PAD66INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGQ_PAD66INPEN_Enum;

/* ============================================  GPIO PADREGQ PAD66PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD66PULL                                                    */
  GPIO_PADREGQ_PAD66PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGQ_PAD66PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGQ_PAD66PULL_Enum;

/* ===========================================  GPIO PADREGQ PAD65FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD65FNCSEL                                                  */
  GPIO_PADREGQ_PAD65FNCSEL_MSPI2_1     = 0,     /*!< MSPI2_1 : Configure as the MSPI2 1 signal                                 */
  GPIO_PADREGQ_PAD65FNCSEL_NCE65       = 1,     /*!< NCE65 : IOM/MSPI nCE group 65                                             */
  GPIO_PADREGQ_PAD65FNCSEL_CT15        = 2,     /*!< CT15 : CTIMER connection 15                                               */
  GPIO_PADREGQ_PAD65FNCSEL_GPIO65      = 3,     /*!< GPIO65 : Configure as GPIO65                                              */
} GPIO_PADREGQ_PAD65FNCSEL_Enum;

/* ===========================================  GPIO PADREGQ PAD65STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD65STRNG                                                   */
  GPIO_PADREGQ_PAD65STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGQ_PAD65STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGQ_PAD65STRNG_Enum;

/* ============================================  GPIO PADREGQ PAD65INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD65INPEN                                                   */
  GPIO_PADREGQ_PAD65INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGQ_PAD65INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGQ_PAD65INPEN_Enum;

/* =============================================  GPIO PADREGQ PAD65PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD65PULL                                                    */
  GPIO_PADREGQ_PAD65PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGQ_PAD65PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGQ_PAD65PULL_Enum;

/* ============================================  GPIO PADREGQ PAD64FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD64FNCSEL                                                  */
  GPIO_PADREGQ_PAD64FNCSEL_MSPI2_0     = 0,     /*!< MSPI2_0 : Configure as the MSPI2 0 signal                                 */
  GPIO_PADREGQ_PAD64FNCSEL_NCE64       = 1,     /*!< NCE64 : IOM/MSPI nCE group 64                                             */
  GPIO_PADREGQ_PAD64FNCSEL_CT14        = 2,     /*!< CT14 : CTIMER connection 14                                               */
  GPIO_PADREGQ_PAD64FNCSEL_GPIO64      = 3,     /*!< GPIO64 : Configure as GPIO64                                              */
} GPIO_PADREGQ_PAD64FNCSEL_Enum;

/* ============================================  GPIO PADREGQ PAD64STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD64STRNG                                                   */
  GPIO_PADREGQ_PAD64STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGQ_PAD64STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGQ_PAD64STRNG_Enum;

/* ============================================  GPIO PADREGQ PAD64INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD64INPEN                                                   */
  GPIO_PADREGQ_PAD64INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGQ_PAD64INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGQ_PAD64INPEN_Enum;

