TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ===========================================  GPIO PADREGR PAD69FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGR_PAD69FNCSEL                                                  */
  GPIO_PADREGR_PAD69FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGR_PAD69FNCSEL_NCE69       = 1,     /*!< NCE69 : IOM/MSPI nCE group 69                                             */
  GPIO_PADREGR_PAD69FNCSEL_CT19        = 2,     /*!< CT19 : CTIMER connection 19                                               */
  GPIO_PADREGR_PAD69FNCSEL_GPIO69      = 3,     /*!< GPIO69 : Configure as GPIO69                                              */
  GPIO_PADREGR_PAD69FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGR_PAD69FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGR_PAD69FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGR_PAD69FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGR_PAD69FNCSEL_Enum;

/* ===========================================  GPIO PADREGR PAD69STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD69STRNG                                                   */
  GPIO_PADREGR_PAD69STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGR_PAD69STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGR_PAD69STRNG_Enum;

/* ============================================  GPIO PADREGR PAD69INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGR_PAD69INPEN                                                   */
  GPIO_PADREGR_PAD69INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGR_PAD69INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGR_PAD69INPEN_Enum;

/* =============================================  GPIO PADREGR PAD69PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGR_PAD69PULL                                                    */
  GPIO_PADREGR_PAD69PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGR_PAD69PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGR_PAD69PULL_Enum;

/* ============================================  GPIO PADREGR PAD68FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD68FNCSEL                                                  */
  GPIO_PADREGR_PAD68FNCSEL_MSPI2_4     = 0,     /*!< MSPI2_4 : Configure as the MSPI2 4 signal                                 */
  GPIO_PADREGR_PAD68FNCSEL_NCE68       = 1,     /*!< NCE68 : IOM/MSPI nCE group 68                                             */
  GPIO_PADREGR_PAD68FNCSEL_CT18        = 2,     /*!< CT18 : CTIMER connection 18                                               */
  GPIO_PADREGR_PAD68FNCSEL_GPIO68      = 3,     /*!< GPIO68 : Configure as GPIO68                                              */
} GPIO_PADREGR_PAD68FNCSEL_Enum;

/* ============================================  GPIO PADREGR PAD68STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGR_PAD68STRNG                                                   */
  GPIO_PADREGR_PAD68STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGR_PAD68STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGR_PAD68STRNG_Enum;

/* ============================================  GPIO PADREGR PAD68INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGR_PAD68INPEN                                                   */
  GPIO_PADREGR_PAD68INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGR_PAD68INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGR_PAD68INPEN_Enum;

/* =============================================  GPIO PADREGR PAD68PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGR_PAD68PULL                                                    */
  GPIO_PADREGR_PAD68PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGR_PAD68PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGR_PAD68PULL_Enum;

/* ========================================================  PADREGS  ======================================================== */
/* ===========================================  GPIO PADREGS PAD73FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGS_PAD73FNCSEL                                                  */
  GPIO_PADREGS_PAD73FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGS_PAD73FNCSEL_NCE73       = 1,     /*!< NCE73 : IOM/MSPI nCE group 73                                             */
  GPIO_PADREGS_PAD73FNCSEL_CT23        = 2,     /*!< CT23 : CTIMER connection 23                                               */
  GPIO_PADREGS_PAD73FNCSEL_GPIO73      = 3,     /*!< GPIO73 : Configure as GPIO73                                              */
  GPIO_PADREGS_PAD73FNCSEL_UA0CTS      = 4,     /*!< UA0CTS : Configure as the UART0 CTS input                                 */
  GPIO_PADREGS_PAD73FNCSEL_UA0RTS      = 5,     /*!< UA0RTS : Configure as the UART0 RTS output                                */
  GPIO_PADREGS_PAD73FNCSEL_UA1CTS      = 6,     /*!< UA1CTS : Configure as the UART1 CTS input                                 */
  GPIO_PADREGS_PAD73FNCSEL_UA1RTS      = 7,     /*!< UA1RTS : Configure as the UART1 RTS output                                */
} GPIO_PADREGS_PAD73FNCSEL_Enum;

