TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =============================================  GPIO CFGA GPIO4INTD [19..19]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO4INTD                                                       */
  GPIO_CFGA_GPIO4INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD4FNCSEL = NCE4 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO4INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD4FNCSEL = NCE4 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO4INTD_Enum;

/* ============================================  GPIO CFGA GPIO4OUTCFG [17..18]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO4OUTCFG                                                     */
  GPIO_CFGA_GPIO4OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD4FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO4OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD4FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO4OUTCFG_OD             = 2,     /*!< OD : Applies when PAD4FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO4OUTCFG_TS             = 3,     /*!< TS : Applies when PAD4FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO4OUTCFG_Enum;

/* =============================================  GPIO CFGA GPIO4INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO4INCFG                                                      */
  GPIO_CFGA_GPIO4INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO4INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGA_GPIO4INCFG_Enum;

/* =============================================  GPIO CFGA GPIO3INTD [15..15]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO3INTD                                                       */
  GPIO_CFGA_GPIO3INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD3FNCSEL = NCE3 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO3INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD3FNCSEL = NCE3 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO3INTD_Enum;

/* ============================================  GPIO CFGA GPIO3OUTCFG [13..14]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO3OUTCFG                                                     */
  GPIO_CFGA_GPIO3OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD3FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO3OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD3FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO3OUTCFG_OD             = 2,     /*!< OD : Applies when PAD3FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO3OUTCFG_TS             = 3,     /*!< TS : Applies when PAD3FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO3OUTCFG_Enum;

/* =============================================  GPIO CFGA GPIO3INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO3INCFG                                                      */
  GPIO_CFGA_GPIO3INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO3INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGA_GPIO3INCFG_Enum;

/* =============================================  GPIO CFGA GPIO2INTD [11..11]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO2INTD                                                       */
  GPIO_CFGA_GPIO2INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD2FNCSEL = NCE2 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO2INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD2FNCSEL = NCE2 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO2INTD_Enum;

/* =============================================  GPIO CFGA GPIO2OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO2OUTCFG                                                     */
  GPIO_CFGA_GPIO2OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD2FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO2OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD2FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO2OUTCFG_OD             = 2,     /*!< OD : Applies when PAD2FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO2OUTCFG_TS             = 3,     /*!< TS : Applies when PAD2FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO2OUTCFG_Enum;

/* ==============================================  GPIO CFGA GPIO2INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO2INCFG                                                      */
  GPIO_CFGA_GPIO2INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO2INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGA_GPIO2INCFG_Enum;

/* ==============================================  GPIO CFGA GPIO1INTD [7..7]  =============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO1INTD                                                       */
  GPIO_CFGA_GPIO1INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD1FNCSEL = NCE1 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO1INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD1FNCSEL = NCE1 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO1INTD_Enum;

