TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =============================================  GPIO CFGA GPIO1OUTCFG [5..6]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO1OUTCFG                                                     */
  GPIO_CFGA_GPIO1OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD1FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO1OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD1FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO1OUTCFG_OD             = 2,     /*!< OD : Applies when PAD1FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO1OUTCFG_TS             = 3,     /*!< TS : Applies when PAD1FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO1OUTCFG_Enum;

/* ==============================================  GPIO CFGA GPIO1INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO1INCFG                                                      */
  GPIO_CFGA_GPIO1INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO1INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGA_GPIO1INCFG_Enum;

/* ==============================================  GPIO CFGA GPIO0INTD [3..3]  =============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO0INTD                                                       */
  GPIO_CFGA_GPIO0INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD0FNCSEL = NCE0 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO0INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD0FNCSEL = NCE0 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO0INTD_Enum;

/* =============================================  GPIO CFGA GPIO0OUTCFG [1..2]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO0OUTCFG                                                     */
  GPIO_CFGA_GPIO0OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD0FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO0OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD0FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO0OUTCFG_OD             = 2,     /*!< OD : Applies when PAD0FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO0OUTCFG_TS             = 3,     /*!< TS : Applies when PAD0FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO0OUTCFG_Enum;

/* ==============================================  GPIO CFGA GPIO0INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO0INCFG                                                      */
  GPIO_CFGA_GPIO0INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO0INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGA_GPIO0INCFG_Enum;

/* =========================================================  CFGB  ========================================================== */
/* =============================================  GPIO CFGB GPIO15INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO15INTD                                                      */
  GPIO_CFGB_GPIO15INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD15FNCSEL = NCE15 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO15INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD15FNCSEL = NCE15 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO15INTD_Enum;

/* ============================================  GPIO CFGB GPIO15OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGB_GPIO15OUTCFG                                                    */
  GPIO_CFGB_GPIO15OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD15FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO15OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD15FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO15OUTCFG_OD            = 2,     /*!< OD : Applies when PAD15FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO15OUTCFG_TS            = 3,     /*!< TS : Applies when PAD15FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO15OUTCFG_Enum;

/* ============================================  GPIO CFGB GPIO15INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO15INCFG                                                     */
  GPIO_CFGB_GPIO15INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO15INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO15INCFG_Enum;

/* =============================================  GPIO CFGB GPIO14INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO14INTD                                                      */
  GPIO_CFGB_GPIO14INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD14FNCSEL = NCE14 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO14INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD14FNCSEL = NCE14 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO14INTD_Enum;

/* ============================================  GPIO CFGB GPIO14OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGB_GPIO14OUTCFG                                                    */
  GPIO_CFGB_GPIO14OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD14FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO14OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD14FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO14OUTCFG_OD            = 2,     /*!< OD : Applies when PAD14FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO14OUTCFG_TS            = 3,     /*!< TS : Applies when PAD14FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO14OUTCFG_Enum;

/* ============================================  GPIO CFGB GPIO14INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO14INCFG                                                     */
  GPIO_CFGB_GPIO14INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO14INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO14INCFG_Enum;

/* =============================================  GPIO CFGB GPIO13INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO13INTD                                                      */
  GPIO_CFGB_GPIO13INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD13FNCSEL = NCE13 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO13INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD13FNCSEL = NCE13 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO13INTD_Enum;

/* ============================================  GPIO CFGB GPIO13OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGB_GPIO13OUTCFG                                                    */
  GPIO_CFGB_GPIO13OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD13FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO13OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD13FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO13OUTCFG_OD            = 2,     /*!< OD : Applies when PAD13FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO13OUTCFG_TS            = 3,     /*!< TS : Applies when PAD13FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO13OUTCFG_Enum;

/* ============================================  GPIO CFGB GPIO13INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO13INCFG                                                     */
  GPIO_CFGB_GPIO13INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO13INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO13INCFG_Enum;

/* =============================================  GPIO CFGB GPIO12INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO12INTD                                                      */
  GPIO_CFGB_GPIO12INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD12FNCSEL = NCE12 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO12INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD12FNCSEL = NCE12 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO12INTD_Enum;

/* ============================================  GPIO CFGB GPIO12OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGB_GPIO12OUTCFG                                                    */
  GPIO_CFGB_GPIO12OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD12FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO12OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD12FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO12OUTCFG_OD            = 2,     /*!< OD : Applies when PAD12FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO12OUTCFG_TS            = 3,     /*!< TS : Applies when PAD12FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO12OUTCFG_Enum;

/* ============================================  GPIO CFGB GPIO12INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO12INCFG                                                     */
  GPIO_CFGB_GPIO12INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO12INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO12INCFG_Enum;

/* =============================================  GPIO CFGB GPIO11INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO11INTD                                                      */
  GPIO_CFGB_GPIO11INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD11FNCSEL = NCE11 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO11INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD11FNCSEL = NCE11 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO11INTD_Enum;

/* ============================================  GPIO CFGB GPIO11OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGB_GPIO11OUTCFG                                                    */
  GPIO_CFGB_GPIO11OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD11FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO11OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD11FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO11OUTCFG_OD            = 2,     /*!< OD : Applies when PAD11FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO11OUTCFG_TS            = 3,     /*!< TS : Applies when PAD11FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO11OUTCFG_Enum;

/* ============================================  GPIO CFGB GPIO11INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO11INCFG                                                     */
  GPIO_CFGB_GPIO11INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO11INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO11INCFG_Enum;

/* =============================================  GPIO CFGB GPIO10INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO10INTD                                                      */
  GPIO_CFGB_GPIO10INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD10FNCSEL = NCE10 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO10INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD10FNCSEL = NCE10 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO10INTD_Enum;

/* ============================================  GPIO CFGB GPIO10OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGB_GPIO10OUTCFG                                                    */
  GPIO_CFGB_GPIO10OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD10FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGB_GPIO10OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD10FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGB_GPIO10OUTCFG_OD            = 2,     /*!< OD : Applies when PAD10FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGB_GPIO10OUTCFG_TS            = 3,     /*!< TS : Applies when PAD10FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGB_GPIO10OUTCFG_Enum;

/* =============================================  GPIO CFGB GPIO10INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO10INCFG                                                     */
  GPIO_CFGB_GPIO10INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO10INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO10INCFG_Enum;

/* ==============================================  GPIO CFGB GPIO9INTD [7..7]  =============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO9INTD                                                       */
  GPIO_CFGB_GPIO9INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD9FNCSEL = NCE9 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO9INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD9FNCSEL = NCE9 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO9INTD_Enum;

/* =============================================  GPIO CFGB GPIO9OUTCFG [5..6]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO9OUTCFG                                                     */
  GPIO_CFGB_GPIO9OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD9FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGB_GPIO9OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD9FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGB_GPIO9OUTCFG_OD             = 2,     /*!< OD : Applies when PAD9FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGB_GPIO9OUTCFG_TS             = 3,     /*!< TS : Applies when PAD9FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGB_GPIO9OUTCFG_Enum;

