TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ==============================================  GPIO CFGB GPIO9INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO9INCFG                                                      */
  GPIO_CFGB_GPIO9INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO9INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO9INCFG_Enum;

/* ==============================================  GPIO CFGB GPIO8INTD [3..3]  =============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO8INTD                                                       */
  GPIO_CFGB_GPIO8INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD8FNCSEL = NCE8 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGB_GPIO8INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD8FNCSEL = NCE8 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGB_GPIO8INTD_Enum;

/* =============================================  GPIO CFGB GPIO8OUTCFG [1..2]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO8OUTCFG                                                     */
  GPIO_CFGB_GPIO8OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD8FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGB_GPIO8OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD8FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGB_GPIO8OUTCFG_OD             = 2,     /*!< OD : Applies when PAD8FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGB_GPIO8OUTCFG_TS             = 3,     /*!< TS : Applies when PAD8FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGB_GPIO8OUTCFG_Enum;

/* ==============================================  GPIO CFGB GPIO8INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGB_GPIO8INCFG                                                      */
  GPIO_CFGB_GPIO8INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGB_GPIO8INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGB_GPIO8INCFG_Enum;

/* =========================================================  CFGC  ========================================================== */
/* =============================================  GPIO CFGC GPIO23INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO23INTD                                                      */
  GPIO_CFGC_GPIO23INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD23FNCSEL = NCE23 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO23INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD23FNCSEL = NCE23 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO23INTD_Enum;

/* ============================================  GPIO CFGC GPIO23OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGC_GPIO23OUTCFG                                                    */
  GPIO_CFGC_GPIO23OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD23FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO23OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD23FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO23OUTCFG_OD            = 2,     /*!< OD : Applies when PAD23FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO23OUTCFG_TS            = 3,     /*!< TS : Applies when PAD23FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO23OUTCFG_Enum;

/* ============================================  GPIO CFGC GPIO23INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO23INCFG                                                     */
  GPIO_CFGC_GPIO23INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO23INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO23INCFG_Enum;

/* =============================================  GPIO CFGC GPIO22INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO22INTD                                                      */
  GPIO_CFGC_GPIO22INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD22FNCSEL = NCE22 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO22INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD22FNCSEL = NCE22 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO22INTD_Enum;

/* ============================================  GPIO CFGC GPIO22OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGC_GPIO22OUTCFG                                                    */
  GPIO_CFGC_GPIO22OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD22FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO22OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD22FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO22OUTCFG_OD            = 2,     /*!< OD : Applies when PAD22FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO22OUTCFG_TS            = 3,     /*!< TS : Applies when PAD22FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO22OUTCFG_Enum;

/* ============================================  GPIO CFGC GPIO22INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO22INCFG                                                     */
  GPIO_CFGC_GPIO22INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO22INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO22INCFG_Enum;

/* =============================================  GPIO CFGC GPIO21INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO21INTD                                                      */
  GPIO_CFGC_GPIO21INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD21FNCSEL = NCE21 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO21INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD21FNCSEL = NCE21 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO21INTD_Enum;

/* ============================================  GPIO CFGC GPIO21OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGC_GPIO21OUTCFG                                                    */
  GPIO_CFGC_GPIO21OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD21FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO21OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD21FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO21OUTCFG_OD            = 2,     /*!< OD : Applies when PAD21FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO21OUTCFG_TS            = 3,     /*!< TS : Applies when PAD21FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO21OUTCFG_Enum;

/* ============================================  GPIO CFGC GPIO21INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO21INCFG                                                     */
  GPIO_CFGC_GPIO21INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO21INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO21INCFG_Enum;

/* =============================================  GPIO CFGC GPIO20INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO20INTD                                                      */
  GPIO_CFGC_GPIO20INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD20FNCSEL = NCE20 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO20INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD20FNCSEL = NCE20 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO20INTD_Enum;

/* ============================================  GPIO CFGC GPIO20OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGC_GPIO20OUTCFG                                                    */
  GPIO_CFGC_GPIO20OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD20FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO20OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD20FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO20OUTCFG_OD            = 2,     /*!< OD : Applies when PAD20FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO20OUTCFG_TS            = 3,     /*!< TS : Applies when PAD20FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO20OUTCFG_Enum;

/* ============================================  GPIO CFGC GPIO20INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO20INCFG                                                     */
  GPIO_CFGC_GPIO20INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO20INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO20INCFG_Enum;

/* =============================================  GPIO CFGC GPIO19INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO19INTD                                                      */
  GPIO_CFGC_GPIO19INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD19FNCSEL = NCE19 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO19INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD19FNCSEL = NCE19 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO19INTD_Enum;

/* ============================================  GPIO CFGC GPIO19OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGC_GPIO19OUTCFG                                                    */
  GPIO_CFGC_GPIO19OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD19FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO19OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD19FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO19OUTCFG_OD            = 2,     /*!< OD : Applies when PAD19FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO19OUTCFG_TS            = 3,     /*!< TS : Applies when PAD19FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO19OUTCFG_Enum;

/* ============================================  GPIO CFGC GPIO19INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO19INCFG                                                     */
  GPIO_CFGC_GPIO19INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO19INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO19INCFG_Enum;

/* =============================================  GPIO CFGC GPIO18INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO18INTD                                                      */
  GPIO_CFGC_GPIO18INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD18FNCSEL = NCE18 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO18INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD18FNCSEL = NCE18 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO18INTD_Enum;

