TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO CFGC GPIO18OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO18OUTCFG                                                    */
  GPIO_CFGC_GPIO18OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD18FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO18OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD18FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO18OUTCFG_OD            = 2,     /*!< OD : Applies when PAD18FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO18OUTCFG_TS            = 3,     /*!< TS : Applies when PAD18FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO18OUTCFG_Enum;

/* =============================================  GPIO CFGC GPIO18INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGC_GPIO18INCFG                                                     */
  GPIO_CFGC_GPIO18INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO18INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO18INCFG_Enum;

/* ==============================================  GPIO CFGC GPIO17INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGC_GPIO17INTD                                                      */
  GPIO_CFGC_GPIO17INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD17FNCSEL = NCE17 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO17INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD17FNCSEL = NCE17 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO17INTD_Enum;

/* =============================================  GPIO CFGC GPIO17OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO17OUTCFG                                                    */
  GPIO_CFGC_GPIO17OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD17FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO17OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD17FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO17OUTCFG_OD            = 2,     /*!< OD : Applies when PAD17FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO17OUTCFG_TS            = 3,     /*!< TS : Applies when PAD17FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO17OUTCFG_Enum;

/* =============================================  GPIO CFGC GPIO17INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGC_GPIO17INCFG                                                     */
  GPIO_CFGC_GPIO17INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO17INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO17INCFG_Enum;

/* ==============================================  GPIO CFGC GPIO16INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGC_GPIO16INTD                                                      */
  GPIO_CFGC_GPIO16INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD16FNCSEL = NCE16 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGC_GPIO16INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD16FNCSEL = NCE16 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGC_GPIO16INTD_Enum;

/* =============================================  GPIO CFGC GPIO16OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGC_GPIO16OUTCFG                                                    */
  GPIO_CFGC_GPIO16OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD16FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGC_GPIO16OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD16FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGC_GPIO16OUTCFG_OD            = 2,     /*!< OD : Applies when PAD16FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGC_GPIO16OUTCFG_TS            = 3,     /*!< TS : Applies when PAD16FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGC_GPIO16OUTCFG_Enum;

/* =============================================  GPIO CFGC GPIO16INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGC_GPIO16INCFG                                                     */
  GPIO_CFGC_GPIO16INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGC_GPIO16INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGC_GPIO16INCFG_Enum;

/* =========================================================  CFGD  ========================================================== */
/* =============================================  GPIO CFGD GPIO31INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO31INTD                                                      */
  GPIO_CFGD_GPIO31INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD31FNCSEL = NCE31 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO31INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD31FNCSEL = NCE31 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO31INTD_Enum;

/* ============================================  GPIO CFGD GPIO31OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGD_GPIO31OUTCFG                                                    */
  GPIO_CFGD_GPIO31OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD31FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO31OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD31FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO31OUTCFG_OD            = 2,     /*!< OD : Applies when PAD31FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO31OUTCFG_TS            = 3,     /*!< TS : Applies when PAD31FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO31OUTCFG_Enum;

