TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO CFGD GPIO27INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO27INCFG                                                     */
  GPIO_CFGD_GPIO27INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO27INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGD_GPIO27INCFG_Enum;

/* =============================================  GPIO CFGD GPIO26INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO26INTD                                                      */
  GPIO_CFGD_GPIO26INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD26FNCSEL = NCE26 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO26INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD26FNCSEL = NCE26 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO26INTD_Enum;

/* ============================================  GPIO CFGD GPIO26OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO26OUTCFG                                                    */
  GPIO_CFGD_GPIO26OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD26FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO26OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD26FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO26OUTCFG_OD            = 2,     /*!< OD : Applies when PAD26FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO26OUTCFG_TS            = 3,     /*!< TS : Applies when PAD26FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO26OUTCFG_Enum;

/* =============================================  GPIO CFGD GPIO26INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGD_GPIO26INCFG                                                     */
  GPIO_CFGD_GPIO26INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO26INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGD_GPIO26INCFG_Enum;

/* ==============================================  GPIO CFGD GPIO25INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGD_GPIO25INTD                                                      */
  GPIO_CFGD_GPIO25INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD25FNCSEL = NCE25 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO25INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD25FNCSEL = NCE25 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO25INTD_Enum;

/* =============================================  GPIO CFGD GPIO25OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO25OUTCFG                                                    */
  GPIO_CFGD_GPIO25OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD25FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO25OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD25FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO25OUTCFG_OD            = 2,     /*!< OD : Applies when PAD25FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO25OUTCFG_TS            = 3,     /*!< TS : Applies when PAD25FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO25OUTCFG_Enum;

/* =============================================  GPIO CFGD GPIO25INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGD_GPIO25INCFG                                                     */
  GPIO_CFGD_GPIO25INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO25INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGD_GPIO25INCFG_Enum;

/* ==============================================  GPIO CFGD GPIO24INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGD_GPIO24INTD                                                      */
  GPIO_CFGD_GPIO24INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD24FNCSEL = NCE24 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO24INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD24FNCSEL = NCE24 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO24INTD_Enum;

/* =============================================  GPIO CFGD GPIO24OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO24OUTCFG                                                    */
  GPIO_CFGD_GPIO24OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD24FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO24OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD24FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO24OUTCFG_OD            = 2,     /*!< OD : Applies when PAD24FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO24OUTCFG_TS            = 3,     /*!< TS : Applies when PAD24FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO24OUTCFG_Enum;

