TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =============================================  GPIO CFGD GPIO24INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGD_GPIO24INCFG                                                     */
  GPIO_CFGD_GPIO24INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO24INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGD_GPIO24INCFG_Enum;

/* =========================================================  CFGE  ========================================================== */
/* =============================================  GPIO CFGE GPIO39INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO39INTD                                                      */
  GPIO_CFGE_GPIO39INTD_INTDIS          = 0,     /*!< INTDIS : Applies when GPIO39INCFG = 1 - No interrupt on GPIO
                                                     transition                                                                */
  GPIO_CFGE_GPIO39INTD_INTBOTH         = 1,     /*!< INTBOTH : Applies when GPIO39INCFG = 1 - Interrupt on either
                                                     low to high or high to low GPIO transition                                */
} GPIO_CFGE_GPIO39INTD_Enum;

/* ============================================  GPIO CFGE GPIO39OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGE_GPIO39OUTCFG                                                    */
  GPIO_CFGE_GPIO39OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD39FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO39OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD39FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO39OUTCFG_OD            = 2,     /*!< OD : Applies when PAD39FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO39OUTCFG_TS            = 3,     /*!< TS : Applies when PAD39FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO39OUTCFG_Enum;

/* ============================================  GPIO CFGE GPIO39INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO39INCFG                                                     */
  GPIO_CFGE_GPIO39INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO39INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO39INCFG_Enum;

/* =============================================  GPIO CFGE GPIO38INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO38INTD                                                      */
  GPIO_CFGE_GPIO38INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD38FNCSEL = NCE38 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO38INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD38FNCSEL = NCE38 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO38INTD_Enum;

/* ============================================  GPIO CFGE GPIO38OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGE_GPIO38OUTCFG                                                    */
  GPIO_CFGE_GPIO38OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD38FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO38OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD38FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO38OUTCFG_OD            = 2,     /*!< OD : Applies when PAD38FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO38OUTCFG_TS            = 3,     /*!< TS : Applies when PAD38FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO38OUTCFG_Enum;

/* ============================================  GPIO CFGE GPIO38INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO38INCFG                                                     */
  GPIO_CFGE_GPIO38INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO38INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO38INCFG_Enum;

/* =============================================  GPIO CFGE GPIO37INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO37INTD                                                      */
  GPIO_CFGE_GPIO37INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD37FNCSEL = NCE37 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO37INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD37FNCSEL = NCE37 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO37INTD_Enum;

/* ============================================  GPIO CFGE GPIO37OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGE_GPIO37OUTCFG                                                    */
  GPIO_CFGE_GPIO37OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD37FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO37OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD37FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO37OUTCFG_OD            = 2,     /*!< OD : Applies when PAD37FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO37OUTCFG_TS            = 3,     /*!< TS : Applies when PAD37FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO37OUTCFG_Enum;

