TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO CFGE GPIO37INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO37INCFG                                                     */
  GPIO_CFGE_GPIO37INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO37INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO37INCFG_Enum;

/* =============================================  GPIO CFGE GPIO36INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO36INTD                                                      */
  GPIO_CFGE_GPIO36INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD36FNCSEL = NCE36 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO36INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD36FNCSEL = NCE36 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO36INTD_Enum;

/* ============================================  GPIO CFGE GPIO36OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGE_GPIO36OUTCFG                                                    */
  GPIO_CFGE_GPIO36OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD36FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO36OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD36FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO36OUTCFG_OD            = 2,     /*!< OD : Applies when PAD36FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO36OUTCFG_TS            = 3,     /*!< TS : Applies when PAD36FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO36OUTCFG_Enum;

/* ============================================  GPIO CFGE GPIO36INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO36INCFG                                                     */
  GPIO_CFGE_GPIO36INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO36INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO36INCFG_Enum;

/* =============================================  GPIO CFGE GPIO35INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO35INTD                                                      */
  GPIO_CFGE_GPIO35INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD35FNCSEL = NCE35 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO35INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD35FNCSEL = NCE35 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO35INTD_Enum;

/* ============================================  GPIO CFGE GPIO35OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGE_GPIO35OUTCFG                                                    */
  GPIO_CFGE_GPIO35OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD35FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO35OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD35FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO35OUTCFG_OD            = 2,     /*!< OD : Applies when PAD35FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO35OUTCFG_TS            = 3,     /*!< TS : Applies when PAD35FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO35OUTCFG_Enum;

/* ============================================  GPIO CFGE GPIO35INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO35INCFG                                                     */
  GPIO_CFGE_GPIO35INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO35INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO35INCFG_Enum;

/* =============================================  GPIO CFGE GPIO34INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO34INTD                                                      */
  GPIO_CFGE_GPIO34INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD34FNCSEL = NCE34 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO34INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD34FNCSEL = NCE34 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO34INTD_Enum;

/* ============================================  GPIO CFGE GPIO34OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO34OUTCFG                                                    */
  GPIO_CFGE_GPIO34OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD34FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO34OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD34FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO34OUTCFG_OD            = 2,     /*!< OD : Applies when PAD34FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO34OUTCFG_TS            = 3,     /*!< TS : Applies when PAD34FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO34OUTCFG_Enum;

