TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =============================================  GPIO CFGE GPIO34INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGE_GPIO34INCFG                                                     */
  GPIO_CFGE_GPIO34INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO34INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO34INCFG_Enum;

/* ==============================================  GPIO CFGE GPIO33INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGE_GPIO33INTD                                                      */
  GPIO_CFGE_GPIO33INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD33FNCSEL = NCE33 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO33INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD33FNCSEL = NCE33 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO33INTD_Enum;

/* =============================================  GPIO CFGE GPIO33OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO33OUTCFG                                                    */
  GPIO_CFGE_GPIO33OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD33FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO33OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD33FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO33OUTCFG_OD            = 2,     /*!< OD : Applies when PAD33FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO33OUTCFG_TS            = 3,     /*!< TS : Applies when PAD33FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO33OUTCFG_Enum;

/* =============================================  GPIO CFGE GPIO33INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGE_GPIO33INCFG                                                     */
  GPIO_CFGE_GPIO33INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO33INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO33INCFG_Enum;

/* ==============================================  GPIO CFGE GPIO32INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGE_GPIO32INTD                                                      */
  GPIO_CFGE_GPIO32INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD32FNCSEL = NCE32 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGE_GPIO32INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD32FNCSEL = NCE32 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGE_GPIO32INTD_Enum;

/* =============================================  GPIO CFGE GPIO32OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGE_GPIO32OUTCFG                                                    */
  GPIO_CFGE_GPIO32OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD32FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGE_GPIO32OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD32FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGE_GPIO32OUTCFG_OD            = 2,     /*!< OD : Applies when PAD32FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGE_GPIO32OUTCFG_TS            = 3,     /*!< TS : Applies when PAD32FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGE_GPIO32OUTCFG_Enum;

/* =============================================  GPIO CFGE GPIO32INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGE_GPIO32INCFG                                                     */
  GPIO_CFGE_GPIO32INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGE_GPIO32INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGE_GPIO32INCFG_Enum;

/* =========================================================  CFGF  ========================================================== */
/* =============================================  GPIO CFGF GPIO47INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO47INTD                                                      */
  GPIO_CFGF_GPIO47INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD47FNCSEL = NCE47 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO47INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD47FNCSEL = NCE47 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO47INTD_Enum;

/* ============================================  GPIO CFGF GPIO47OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGF_GPIO47OUTCFG                                                    */
  GPIO_CFGF_GPIO47OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD47FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO47OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD47FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO47OUTCFG_OD            = 2,     /*!< OD : Applies when PAD47FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO47OUTCFG_TS            = 3,     /*!< TS : Applies when PAD47FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO47OUTCFG_Enum;

/* ============================================  GPIO CFGF GPIO47INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO47INCFG                                                     */
  GPIO_CFGF_GPIO47INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO47INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGF_GPIO47INCFG_Enum;

/* =============================================  GPIO CFGF GPIO46INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO46INTD                                                      */
  GPIO_CFGF_GPIO46INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD46FNCSEL = NCE46 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO46INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD46FNCSEL = NCE46 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO46INTD_Enum;

/* ============================================  GPIO CFGF GPIO46OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGF_GPIO46OUTCFG                                                    */
  GPIO_CFGF_GPIO46OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD46FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO46OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD46FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO46OUTCFG_OD            = 2,     /*!< OD : Applies when PAD46FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO46OUTCFG_TS            = 3,     /*!< TS : Applies when PAD46FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO46OUTCFG_Enum;

/* ============================================  GPIO CFGF GPIO46INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO46INCFG                                                     */
  GPIO_CFGF_GPIO46INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO46INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGF_GPIO46INCFG_Enum;

/* =============================================  GPIO CFGF GPIO45INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO45INTD                                                      */
  GPIO_CFGF_GPIO45INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD45FNCSEL = NCE45 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO45INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD45FNCSEL = NCE45 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO45INTD_Enum;

/* ============================================  GPIO CFGF GPIO45OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGF_GPIO45OUTCFG                                                    */
  GPIO_CFGF_GPIO45OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD45FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO45OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD45FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO45OUTCFG_OD            = 2,     /*!< OD : Applies when PAD45FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO45OUTCFG_TS            = 3,     /*!< TS : Applies when PAD45FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO45OUTCFG_Enum;

