TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO CFGG GPIO54INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO54INCFG                                                     */
  GPIO_CFGG_GPIO54INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO54INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGG_GPIO54INCFG_Enum;

/* =============================================  GPIO CFGG GPIO53INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO53INTD                                                      */
  GPIO_CFGG_GPIO53INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD53FNCSEL = NCE53 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO53INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD53FNCSEL = NCE53 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO53INTD_Enum;

/* ============================================  GPIO CFGG GPIO53OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGG_GPIO53OUTCFG                                                    */
  GPIO_CFGG_GPIO53OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD53FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO53OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD53FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO53OUTCFG_OD            = 2,     /*!< OD : Applies when PAD53FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO53OUTCFG_TS            = 3,     /*!< TS : Applies when PAD53FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO53OUTCFG_Enum;

/* ============================================  GPIO CFGG GPIO53INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO53INCFG                                                     */
  GPIO_CFGG_GPIO53INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO53INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGG_GPIO53INCFG_Enum;

/* =============================================  GPIO CFGG GPIO52INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO52INTD                                                      */
  GPIO_CFGG_GPIO52INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD52FNCSEL = NCE52 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO52INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD52FNCSEL = NCE52 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO52INTD_Enum;

/* ============================================  GPIO CFGG GPIO52OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGG_GPIO52OUTCFG                                                    */
  GPIO_CFGG_GPIO52OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD52FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO52OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD52FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO52OUTCFG_OD            = 2,     /*!< OD : Applies when PAD52FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO52OUTCFG_TS            = 3,     /*!< TS : Applies when PAD52FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO52OUTCFG_Enum;

/* ============================================  GPIO CFGG GPIO52INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO52INCFG                                                     */
  GPIO_CFGG_GPIO52INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO52INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGG_GPIO52INCFG_Enum;

/* =============================================  GPIO CFGG GPIO51INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO51INTD                                                      */
  GPIO_CFGG_GPIO51INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD51FNCSEL = NCE51 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO51INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD51FNCSEL = NCE51 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO51INTD_Enum;

/* ============================================  GPIO CFGG GPIO51OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGG_GPIO51OUTCFG                                                    */
  GPIO_CFGG_GPIO51OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD51FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO51OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD51FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO51OUTCFG_OD            = 2,     /*!< OD : Applies when PAD51FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO51OUTCFG_TS            = 3,     /*!< TS : Applies when PAD51FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO51OUTCFG_Enum;

/* ============================================  GPIO CFGG GPIO51INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO51INCFG                                                     */
  GPIO_CFGG_GPIO51INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO51INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGG_GPIO51INCFG_Enum;

/* =============================================  GPIO CFGG GPIO50INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO50INTD                                                      */
  GPIO_CFGG_GPIO50INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD50FNCSEL = NCE50 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO50INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD50FNCSEL = NCE50 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO50INTD_Enum;

