TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ============================================  GPIO CFGH GPIO60OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGH_GPIO60OUTCFG                                                    */
  GPIO_CFGH_GPIO60OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD60FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO60OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD60FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO60OUTCFG_OD            = 2,     /*!< OD : Applies when PAD60FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO60OUTCFG_TS            = 3,     /*!< TS : Applies when PAD60FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO60OUTCFG_Enum;

/* ============================================  GPIO CFGH GPIO60INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO60INCFG                                                     */
  GPIO_CFGH_GPIO60INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO60INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGH_GPIO60INCFG_Enum;

/* =============================================  GPIO CFGH GPIO59INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO59INTD                                                      */
  GPIO_CFGH_GPIO59INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD59FNCSEL = NCE59 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO59INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD59FNCSEL = NCE59 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO59INTD_Enum;

/* ============================================  GPIO CFGH GPIO59OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGH_GPIO59OUTCFG                                                    */
  GPIO_CFGH_GPIO59OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD59FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO59OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD59FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO59OUTCFG_OD            = 2,     /*!< OD : Applies when PAD59FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO59OUTCFG_TS            = 3,     /*!< TS : Applies when PAD59FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO59OUTCFG_Enum;

/* ============================================  GPIO CFGH GPIO59INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO59INCFG                                                     */
  GPIO_CFGH_GPIO59INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO59INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGH_GPIO59INCFG_Enum;

/* =============================================  GPIO CFGH GPIO58INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO58INTD                                                      */
  GPIO_CFGH_GPIO58INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD58FNCSEL = NCE58 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO58INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD58FNCSEL = NCE58 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO58INTD_Enum;

/* ============================================  GPIO CFGH GPIO58OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO58OUTCFG                                                    */
  GPIO_CFGH_GPIO58OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD58FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO58OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD58FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO58OUTCFG_OD            = 2,     /*!< OD : Applies when PAD58FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO58OUTCFG_TS            = 3,     /*!< TS : Applies when PAD58FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO58OUTCFG_Enum;

/* =============================================  GPIO CFGH GPIO58INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGH_GPIO58INCFG                                                     */
  GPIO_CFGH_GPIO58INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO58INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGH_GPIO58INCFG_Enum;

/* ==============================================  GPIO CFGH GPIO57INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGH_GPIO57INTD                                                      */
  GPIO_CFGH_GPIO57INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD57FNCSEL = NCE57 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO57INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD57FNCSEL = NCE57 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO57INTD_Enum;

/* =============================================  GPIO CFGH GPIO57OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO57OUTCFG                                                    */
  GPIO_CFGH_GPIO57OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD57FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO57OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD57FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO57OUTCFG_OD            = 2,     /*!< OD : Applies when PAD57FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO57OUTCFG_TS            = 3,     /*!< TS : Applies when PAD57FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO57OUTCFG_Enum;

