TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =============================================  GPIO CFGH GPIO57INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGH_GPIO57INCFG                                                     */
  GPIO_CFGH_GPIO57INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO57INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGH_GPIO57INCFG_Enum;

/* ==============================================  GPIO CFGH GPIO56INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGH_GPIO56INTD                                                      */
  GPIO_CFGH_GPIO56INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD56FNCSEL = NCE56 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO56INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD56FNCSEL = NCE56 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO56INTD_Enum;

/* =============================================  GPIO CFGH GPIO56OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO56OUTCFG                                                    */
  GPIO_CFGH_GPIO56OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD56FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO56OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD56FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO56OUTCFG_OD            = 2,     /*!< OD : Applies when PAD56FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO56OUTCFG_TS            = 3,     /*!< TS : Applies when PAD56FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO56OUTCFG_Enum;

/* =============================================  GPIO CFGH GPIO56INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGH_GPIO56INCFG                                                     */
  GPIO_CFGH_GPIO56INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO56INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGH_GPIO56INCFG_Enum;

/* =========================================================  CFGI  ========================================================== */
/* =============================================  GPIO CFGI GPIO71INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO71INTD                                                      */
  GPIO_CFGI_GPIO71INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD71FNCSEL = NCE71 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO71INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD71FNCSEL = NCE71 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO71INTD_Enum;

/* ============================================  GPIO CFGI GPIO71OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGI_GPIO71OUTCFG                                                    */
  GPIO_CFGI_GPIO71OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD71FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO71OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD71FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO71OUTCFG_OD            = 2,     /*!< OD : Applies when PAD71FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO71OUTCFG_TS            = 3,     /*!< TS : Applies when PAD71FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO71OUTCFG_Enum;

/* ============================================  GPIO CFGI GPIO71INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO71INCFG                                                     */
  GPIO_CFGI_GPIO71INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO71INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Read-back will always be zero                         */
} GPIO_CFGI_GPIO71INCFG_Enum;

/* =============================================  GPIO CFGI GPIO70INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO70INTD                                                      */
  GPIO_CFGI_GPIO70INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD70FNCSEL = NCE70 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO70INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD70FNCSEL = NCE70 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO70INTD_Enum;

/* ============================================  GPIO CFGI GPIO70OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGI_GPIO70OUTCFG                                                    */
  GPIO_CFGI_GPIO70OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD70FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO70OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD70FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO70OUTCFG_OD            = 2,     /*!< OD : Applies when PAD70FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO70OUTCFG_TS            = 3,     /*!< TS : Applies when PAD70FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO70OUTCFG_Enum;

