TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ==============================================  GPIO CTENCFG EN14 [14..14]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN14                                                         */
  GPIO_CTENCFG_EN14_DIS                = 1,     /*!< DIS : Disable CT14 for output                                             */
  GPIO_CTENCFG_EN14_EN                 = 0,     /*!< EN : Enable CT14 for output                                               */
} GPIO_CTENCFG_EN14_Enum;

/* ==============================================  GPIO CTENCFG EN13 [13..13]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN13                                                         */
  GPIO_CTENCFG_EN13_DIS                = 1,     /*!< DIS : Disable CT13 for output                                             */
  GPIO_CTENCFG_EN13_EN                 = 0,     /*!< EN : Enable CT13 for output                                               */
} GPIO_CTENCFG_EN13_Enum;

/* ==============================================  GPIO CTENCFG EN12 [12..12]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN12                                                         */
  GPIO_CTENCFG_EN12_DIS                = 1,     /*!< DIS : Disable CT12 for output                                             */
  GPIO_CTENCFG_EN12_EN                 = 0,     /*!< EN : Enable CT12 for output                                               */
} GPIO_CTENCFG_EN12_Enum;

/* ==============================================  GPIO CTENCFG EN11 [11..11]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN11                                                         */
  GPIO_CTENCFG_EN11_DIS                = 1,     /*!< DIS : Disable CT11 for output                                             */
  GPIO_CTENCFG_EN11_EN                 = 0,     /*!< EN : Enable CT11 for output                                               */
} GPIO_CTENCFG_EN11_Enum;

/* ==============================================  GPIO CTENCFG EN10 [10..10]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN10                                                         */
  GPIO_CTENCFG_EN10_DIS                = 1,     /*!< DIS : Disable CT10 for output                                             */
  GPIO_CTENCFG_EN10_EN                 = 0,     /*!< EN : Enable CT10 for output                                               */
} GPIO_CTENCFG_EN10_Enum;

/* ================================================  GPIO CTENCFG EN9 [9..9]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN9                                                          */
  GPIO_CTENCFG_EN9_DIS                 = 0,     /*!< DIS : Disable CT9 for output                                              */
} GPIO_CTENCFG_EN9_Enum;

/* ================================================  GPIO CTENCFG EN8 [8..8]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN8                                                          */
  GPIO_CTENCFG_EN8_DIS                 = 1,     /*!< DIS : Disable CT8 for output                                              */
  GPIO_CTENCFG_EN8_EN                  = 0,     /*!< EN : Enable CT8 for output                                                */
} GPIO_CTENCFG_EN8_Enum;

/* ================================================  GPIO CTENCFG EN7 [7..7]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN7                                                          */
  GPIO_CTENCFG_EN7_DIS                 = 1,     /*!< DIS : Disable CT7 for output                                              */
  GPIO_CTENCFG_EN7_EN                  = 0,     /*!< EN : Enable CT7 for output                                                */
} GPIO_CTENCFG_EN7_Enum;

/* ================================================  GPIO CTENCFG EN6 [6..6]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN6                                                          */
  GPIO_CTENCFG_EN6_DIS                 = 1,     /*!< DIS : Disable CT6 for output                                              */
  GPIO_CTENCFG_EN6_EN                  = 0,     /*!< EN : Enable CT6 for output                                                */
} GPIO_CTENCFG_EN6_Enum;

/* ================================================  GPIO CTENCFG EN5 [5..5]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN5                                                          */
  GPIO_CTENCFG_EN5_DIS                 = 1,     /*!< DIS : Disable CT5 for output                                              */
  GPIO_CTENCFG_EN5_EN                  = 0,     /*!< EN : Enable CT5 for output                                                */
} GPIO_CTENCFG_EN5_Enum;

/* ================================================  GPIO CTENCFG EN4 [4..4]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN4                                                          */
  GPIO_CTENCFG_EN4_DIS                 = 1,     /*!< DIS : Disable CT4 for output                                              */
  GPIO_CTENCFG_EN4_EN                  = 0,     /*!< EN : Enable CT4 for output                                                */
} GPIO_CTENCFG_EN4_Enum;

/* ================================================  GPIO CTENCFG EN3 [3..3]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN3                                                          */
  GPIO_CTENCFG_EN3_DIS                 = 1,     /*!< DIS : Disable CT3 for output                                              */
  GPIO_CTENCFG_EN3_EN                  = 0,     /*!< EN : Enable CT3 for output                                                */
} GPIO_CTENCFG_EN3_Enum;

/* ================================================  GPIO CTENCFG EN2 [2..2]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN2                                                          */
  GPIO_CTENCFG_EN2_DIS                 = 1,     /*!< DIS : Disable CT2 for output                                              */
  GPIO_CTENCFG_EN2_EN                  = 0,     /*!< EN : Enable CT2 for output                                                */
} GPIO_CTENCFG_EN2_Enum;

/* ================================================  GPIO CTENCFG EN1 [1..1]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN1                                                          */
  GPIO_CTENCFG_EN1_DIS                 = 1,     /*!< DIS : Disable CT1 for output                                              */
  GPIO_CTENCFG_EN1_EN                  = 0,     /*!< EN : Enable CT1 for output                                                */
} GPIO_CTENCFG_EN1_Enum;

/* ================================================  GPIO CTENCFG EN0 [0..0]  ================================================ */
typedef enum {                                  /*!< GPIO_CTENCFG_EN0                                                          */
  GPIO_CTENCFG_EN0_DIS                 = 1,     /*!< DIS : Disable CT0 for output                                              */
  GPIO_CTENCFG_EN0_EN                  = 0,     /*!< EN : Enable CT0 for output                                                */
} GPIO_CTENCFG_EN0_Enum;

/* ========================================================  INT0EN  ========================================================= */
/* =======================================================  INT0STAT  ======================================================== */
/* ========================================================  INT0CLR  ======================================================== */
/* ========================================================  INT0SET  ======================================================== */
/* ========================================================  INT1EN  ========================================================= */
/* =======================================================  INT1STAT  ======================================================== */
/* ========================================================  INT1CLR  ======================================================== */
/* ========================================================  INT1SET  ======================================================== */
/* ========================================================  INT2EN  ========================================================= */
/* =======================================================  INT2STAT  ======================================================== */
/* ========================================================  INT2CLR  ======================================================== */
/* ========================================================  INT2SET  ======================================================== */
/* ========================================================  DBGCTRL  ======================================================== */


/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  FIFO  ========================================================== */
/* ========================================================  FIFOPTR  ======================================================== */
/* ========================================================  FIFOTHR  ======================================================== */
/* ========================================================  FIFOPOP  ======================================================== */
/* =======================================================  FIFOPUSH  ======================================================== */
/* =======================================================  FIFOCTRL  ======================================================== */
/* ========================================================  FIFOLOC  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ========================================================  CLKCFG  ========================================================= */
/* ==============================================  IOM0 CLKCFG DIVEN [12..12]  =============================================== */
typedef enum {                                  /*!< IOM0_CLKCFG_DIVEN                                                         */
  IOM0_CLKCFG_DIVEN_DIS                = 0,     /*!< DIS : Disable TOTPER division.                                            */
  IOM0_CLKCFG_DIVEN_EN                 = 1,     /*!< EN : Enable TOTPER division.                                              */
} IOM0_CLKCFG_DIVEN_Enum;

/* ===============================================  IOM0 CLKCFG DIV3 [11..11]  =============================================== */
typedef enum {                                  /*!< IOM0_CLKCFG_DIV3                                                          */
  IOM0_CLKCFG_DIV3_DIS                 = 0,     /*!< DIS : Select divide by 1.                                                 */
  IOM0_CLKCFG_DIV3_EN                  = 1,     /*!< EN : Select divide by 3.                                                  */
} IOM0_CLKCFG_DIV3_Enum;

