TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ========================================================  CHIPID1  ======================================================== */
/* ============================================  MCUCTRL CHIPID1 CHIPID1 [0..31]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPID1_CHIPID1                                                   */
  MCUCTRL_CHIPID1_CHIPID1_APOLLO3      = 0,     /*!< APOLLO3 : Apollo3 Blue Plus CHIPID1.                                      */
} MCUCTRL_CHIPID1_CHIPID1_Enum;

/* ========================================================  CHIPREV  ======================================================== */
/* =============================================  MCUCTRL CHIPREV REVMAJ [4..7]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMAJ                                                    */
  MCUCTRL_CHIPREV_REVMAJ_C             = 3,     /*!< C : Apollo3 Blue Plus                                                     */
  MCUCTRL_CHIPREV_REVMAJ_B             = 2,     /*!< B : Apollo3 Blue revision B                                               */
  MCUCTRL_CHIPREV_REVMAJ_A             = 1,     /*!< A : Apollo3 Blue revision A                                               */
} MCUCTRL_CHIPREV_REVMAJ_Enum;

/* =============================================  MCUCTRL CHIPREV REVMIN [0..3]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMIN                                                    */
  MCUCTRL_CHIPREV_REVMIN_REV1          = 2,     /*!< REV1 : Apollo3 Blue minor rev 1.                                          */
  MCUCTRL_CHIPREV_REVMIN_REV0          = 1,     /*!< REV0 : Apollo3 Blue minor rev 0. Minor revision value, succeeding
                                                     minor revisions will increment from this value.                           */
} MCUCTRL_CHIPREV_REVMIN_Enum;

/* =======================================================  VENDORID  ======================================================== */
/* ===========================================  MCUCTRL VENDORID VENDORID [0..31]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_VENDORID_VENDORID                                                 */
  MCUCTRL_VENDORID_VENDORID_AMBIQ      = 1095582289,/*!< AMBIQ : Ambiq Vendor ID 'AMBQ'                                        */
} MCUCTRL_VENDORID_VENDORID_Enum;

/* ==========================================================  SKU  ========================================================== */
/* =====================================================  FEATUREENABLE  ===================================================== */
/* ========================================  MCUCTRL FEATUREENABLE BURSTAVAIL [6..6]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_FEATUREENABLE_BURSTAVAIL                                          */
  MCUCTRL_FEATUREENABLE_BURSTAVAIL_AVAIL = 1,   /*!< AVAIL : Burst functionality available                                     */
  MCUCTRL_FEATUREENABLE_BURSTAVAIL_NOTAVAIL = 0,/*!< NOTAVAIL : Burst functionality not available                              */
} MCUCTRL_FEATUREENABLE_BURSTAVAIL_Enum;

/* =========================================  MCUCTRL FEATUREENABLE BURSTREQ [4..4]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_FEATUREENABLE_BURSTREQ                                            */
  MCUCTRL_FEATUREENABLE_BURSTREQ_EN    = 1,     /*!< EN : Enable the Burst functionality                                       */
  MCUCTRL_FEATUREENABLE_BURSTREQ_DIS   = 0,     /*!< DIS : Disable the Burst functionality                                     */
} MCUCTRL_FEATUREENABLE_BURSTREQ_Enum;

/* =========================================  MCUCTRL FEATUREENABLE BLEAVAIL [2..2]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_FEATUREENABLE_BLEAVAIL                                            */
  MCUCTRL_FEATUREENABLE_BLEAVAIL_AVAIL = 1,     /*!< AVAIL : BLE functionality available                                       */
  MCUCTRL_FEATUREENABLE_BLEAVAIL_NOTAVAIL = 0,  /*!< NOTAVAIL : BLE functionality not available                                */
} MCUCTRL_FEATUREENABLE_BLEAVAIL_Enum;

/* ==========================================  MCUCTRL FEATUREENABLE BLEREQ [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_FEATUREENABLE_BLEREQ                                              */
  MCUCTRL_FEATUREENABLE_BLEREQ_EN      = 1,     /*!< EN : Enable the BLE functionality                                         */
  MCUCTRL_FEATUREENABLE_BLEREQ_DIS     = 0,     /*!< DIS : Disable the BLE functionality                                       */
} MCUCTRL_FEATUREENABLE_BLEREQ_Enum;

/* =======================================================  DEBUGGER  ======================================================== */
/* =================================================  DMASRAMWRITEPROTECT2  ================================================== */
/* =======================================================  ADCPWRDLY  ======================================================= */
/* ========================================================  ADCCAL  ========================================================= */
/* ==========================================  MCUCTRL ADCCAL ADCCALIBRATED [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_ADCCAL_ADCCALIBRATED                                              */
  MCUCTRL_ADCCAL_ADCCALIBRATED_FALSE   = 0,     /*!< FALSE : ADC is not calibrated                                             */
  MCUCTRL_ADCCAL_ADCCALIBRATED_TRUE    = 1,     /*!< TRUE : ADC is calibrated                                                  */
} MCUCTRL_ADCCAL_ADCCALIBRATED_Enum;

/* ===========================================  MCUCTRL ADCCAL CALONPWRUP [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_ADCCAL_CALONPWRUP                                                 */
  MCUCTRL_ADCCAL_CALONPWRUP_DIS        = 0,     /*!< DIS : Disable automatic calibration on initial power up                   */
  MCUCTRL_ADCCAL_CALONPWRUP_EN         = 1,     /*!< EN : Enable automatic calibration on initial power up                     */
} MCUCTRL_ADCCAL_CALONPWRUP_Enum;

