TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ======================================================  OTAPOINTER  ======================================================= */
/* =======================================================  SRAMMODE  ======================================================== */
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key                                                                 */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK2  ======================================================= */
/* =======================================================  SIMOBUCK3  ======================================================= */
/* =======================================================  SIMOBUCK4  ======================================================= */
/* =======================================================  BLEBUCK2  ======================================================== */
/* ======================================================  FLASHWPROT0  ====================================================== */
/* ======================================================  FLASHWPROT1  ====================================================== */
/* ======================================================  FLASHWPROT2  ====================================================== */
/* ======================================================  FLASHWPROT3  ====================================================== */
/* ======================================================  FLASHRPROT0  ====================================================== */
/* ======================================================  FLASHRPROT1  ====================================================== */
/* ======================================================  FLASHRPROT2  ====================================================== */
/* ======================================================  FLASHRPROT3  ====================================================== */
/* =================================================  DMASRAMWRITEPROTECT0  ================================================== */
/* =================================================  DMASRAMWRITEPROTECT1  ================================================== */
/* ==================================================  DMASRAMREADPROTECT0  ================================================== */
/* ==================================================  DMASRAMREADPROTECT1  ================================================== */
/* ==================================================  DMASRAMREADPROTECT2  ================================================== */


/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ==========================================================  CFG  ========================================================== */
/* ================================================  MSPI0 CFG CPOL [17..17]  ================================================ */
typedef enum {                                  /*!< MSPI0_CFG_CPOL                                                            */
  MSPI0_CFG_CPOL_LOW                   = 0,     /*!< LOW : Clock inactive state is low.                                        */
  MSPI0_CFG_CPOL_HIGH                  = 1,     /*!< HIGH : Clock inactive state is high.                                      */
} MSPI0_CFG_CPOL_Enum;

/* ================================================  MSPI0 CFG CPHA [16..16]  ================================================ */
typedef enum {                                  /*!< MSPI0_CFG_CPHA                                                            */
  MSPI0_CFG_CPHA_MIDDLE                = 0,     /*!< MIDDLE : Clock toggles in middle of data bit.                             */
  MSPI0_CFG_CPHA_START                 = 1,     /*!< START : Clock toggles at start of data bit.                               */
} MSPI0_CFG_CPHA_Enum;

/* ================================================  MSPI0 CFG ASIZE [4..5]  ================================================= */
typedef enum {                                  /*!< MSPI0_CFG_ASIZE                                                           */
  MSPI0_CFG_ASIZE_A1                   = 0,     /*!< A1 : Send one address byte                                                */
  MSPI0_CFG_ASIZE_A2                   = 1,     /*!< A2 : Send two address bytes                                               */
  MSPI0_CFG_ASIZE_A3                   = 2,     /*!< A3 : Send three address bytes                                             */
  MSPI0_CFG_ASIZE_A4                   = 3,     /*!< A4 : Send four address bytes                                              */
} MSPI0_CFG_ASIZE_Enum;

/* ================================================  MSPI0 CFG DEVCFG [0..3]  ================================================ */
typedef enum {                                  /*!< MSPI0_CFG_DEVCFG                                                          */
  MSPI0_CFG_DEVCFG_SERIAL0             = 1,     /*!< SERIAL0 : Single bit SPI flash on chip select 0                           */
  MSPI0_CFG_DEVCFG_SERIAL1             = 2,     /*!< SERIAL1 : Single bit SPI flash on chip select 1                           */
  MSPI0_CFG_DEVCFG_DUAL0               = 5,     /*!< DUAL0 : Dual SPI flash on chip select 0                                   */
  MSPI0_CFG_DEVCFG_DUAL1               = 6,     /*!< DUAL1 : Dual bit SPI flash on chip select 1                               */
  MSPI0_CFG_DEVCFG_QUAD0               = 9,     /*!< QUAD0 : Quad SPI flash on chip select 0                                   */
  MSPI0_CFG_DEVCFG_QUAD1               = 10,    /*!< QUAD1 : Quad SPI flash on chip select 1                                   */
  MSPI0_CFG_DEVCFG_OCTAL0              = 13,    /*!< OCTAL0 : Octal SPI flash on chip select 0                                 */
  MSPI0_CFG_DEVCFG_OCTAL1              = 14,    /*!< OCTAL1 : Octal SPI flash on chip select 1                                 */
} MSPI0_CFG_DEVCFG_Enum;

/* =========================================================  ADDR  ========================================================== */
/* =========================================================  INSTR  ========================================================= */
/* ========================================================  TXFIFO  ========================================================= */
/* ========================================================  RXFIFO  ========================================================= */
/* =======================================================  TXENTRIES  ======================================================= */
/* =======================================================  RXENTRIES  ======================================================= */
/* =======================================================  THRESHOLD  ======================================================= */
/* ========================================================  MSPICFG  ======================================================== */
/* =============================================  MSPI0 MSPICFG CLKDIV [8..13]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_CLKDIV                                                      */
  MSPI0_MSPICFG_CLKDIV_CLK48           = 1,     /*!< CLK48 : 48 MHz MSPI clock                                                 */
  MSPI0_MSPICFG_CLKDIV_CLK24           = 2,     /*!< CLK24 : 24 MHz MSPI clock                                                 */
  MSPI0_MSPICFG_CLKDIV_CLK12           = 4,     /*!< CLK12 : 12 MHz MSPI clock                                                 */
  MSPI0_MSPICFG_CLKDIV_CLK6            = 8,     /*!< CLK6 : 6 MHz MSPI clock                                                   */
  MSPI0_MSPICFG_CLKDIV_CLK3            = 16,    /*!< CLK3 : 3 MHz MSPI clock                                                   */
  MSPI0_MSPICFG_CLKDIV_CLK1_5          = 32,    /*!< CLK1_5 : 1.5 MHz MSPI clock                                               */
} MSPI0_MSPICFG_CLKDIV_Enum;

/* ==============================================  MSPI0 MSPICFG IOMSEL [4..7]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_IOMSEL                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM0            = 0,     /*!< IOM0 : IOM0                                                               */
  MSPI0_MSPICFG_IOMSEL_IOM1            = 1,     /*!< IOM1 : IOM1                                                               */
  MSPI0_MSPICFG_IOMSEL_IOM2            = 2,     /*!< IOM2 : IOM2                                                               */
  MSPI0_MSPICFG_IOMSEL_IOM3            = 3,     /*!< IOM3 : IOM3                                                               */
  MSPI0_MSPICFG_IOMSEL_IOM4            = 4,     /*!< IOM4 : IOM4                                                               */
  MSPI0_MSPICFG_IOMSEL_IOM5            = 5,     /*!< IOM5 : IOM5                                                               */
  MSPI0_MSPICFG_IOMSEL_MSPI0           = 8,     /*!< MSPI0 : MSPI0                                                             */
  MSPI0_MSPICFG_IOMSEL_MSPI1           = 9,     /*!< MSPI1 : MSPI1                                                             */
  MSPI0_MSPICFG_IOMSEL_MSPI2           = 10,    /*!< MSPI2 : MSPI2                                                             */
  MSPI0_MSPICFG_IOMSEL_DISABLED        = 7,     /*!< DISABLED : No IOM selected. Signals always zero.                          */
} MSPI0_MSPICFG_IOMSEL_Enum;

