TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ==============================================  MSPI0 MSPICFG TXNEG [3..3]  =============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_TXNEG                                                       */
  MSPI0_MSPICFG_TXNEG_NORMAL           = 0,     /*!< NORMAL : TX launched from posedge internal clock                          */
  MSPI0_MSPICFG_TXNEG_NEGEDGE          = 1,     /*!< NEGEDGE : TX data launched from negedge of internal clock                 */
} MSPI0_MSPICFG_TXNEG_Enum;

/* ==============================================  MSPI0 MSPICFG RXNEG [2..2]  =============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_RXNEG                                                       */
  MSPI0_MSPICFG_RXNEG_NORMAL           = 0,     /*!< NORMAL : RX data sampled on posedge of internal clock                     */
  MSPI0_MSPICFG_RXNEG_NEGEDGE          = 1,     /*!< NEGEDGE : RX data sampled on negedge of internal clock                    */
} MSPI0_MSPICFG_RXNEG_Enum;

/* ==============================================  MSPI0 MSPICFG RXCAP [1..1]  =============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_RXCAP                                                       */
  MSPI0_MSPICFG_RXCAP_NORMAL           = 0,     /*!< NORMAL : RX Capture phase aligns with CPHA setting                        */
  MSPI0_MSPICFG_RXCAP_DELAY            = 1,     /*!< DELAY : RX Capture phase is delayed from CPHA setting by one
                                                     clock edge                                                                */
} MSPI0_MSPICFG_RXCAP_Enum;

/* ==============================================  MSPI0 MSPICFG APBCLK [0..0]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_APBCLK                                                      */
  MSPI0_MSPICFG_APBCLK_DIS             = 0,     /*!< DIS : Disable continuous clock.                                           */
  MSPI0_MSPICFG_APBCLK_EN              = 1,     /*!< EN : Enable continuous clock.                                             */
} MSPI0_MSPICFG_APBCLK_Enum;

/* ========================================================  MSPIDDR  ======================================================== */
/* ========================================================  PADCFG  ========================================================= */
/* =======================================================  PADOUTEN  ======================================================== */
/* ==============================================  MSPI0 PADOUTEN OUTEN [0..9]  ============================================== */
typedef enum {                                  /*!< MSPI0_PADOUTEN_OUTEN                                                      */
  MSPI0_PADOUTEN_OUTEN_QUAD0           = 271,   /*!< QUAD0 : Quad0 (4 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_QUAD1           = 496,   /*!< QUAD1 : Quad1 (4 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_OCTAL           = 1023,  /*!< OCTAL : Octal (8 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_SERIAL0         = 259,   /*!< SERIAL0 : Serial (2 data + 1 clock)                                       */
} MSPI0_PADOUTEN_OUTEN_Enum;

/* =======================================================  PADOVEREN  ======================================================= */
/* ========================================================  PADOVER  ======================================================== */
/* =========================================================  FLASH  ========================================================= */
/* =============================================  MSPI0 FLASH XIPMIXED [8..10]  ============================================== */
typedef enum {                                  /*!< MSPI0_FLASH_XIPMIXED                                                      */
  MSPI0_FLASH_XIPMIXED_NORMAL          = 0,     /*!< NORMAL : Transfers all proceed using the settings in DEVCFG
                                                     register (everything in the same data rate)                               */
  MSPI0_FLASH_XIPMIXED_D2              = 1,     /*!< D2 : Data operations proceed in dual data rate                            */
  MSPI0_FLASH_XIPMIXED_AD2             = 3,     /*!< AD2 : Address and Data operations proceed in dual data rate               */
  MSPI0_FLASH_XIPMIXED_D4              = 5,     /*!< D4 : Data operations proceed in quad data rate                            */
  MSPI0_FLASH_XIPMIXED_AD4             = 7,     /*!< AD4 : Address and Data operations proceed in quad data rate               */
} MSPI0_FLASH_XIPMIXED_Enum;

/* ===============================================  MSPI0 FLASH XIPACK [2..3]  =============================================== */
typedef enum {                                  /*!< MSPI0_FLASH_XIPACK                                                        */
  MSPI0_FLASH_XIPACK_NOACK             = 0,     /*!< NOACK : No acknowledgment sent. Data IOs are tri-stated the
                                                     first turnaround cycle                                                    */
  MSPI0_FLASH_XIPACK_ACK               = 2,     /*!< ACK : Positive acknowledgment sent. Data IOs are driven to 0
                                                     the first turnaround cycle to acknowledge XIP mode                        */
  MSPI0_FLASH_XIPACK_TERMINATE         = 3,     /*!< TERMINATE : Negative acknowledgment sent. Data IOs are driven
                                                     to 1 the first turnaround cycle to terminate XIP mode.
                                                     XIPSENDI should be re-enabled for the next transfer                       */
} MSPI0_FLASH_XIPACK_Enum;

