TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* ================================================  PDM DMACFG DMAEN [0..0]  ================================================ */
typedef enum {                                  /*!< PDM_DMACFG_DMAEN                                                          */
  PDM_DMACFG_DMAEN_DIS                 = 0,     /*!< DIS : Disable DMA Function                                                */
  PDM_DMACFG_DMAEN_EN                  = 1,     /*!< EN : Enable DMA Function                                                  */
} PDM_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  SUPPLYSRC  ======================================================= */
/* ==========================================  PWRCTRL SUPPLYSRC BLEBUCKEN [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSRC_BLEBUCKEN                                               */
  PWRCTRL_SUPPLYSRC_BLEBUCKEN_EN       = 1,     /*!< EN : Enable the BLE Buck.                                                 */
  PWRCTRL_SUPPLYSRC_BLEBUCKEN_DIS      = 0,     /*!< DIS : Disable the BLE Buck.                                               */
} PWRCTRL_SUPPLYSRC_BLEBUCKEN_Enum;

/* =====================================================  SUPPLYSTATUS  ====================================================== */
/* =========================================  PWRCTRL SUPPLYSTATUS BLEBUCKON [1..1]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSTATUS_BLEBUCKON                                            */
  PWRCTRL_SUPPLYSTATUS_BLEBUCKON_LDO   = 0,     /*!< LDO : Indicates the the LDO is supplying the BLE/Burst power
                                                     domain                                                                    */
  PWRCTRL_SUPPLYSTATUS_BLEBUCKON_BUCK  = 1,     /*!< BUCK : Indicates the the Buck is supplying the BLE/Burst power
                                                     domain                                                                    */
} PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Enum;

/* ========================================  PWRCTRL SUPPLYSTATUS SIMOBUCKON [0..0]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSTATUS_SIMOBUCKON                                           */
  PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_OFF  = 0,     /*!< OFF : Indicates the the SIMO Buck is OFF.                                 */
  PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_ON   = 1,     /*!< ON : Indicates the the SIMO Buck is ON.                                   */
} PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Enum;

/* =======================================================  DEVPWREN  ======================================================== */
/* ===========================================  PWRCTRL DEVPWREN PWRBLEL [15..15]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRBLEL                                                  */
  PWRCTRL_DEVPWREN_PWRBLEL_EN          = 1,     /*!< EN : Power up BLE controller                                              */
  PWRCTRL_DEVPWREN_PWRBLEL_DIS         = 0,     /*!< DIS : Power down BLE controller                                           */
} PWRCTRL_DEVPWREN_PWRBLEL_Enum;

/* ===========================================  PWRCTRL DEVPWREN PWRPDM [14..14]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRPDM                                                   */
  PWRCTRL_DEVPWREN_PWRPDM_EN           = 1,     /*!< EN : Power up PDM                                                         */
  PWRCTRL_DEVPWREN_PWRPDM_DIS          = 0,     /*!< DIS : Power down PDM                                                      */
} PWRCTRL_DEVPWREN_PWRPDM_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRMSPI2 [13..13]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRMSPI2                                                 */
  PWRCTRL_DEVPWREN_PWRMSPI2_EN         = 1,     /*!< EN : Power up MSPI2                                                       */
  PWRCTRL_DEVPWREN_PWRMSPI2_DIS        = 0,     /*!< DIS : Power down MSPI2                                                    */
} PWRCTRL_DEVPWREN_PWRMSPI2_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRMSPI1 [12..12]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRMSPI1                                                 */
  PWRCTRL_DEVPWREN_PWRMSPI1_EN         = 1,     /*!< EN : Power up MSPI1                                                       */
  PWRCTRL_DEVPWREN_PWRMSPI1_DIS        = 0,     /*!< DIS : Power down MSPI1                                                    */
} PWRCTRL_DEVPWREN_PWRMSPI1_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRMSPI0 [11..11]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRMSPI0                                                 */
  PWRCTRL_DEVPWREN_PWRMSPI0_EN         = 1,     /*!< EN : Power up MSPI0                                                       */
  PWRCTRL_DEVPWREN_PWRMSPI0_DIS        = 0,     /*!< DIS : Power down MSPI0                                                    */
} PWRCTRL_DEVPWREN_PWRMSPI0_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRSCARD [10..10]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRSCARD                                                 */
  PWRCTRL_DEVPWREN_PWRSCARD_EN         = 1,     /*!< EN : Power up SCARD                                                       */
  PWRCTRL_DEVPWREN_PWRSCARD_DIS        = 0,     /*!< DIS : Power down SCARD                                                    */
} PWRCTRL_DEVPWREN_PWRSCARD_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRADC [9..9]  ============================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRADC                                                   */
  PWRCTRL_DEVPWREN_PWRADC_EN           = 1,     /*!< EN : Power up ADC                                                         */
  PWRCTRL_DEVPWREN_PWRADC_DIS          = 0,     /*!< DIS : Power Down ADC                                                      */
} PWRCTRL_DEVPWREN_PWRADC_Enum;

