TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo3p.h
/* =======================================  PWRCTRL MEMPWDINSLEEP SRAMPWDSLP [3..12]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP                                          */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_NONE = 0,    /*!< NONE : All banks retained                                                 */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP0 = 1,  /*!< GROUP0 : SRAM GROUP0 powered down (64KB-128KB)                            */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP1 = 2,  /*!< GROUP1 : SRAM GROUP1 powered down (128KB-192KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP2 = 4,  /*!< GROUP2 : SRAM GROUP2 powered down (192KB-256KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP3 = 8,  /*!< GROUP3 : SRAM GROUP3 powered down (256KB-320KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP4 = 16, /*!< GROUP4 : SRAM GROUP4 powered down (320KB-384KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP5 = 32, /*!< GROUP5 : SRAM GROUP5 powered down (384KB-448KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP6 = 64, /*!< GROUP6 : SRAM GROUP6 powered down (448KB-512KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP7 = 128,/*!< GROUP7 : SRAM GROUP7 powered down (512KB-576KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP8 = 256,/*!< GROUP8 : SRAM GROUP8 powered down (576KB-672KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP9 = 512,/*!< GROUP9 : SRAM GROUP9 powered down (672KB-768KB)                           */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_SRAM128K = 3,/*!< SRAM128K : Power-down lower 128k SRAM (64KB-192KB)                        */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_SRAM256K = 15,/*!< SRAM256K : Power-down lower 256k SRAM (64KB-320KB)                       */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER64K = 1022,/*!< ALLBUTLOWER64K : All SRAM banks but lower 64k powered down.      */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER128K = 1020,/*!< ALLBUTLOWER128K : All banks but lower 128k powered down.        */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER256K = 1008,/*!< ALLBUTLOWER256K : All banks but lower 256k powered down.        */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALL = 1023,  /*!< ALL : All banks powered down.                                             */
} PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Enum;

/* ========================================  PWRCTRL MEMPWDINSLEEP DTCMPWDSLP [0..2]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP                                          */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_NONE = 0,    /*!< NONE : All DTCM retained                                                  */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0DTCM0 = 1,/*!< GROUP0DTCM0 : Group0_DTCM0 powered down in deep sleep (0KB-8KB)        */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0DTCM1 = 2,/*!< GROUP0DTCM1 : Group0_DTCM1 powered down in deep sleep (8KB-32KB)       */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0 = 3,  /*!< GROUP0 : Both DTCMs in group0 are powered down in deep sleep
                                                     (0KB-32KB)                                                                */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_ALLBUTGROUP0DTCM0 = 6,/*!< ALLBUTGROUP0DTCM0 : Group1 and Group0_DTCM1 are powered down
                                                     in deep sleep (8KB-64KB)                                                  */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP1 = 4,  /*!< GROUP1 : Group1 DTCM powered down in deep sleep (32KB-64KB)               */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_ALL = 7,     /*!< ALL : All DTCMs powered down in deep sleep (0KB-64KB)                     */
} PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Enum;

/* =======================================================  MEMPWREN  ======================================================== */
/* ===========================================  PWRCTRL MEMPWREN CACHEB2 [31..31]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_CACHEB2                                                  */
  PWRCTRL_MEMPWREN_CACHEB2_EN          = 1,     /*!< EN : Power up Cache Bank 2                                                */
  PWRCTRL_MEMPWREN_CACHEB2_DIS         = 0,     /*!< DIS : Power down Cache Bank 2                                             */
} PWRCTRL_MEMPWREN_CACHEB2_Enum;

/* ===========================================  PWRCTRL MEMPWREN CACHEB0 [30..30]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_CACHEB0                                                  */
  PWRCTRL_MEMPWREN_CACHEB0_EN          = 1,     /*!< EN : Power up Cache Bank 0                                                */
  PWRCTRL_MEMPWREN_CACHEB0_DIS         = 0,     /*!< DIS : Power down Cache Bank 0                                             */
} PWRCTRL_MEMPWREN_CACHEB0_Enum;

/* ===========================================  PWRCTRL MEMPWREN FLASH1 [14..14]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_FLASH1                                                   */
  PWRCTRL_MEMPWREN_FLASH1_EN           = 1,     /*!< EN : Power up FLASH group 1 (1MB-2MB)                                     */
  PWRCTRL_MEMPWREN_FLASH1_DIS          = 0,     /*!< DIS : Power down FLASH group 1 (1MB-2MB)                                  */
} PWRCTRL_MEMPWREN_FLASH1_Enum;

/* ===========================================  PWRCTRL MEMPWREN FLASH0 [13..13]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_FLASH0                                                   */
  PWRCTRL_MEMPWREN_FLASH0_EN           = 1,     /*!< EN : Power up FLASH group 0 (0MB-1MB)                                     */
  PWRCTRL_MEMPWREN_FLASH0_DIS          = 0,     /*!< DIS : Power down FLASH group 0 (0MB-1MB)                                  */
} PWRCTRL_MEMPWREN_FLASH0_Enum;

/* =============================================  PWRCTRL MEMPWREN SRAM [3..12]  ============================================= */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_SRAM                                                     */
  PWRCTRL_MEMPWREN_SRAM_NONE           = 0,     /*!< NONE : Do not power ON any of the SRAM banks                              */
  PWRCTRL_MEMPWREN_SRAM_GROUP0         = 1,     /*!< GROUP0 : Power ON only SRAM 64KB group0 (addr: 0x10010000 -
                                                     0x1001FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP1         = 2,     /*!< GROUP1 : Power ON only SRAM 64KB group1 (addr: 0x10020000 -
                                                     0x1002FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP2         = 4,     /*!< GROUP2 : Power ON only SRAM 64KB group2 (addr: 0x10030000 -
                                                     0x1003FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP3         = 8,     /*!< GROUP3 : Power ON only SRAM 64KB group3 (addr: 0x10040000 -
                                                     0x1004FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP4         = 16,    /*!< GROUP4 : Power ON only SRAM 64KB group4 (addr: 0x10050000 -
                                                     0x1005FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP5         = 32,    /*!< GROUP5 : Power ON only SRAM 64KB group5 (addr: 0x10060000 -
                                                     0x1006FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP6         = 64,    /*!< GROUP6 : Power ON only SRAM 64KB group6 (addr: 0x10070000 -
                                                     0x1007FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP7         = 128,   /*!< GROUP7 : Power ON only SRAM 64KB group7 (addr: 0x10080000 -
                                                     0x1008FFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP8         = 256,   /*!< GROUP8 : Power ON only SRAM 96KB group8 (addr: 0x10090000 -
                                                     0x100A7FFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_GROUP9         = 512,   /*!< GROUP9 : Power ON only SRAM 96KB group9 (addr: 0x100A8000 -
                                                     0x100BFFFF)                                                               */
  PWRCTRL_MEMPWREN_SRAM_SRAM128K       = 3,     /*!< SRAM128K : Power ON only lower 128k (addr: 0x10010000 - 0x1002FFFF)       */
  PWRCTRL_MEMPWREN_SRAM_SRAM256K       = 15,    /*!< SRAM256K : Power ON only lower 256k (addr: 0x10010000 - 0x1004FFFF)       */
  PWRCTRL_MEMPWREN_SRAM_SRAM512K       = 255,   /*!< SRAM512K : Power ON only lower 512k (addr: 0x10010000 - 0x1008FFFF)       */
  PWRCTRL_MEMPWREN_SRAM_ALL            = 1023,  /*!< ALL : All SRAM banks (704K) powered ON (addr: 0x10010000 - 0x100BFFFF)    */
} PWRCTRL_MEMPWREN_SRAM_Enum;

/* =============================================  PWRCTRL MEMPWREN DTCM [0..2]  ============================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_DTCM                                                     */
  PWRCTRL_MEMPWREN_DTCM_NONE           = 0,     /*!< NONE : Do not enable power to any DTCMs                                   */
  PWRCTRL_MEMPWREN_DTCM_GROUP0DTCM0    = 1,     /*!< GROUP0DTCM0 : Power ON only 8KB GROUP0_DTCM0 (0 - 8KB, addr:
                                                     0x10000000 - 0x10001FFF)                                                  */
  PWRCTRL_MEMPWREN_DTCM_GROUP0DTCM1    = 2,     /*!< GROUP0DTCM1 : Power ON only 24KB GROUP0_DTCM1 (8KB - 32KB, addr:
                                                     0x10002000 - 0x10007FFF)                                                  */
  PWRCTRL_MEMPWREN_DTCM_GROUP0         = 3,     /*!< GROUP0 : Power ON only DTCMs in 32KB group0 (0 - 32KB, addr:
                                                     0x10000000 - 0x10007FFF)                                                  */
  PWRCTRL_MEMPWREN_DTCM_GROUP1         = 4,     /*!< GROUP1 : Power ON only DTCMs in 32KB group1 (32KB - 64KB, addr:
                                                     0x10008000 - 0x1000FFFF)                                                  */
  PWRCTRL_MEMPWREN_DTCM_ALL            = 7,     /*!< ALL : Power ON all DTCMs (0 - 64KB, addr: 0x10000000 - 0x1000FFFF)        */
} PWRCTRL_MEMPWREN_DTCM_Enum;

